/*
 * PDB file: .\sqldk.pdb\4C6932DE817A494FB495414434B778312\sqldk.pdb
 * Image architecture: AMD64 (0x8664)
 *
 * Dumped by pdbex tool v0.11, by wbenny
 */

struct StaticStorage<1024>;
enum POWER_ACTION;
enum _TAG_UNNAMED_1;
class TSinglyLinkedList<XE_DeferredEvent>;
enum tagHITRESULT;
union tagCY;
struct tagDEC;
struct _wireVARIANT;
enum XEEngineDiagnosticLevel;
enum _TAG_UNNAMED_2;
enum _TAG_UNNAMED_3;
enum _TAG_UNNAMED_4;
enum _TAG_UNNAMED_5;
class Spinlock<270,1,1>;
enum __vc_attributes::helper_attributes::v1_alttypeAttribute::type_e;
struct __vc_attributes::helper_attributes::v1_alttypeAttribute;
enum tagTYPEFLAGS;
struct IServiceProvider;
enum _TAG_UNNAMED_6;
class CAutoRefc<IXMLDOMNodeList>;
class CAutoRefc<IXMLDOMNode>;
struct _GUID;
class XE_XMLConfiguredSessionEnumerator;
enum POWER_INFORMATION_LEVEL;
class InterruptTicks<unsigned __int64>;
class SOS_Ticks<InterruptTicks<unsigned __int64>,-3>;
class CostInfo;
class MemObjCache<CMemThread<CMemDbg<CMemFixed> > >;
enum TCacheStore<CacheProbabilisticAlgorithm>::HashBucketAction;
struct XE_TArray<XEPredicateSource *,11>;
enum _TAG_UNNAMED_7;
enum XeSqlPkg::allocation_ring_buffer_recorded::CustomizableSlots;
enum WELL_KNOWN_SID_TYPE;
enum _TAG_UNNAMED_8;
class XE_AutoP<XE_FileSet>;
enum WbemErrorEnum;
struct tagPANOSE;
enum _TAG_UNNAMED_9;
enum _TAG_UNNAMED_10;
enum _TAG_UNNAMED_11;
struct IRootStorage;
enum _TAG_UNNAMED_12;
struct tagTYPEDESC;
struct tagIDLDESC;

class DmpPointer<XList<XE_Session> >;
class DmpPointer<XE_Session>;
class DmpXListIterator<XList<XE_Session>,512>;
class DmpPointer<SEListElem>;
class DmpListIterator<XE_Session,8,8,SEListElem,8,512>;
class DmpPointer<XE_SingletonTargetManager>;
class DmpPointer<XList<XE_TargetEntry> >;
class DmpPointer<XEObjectCollection>;
class DmpPointer<XEObject *>;
class DmpPointer<XE_BufferMgr>;
class DmpPointer<XList<XE_EventEntry> >;
class DmpPointer<XE_EventEntry>;
class DmpXListIterator<XList<XE_EventEntry>,512>;
class DmpListIterator<XE_EventEntry,8,0,SEListElem,8,512>;
class DmpPointer<XE_TargetEntry>;
class DmpXListIterator<XList<XE_TargetEntry>,512>;
class DmpListIterator<XE_TargetEntry,8,8,SEListElem,8,512>;
class DmpPointer<XE_ActualTargetEntry>;
class DmpPointer<XE_ProxyTargetEntry>;
class DmpPointer<XEPackage0::RingTarget>;
class DmpPointer<SESListSized<XEPackage0::RingTarget::EventEntry,0> >;
class DmpListIterator<XEPackage0::RingTarget::EventEntry,0,0,SESListSized<XEPackage0::RingTarget::EventEntry,0>,0,2000>;
class DmpPointer<XEPackage0::RingTarget::EventEntry>;
class DmpPointer<SESList<XE_Buffer,24> >;
class DmpPointer<XE_Buffer>;
class DmpPointer<XEBufferHeader>;
class DmpSEListIterator<SESList<XE_Buffer,24>,512>;
class DmpListIterator<XE_Buffer,0,24,SESList<XE_Buffer,24>,0,512>;
class DmpPointer<XE_OneTimeInit>;
class DmpPointer<enum XEEngineCustomizationFlags>;
class DmpPointer<XEHostProperties>;
class DmpPointer<XETicksConfig>;
class DmpPointer<SOSHost_MemoryClerk *>;
class DmpPointer<SOSHost_MemoryClerk>;
class DmpPointer<SOSHost_RecursiveMutex *>;
class DmpPointer<SOSHost_RecursiveMutex>;
class DmpPointer<XE_Timer *>;
class DmpPointer<XE_Timer>;
class DmpPointer<XE_NotificationManager *>;
class DmpPointer<XE_NotificationManager>;
class DmpPointer<SOSHost_MemObj *>;
class DmpPointer<SOSHost_MemObj>;
class DmpPointer<XList<XE_Session> *>;
struct XListDmpOffsets<XE_Session>;
struct XListDmpOffsets<XE_EventEntry>;
struct _DETOUR_CLR_HEADER;
struct _DETOUR_EXE_RESTORE;
struct _DETOUR_SECTION_RECORD;
struct _SYMBOL_INFO;
struct _DETOUR_SYM_INFO;
struct API_VERSION;
struct _IMAGEHLP_MODULE64;
struct DetourOperation;
struct _DETOUR_TRAMPOLINE;
struct DetourThread;
struct DETOUR_REGION;
struct CDetourDis::COPYENTRY;
class CDetourDis;
class Detour::CImageChars;
class Detour::CImage;
class Detour::CImageData;
class Detour::CImageImportFile;
class Detour::CImageImportName;
class Detour::CImageThunks;
struct HUFFMAN_DECODE_NODE_T;
struct LZ77_STAT_T;
struct LZ77_DECODER_T;
struct HUFFMAN_RADIX_SORT_CHAIN_T;
struct LZ77_PASS1_STATE_T;
struct $_s__CatchableTypeArray$_extraBytes_8;
class _com_error;
struct DOUBLE_ARG;
struct UnloadInfo;
struct _TP_CALLBACK_ENVIRON_V3;
struct InternalImgDelayDescr;
struct _s_ThrowInfo;
struct EHExceptionRecord::EHParameters;
struct EHExceptionRecord;
class <CrtImplementationDetails>::NativeDll;
union FT;
struct _GS_HANDLER_DATA;
struct CsFrame;

#include <pshpack1.h>
struct StaticStorage<1024>
{
  /* 0x0000 */ unsigned int m_buf[32];
}; /* size: 0x0080 */

enum POWER_ACTION
{
  PowerActionNone = 0,
  PowerActionReserved = 1,
  PowerActionSleep = 2,
  PowerActionHibernate = 3,
  PowerActionShutdown = 4,
  PowerActionShutdownReset = 5,
  PowerActionShutdownOff = 6,
  PowerActionWarmEject = 7,
};

typedef enum
{
  object_idIdx = 0,
  reasonIdx = 1,
  LastField = 2,
} TAG_UNNAMED_1, *PTAG_UNNAMED_1;

class TSinglyLinkedList<XE_DeferredEvent>
{
}; /* size: 0x0008 */

enum tagHITRESULT
{
  HITRESULT_OUTSIDE = 0,
  HITRESULT_TRANSPARENT = 1,
  HITRESULT_CLOSE = 2,
  HITRESULT_HIT = 3,
};

union tagCY
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long Lo;
      /* 0x0004 */ long Hi;
    }; /* size: 0x0008 */
    /* 0x0000 */ __int64 int64;
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

struct tagDEC
{
  /* 0x0000 */ unsigned short wReserved;
  union
  {
    struct
    {
      /* 0x0002 */ unsigned char scale;
      /* 0x0003 */ unsigned char sign;
    }; /* size: 0x0002 */
    /* 0x0002 */ unsigned short signscale;
  }; /* size: 0x0002 */
  /* 0x0004 */ unsigned long Hi32;
  union
  {
    struct
    {
      /* 0x0008 */ unsigned long Lo32;
      /* 0x000c */ unsigned long Mid32;
    }; /* size: 0x0008 */
    /* 0x0008 */ unsigned __int64 Lo64;
  }; /* size: 0x0008 */
}; /* size: 0x0010 */

typedef struct _wireVARIANT
{
  /* 0x0000 */ unsigned long clSize;
  /* 0x0004 */ unsigned long rpcReserved;
  /* 0x0008 */ unsigned short vt;
  /* 0x000a */ unsigned short wReserved1;
  /* 0x000c */ unsigned short wReserved2;
  /* 0x000e */ unsigned short wReserved3;
  union
  {
    /* 0x0010 */ __int64 llVal;
    /* 0x0010 */ long lVal;
    /* 0x0010 */ unsigned char bVal;
    /* 0x0010 */ short iVal;
    /* 0x0010 */ float fltVal;
    /* 0x0010 */ double dblVal;
    /* 0x0010 */ short boolVal;
    /* 0x0010 */ long scode;
    /* 0x0010 */ union tagCY cyVal;
    /* 0x0010 */ double date;
    /* 0x0010 */ struct _FLAGGED_WORD_BLOB* bstrVal;
    /* 0x0010 */ struct IUnknown* punkVal;
    /* 0x0010 */ struct IDispatch* pdispVal;
    /* 0x0010 */ struct _wireSAFEARRAY** parray;
    /* 0x0010 */ struct _wireBRECORD* brecVal;
    /* 0x0010 */ unsigned char* pbVal;
    /* 0x0010 */ short* piVal;
    /* 0x0010 */ long* plVal;
    /* 0x0010 */ __int64* pllVal;
    /* 0x0010 */ float* pfltVal;
    /* 0x0010 */ double* pdblVal;
    /* 0x0010 */ short* pboolVal;
    /* 0x0010 */ long* pscode;
    /* 0x0010 */ union tagCY* pcyVal;
    /* 0x0010 */ double* pdate;
    /* 0x0010 */ struct _FLAGGED_WORD_BLOB** pbstrVal;
    /* 0x0010 */ struct IUnknown** ppunkVal;
    /* 0x0010 */ struct IDispatch** ppdispVal;
    /* 0x0010 */ struct _wireSAFEARRAY*** pparray;
    /* 0x0010 */ struct _wireVARIANT** pvarVal;
    /* 0x0010 */ char cVal;
    /* 0x0010 */ unsigned short uiVal;
    /* 0x0010 */ unsigned long ulVal;
    /* 0x0010 */ unsigned __int64 ullVal;
    /* 0x0010 */ int intVal;
    /* 0x0010 */ unsigned int uintVal;
    /* 0x0010 */ struct tagDEC decVal;
    /* 0x0010 */ struct tagDEC* pdecVal;
    /* 0x0010 */ char* pcVal;
    /* 0x0010 */ unsigned short* puiVal;
    /* 0x0010 */ unsigned long* pulVal;
    /* 0x0010 */ unsigned __int64* pullVal;
    /* 0x0010 */ int* pintVal;
    struct
    {
      /* 0x0010 */ unsigned int* puintVal;
      /* 0x0018 */ long __PADDING__[2];
    }; /* size: 0x0010 */
  }; /* size: 0x0010 */
} wireVARIANT, *PwireVARIANT; /* size: 0x0020 */

enum XEEngineDiagnosticLevel
{
  XEED_NONE = 0,
  XEED_LOGGING = 1,
  XEED_EVENTS = 2,
  XEED_TARGETS = 4,
  XEED_BUFFERS = 8,
  XEED_DEFAULT = 0,
  XEED_ALL = 15,
};

typedef enum
{
  request_typeIdx = 0,
  db_idIdx = 1,
  table_idIdx = 2,
  index_idIdx = 3,
  hash_valueIdx = 4,
  cache_descriptorIdx = 5,
  cache_unique_idIdx = 6,
  LastField = 7,
} TAG_UNNAMED_2, *PTAG_UNNAMED_2;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 7,
  NVld = 2,
  VldEddOffset = 4,
  BufSize = 33,
} TAG_UNNAMED_3, *PTAG_UNNAMED_3;

typedef enum
{
  opcodeIdx = 0,
  task_addressIdx = 1,
  passesIdx = 2,
  LastField = 3,
} TAG_UNNAMED_4, *PTAG_UNNAMED_4;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 5,
  NVld = 0,
  VldEddOffset = 4,
  BufSize = 32,
} TAG_UNNAMED_5, *PTAG_UNNAMED_5;

class Spinlock<270,1,1>
{
}; /* size: 0x0004 */

typedef enum __vc_attributes::helper_attributes::v1_alttypeAttribute::type_e
{
  eBoolean = 0,
  eInteger = 1,
  eFloat = 2,
  eDouble = 3,
} _vc_attributes::helper_attributes::v1_alttypeAttribute::type_e, *P_vc_attributes::helper_attributes::v1_alttypeAttribute::type_e;

typedef struct __vc_attributes::helper_attributes::v1_alttypeAttribute
{
  /* 0x0000 */ enum __vc_attributes::helper_attributes::v1_alttypeAttribute::type_e type;
} _vc_attributes::helper_attributes::v1_alttypeAttribute, *P_vc_attributes::helper_attributes::v1_alttypeAttribute; /* size: 0x0004 */

enum tagTYPEFLAGS
{
  TYPEFLAG_FAPPOBJECT = 1,
  TYPEFLAG_FCANCREATE = 2,
  TYPEFLAG_FLICENSED = 4,
  TYPEFLAG_FPREDECLID = 8,
  TYPEFLAG_FHIDDEN = 16,
  TYPEFLAG_FCONTROL = 32,
  TYPEFLAG_FDUAL = 64,
  TYPEFLAG_FNONEXTENSIBLE = 128,
  TYPEFLAG_FOLEAUTOMATION = 256,
  TYPEFLAG_FRESTRICTED = 512,
  TYPEFLAG_FAGGREGATABLE = 1024,
  TYPEFLAG_FREPLACEABLE = 2048,
  TYPEFLAG_FDISPATCHABLE = 4096,
  TYPEFLAG_FREVERSEBIND = 8192,
  TYPEFLAG_FPROXY = 16384,
};

struct IServiceProvider
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 5,
  NVld = 2,
  VldEddOffset = 2,
  BufSize = 28,
} TAG_UNNAMED_6, *PTAG_UNNAMED_6;

class CAutoRefc<IXMLDOMNodeList>
{
  /* 0x0000 */ struct IXMLDOMNodeList* m_pt;
}; /* size: 0x0008 */

class CAutoRefc<IXMLDOMNode>
{
  /* 0x0000 */ struct IXMLDOMNode* m_pt;
}; /* size: 0x0008 */

typedef struct _GUID
{
  /* 0x0000 */ unsigned long Data1;
  /* 0x0004 */ unsigned short Data2;
  /* 0x0006 */ unsigned short Data3;
  /* 0x0008 */ unsigned char Data4[8];
} GUID, *PGUID; /* size: 0x0010 */

class XE_XMLConfiguredSessionEnumerator
{
  /* 0x0000 */ long Padding_0[4];
  /* 0x0010 */ class XE_XMLConfig* m_pConfig;
  /* 0x0018 */ class CAutoRefc<IXMLDOMNodeList> m_pSessionNodes;
  /* 0x0020 */ class CAutoRefc<IXMLDOMNode> m_pCurrentSession;
  /* 0x0028 */ struct _GUID m_sessionTag;
}; /* size: 0x0038 */

enum POWER_INFORMATION_LEVEL
{
  SystemPowerPolicyAc = 0,
  SystemPowerPolicyDc = 1,
  VerifySystemPolicyAc = 2,
  VerifySystemPolicyDc = 3,
  SystemPowerCapabilities = 4,
  SystemBatteryState = 5,
  SystemPowerStateHandler = 6,
  ProcessorStateHandler = 7,
  SystemPowerPolicyCurrent = 8,
  AdministratorPowerPolicy = 9,
  SystemReserveHiberFile = 10,
  ProcessorInformation = 11,
  SystemPowerInformation = 12,
  ProcessorStateHandler2 = 13,
  LastWakeTime = 14,
  LastSleepTime = 15,
  SystemExecutionState = 16,
  SystemPowerStateNotifyHandler = 17,
  ProcessorPowerPolicyAc = 18,
  ProcessorPowerPolicyDc = 19,
  VerifyProcessorPowerPolicyAc = 20,
  VerifyProcessorPowerPolicyDc = 21,
  ProcessorPowerPolicyCurrent = 22,
  SystemPowerStateLogging = 23,
  SystemPowerLoggingEntry = 24,
  SetPowerSettingValue = 25,
  NotifyUserPowerSetting = 26,
  PowerInformationLevelUnused0 = 27,
  SystemMonitorHiberBootPowerOff = 28,
  SystemVideoState = 29,
  TraceApplicationPowerMessage = 30,
  TraceApplicationPowerMessageEnd = 31,
  ProcessorPerfStates = 32,
  ProcessorIdleStates = 33,
  ProcessorCap = 34,
  SystemWakeSource = 35,
  SystemHiberFileInformation = 36,
  TraceServicePowerMessage = 37,
  ProcessorLoad = 38,
  PowerShutdownNotification = 39,
  MonitorCapabilities = 40,
  SessionPowerInit = 41,
  SessionDisplayState = 42,
  PowerRequestCreate = 43,
  PowerRequestAction = 44,
  GetPowerRequestList = 45,
  ProcessorInformationEx = 46,
  NotifyUserModeLegacyPowerEvent = 47,
  GroupPark = 48,
  ProcessorIdleDomains = 49,
  WakeTimerList = 50,
  SystemHiberFileSize = 51,
  ProcessorIdleStatesHv = 52,
  ProcessorPerfStatesHv = 53,
  ProcessorPerfCapHv = 54,
  ProcessorSetIdle = 55,
  LogicalProcessorIdling = 56,
  UserPresence = 57,
  PowerSettingNotificationName = 58,
  GetPowerSettingValue = 59,
  IdleResiliency = 60,
  SessionRITState = 61,
  SessionConnectNotification = 62,
  SessionPowerCleanup = 63,
  SessionLockState = 64,
  SystemHiberbootState = 65,
  PlatformInformation = 66,
  PdcInvocation = 67,
  MonitorInvocation = 68,
  FirmwareTableInformationRegistered = 69,
  SetShutdownSelectedTime = 70,
  PowerInformationLevelMaximum = 71,
};

class InterruptTicks<unsigned __int64>
{
  /* 0x0000 */ unsigned __int64 m_InterruptTicks;
}; /* size: 0x0008 */

class SOS_Ticks<InterruptTicks<unsigned __int64>,-3>
{
  /* 0x0000 */ class InterruptTicks<unsigned __int64> m_PrivateSource;
}; /* size: 0x0008 */

class CostInfo
{
  /* 0x0000 */ unsigned long m_Cost;
  /* 0x0004 */ unsigned long m_ContextSwitches;
  /* 0x0008 */ class SOS_Ticks<InterruptTicks<unsigned __int64>,-3> m_ExclusiveTime;
  /* 0x0010 */ unsigned __int64 m_ExclusiveCpuTicks;
  /* 0x0018 */ class SOS_Ticks<InterruptTicks<unsigned __int64>,-3> m_WaitTime;
  /* 0x0020 */ unsigned long m_IOs;
  /* 0x0024 */ long Padding_1;
  /* 0x0028 */ class Worker* m_CachingWorker;
  /* 0x0030 */ unsigned long m_RoundsWillSurvive;
  /* 0x0034 */ long Padding_2;
  /* 0x0038 */ __int64 m_MemoryPages;
  /* 0x0040 */ unsigned long m_status;
}; /* size: 0x0048 */

class MemObjCache<CMemThread<CMemDbg<CMemFixed> > >
{
  /* 0x0000 */ long Padding_3[344];
  /* 0x0560 */ void* m_cacheEntryDescriptor;
  /* 0x0568 */ class CostInfo m_costInfo;
}; /* size: 0x05b0 */

enum TCacheStore<CacheProbabilisticAlgorithm>::HashBucketAction
{
  INSERT = 0,
  REMOVE = 1,
};

struct XE_TArray<XEPredicateSource *,11>
{
  /* 0x0000 */ struct XEPredicateSource* m_array[11];
}; /* size: 0x0058 */

typedef enum
{
  database_idIdx = 0,
  is_remoteIdx = 1,
  total_page_io_latch_waitsIdx = 2,
  page_io_latch_wait_time_in_msIdx = 3,
  total_page_latch_waitsIdx = 4,
  page_latch_wait_time_in_msIdx = 5,
  LastField = 6,
} TAG_UNNAMED_7, *PTAG_UNNAMED_7;

enum XeSqlPkg::allocation_ring_buffer_recorded::CustomizableSlots
{
  collect_call_stackSlot = 0,
};

enum WELL_KNOWN_SID_TYPE
{
  WinNullSid = 0,
  WinWorldSid = 1,
  WinLocalSid = 2,
  WinCreatorOwnerSid = 3,
  WinCreatorGroupSid = 4,
  WinCreatorOwnerServerSid = 5,
  WinCreatorGroupServerSid = 6,
  WinNtAuthoritySid = 7,
  WinDialupSid = 8,
  WinNetworkSid = 9,
  WinBatchSid = 10,
  WinInteractiveSid = 11,
  WinServiceSid = 12,
  WinAnonymousSid = 13,
  WinProxySid = 14,
  WinEnterpriseControllersSid = 15,
  WinSelfSid = 16,
  WinAuthenticatedUserSid = 17,
  WinRestrictedCodeSid = 18,
  WinTerminalServerSid = 19,
  WinRemoteLogonIdSid = 20,
  WinLogonIdsSid = 21,
  WinLocalSystemSid = 22,
  WinLocalServiceSid = 23,
  WinNetworkServiceSid = 24,
  WinBuiltinDomainSid = 25,
  WinBuiltinAdministratorsSid = 26,
  WinBuiltinUsersSid = 27,
  WinBuiltinGuestsSid = 28,
  WinBuiltinPowerUsersSid = 29,
  WinBuiltinAccountOperatorsSid = 30,
  WinBuiltinSystemOperatorsSid = 31,
  WinBuiltinPrintOperatorsSid = 32,
  WinBuiltinBackupOperatorsSid = 33,
  WinBuiltinReplicatorSid = 34,
  WinBuiltinPreWindows2000CompatibleAccessSid = 35,
  WinBuiltinRemoteDesktopUsersSid = 36,
  WinBuiltinNetworkConfigurationOperatorsSid = 37,
  WinAccountAdministratorSid = 38,
  WinAccountGuestSid = 39,
  WinAccountKrbtgtSid = 40,
  WinAccountDomainAdminsSid = 41,
  WinAccountDomainUsersSid = 42,
  WinAccountDomainGuestsSid = 43,
  WinAccountComputersSid = 44,
  WinAccountControllersSid = 45,
  WinAccountCertAdminsSid = 46,
  WinAccountSchemaAdminsSid = 47,
  WinAccountEnterpriseAdminsSid = 48,
  WinAccountPolicyAdminsSid = 49,
  WinAccountRasAndIasServersSid = 50,
  WinNTLMAuthenticationSid = 51,
  WinDigestAuthenticationSid = 52,
  WinSChannelAuthenticationSid = 53,
  WinThisOrganizationSid = 54,
  WinOtherOrganizationSid = 55,
  WinBuiltinIncomingForestTrustBuildersSid = 56,
  WinBuiltinPerfMonitoringUsersSid = 57,
  WinBuiltinPerfLoggingUsersSid = 58,
  WinBuiltinAuthorizationAccessSid = 59,
  WinBuiltinTerminalServerLicenseServersSid = 60,
  WinBuiltinDCOMUsersSid = 61,
  WinBuiltinIUsersSid = 62,
  WinIUserSid = 63,
  WinBuiltinCryptoOperatorsSid = 64,
  WinUntrustedLabelSid = 65,
  WinLowLabelSid = 66,
  WinMediumLabelSid = 67,
  WinHighLabelSid = 68,
  WinSystemLabelSid = 69,
  WinWriteRestrictedCodeSid = 70,
  WinCreatorOwnerRightsSid = 71,
  WinCacheablePrincipalsGroupSid = 72,
  WinNonCacheablePrincipalsGroupSid = 73,
  WinEnterpriseReadonlyControllersSid = 74,
  WinAccountReadonlyControllersSid = 75,
  WinBuiltinEventLogReadersGroup = 76,
  WinNewEnterpriseReadonlyControllersSid = 77,
  WinBuiltinCertSvcDComAccessGroup = 78,
  WinMediumPlusLabelSid = 79,
  WinLocalLogonSid = 80,
  WinConsoleLogonSid = 81,
  WinThisOrganizationCertificateSid = 82,
  WinApplicationPackageAuthoritySid = 83,
  WinBuiltinAnyPackageSid = 84,
  WinCapabilityInternetClientSid = 85,
  WinCapabilityInternetClientServerSid = 86,
  WinCapabilityPrivateNetworkClientServerSid = 87,
  WinCapabilityPicturesLibrarySid = 88,
  WinCapabilityVideosLibrarySid = 89,
  WinCapabilityMusicLibrarySid = 90,
  WinCapabilityDocumentsLibrarySid = 91,
  WinCapabilitySharedUserCertificatesSid = 92,
  WinCapabilityDefaultWindowsCredentialsSid = 93,
  WinCapabilityRemovableStorageSid = 94,
  WinBuiltinRDSRemoteAccessServersSid = 95,
  WinBuiltinRDSEndpointServersSid = 96,
  WinBuiltinRDSManagementServersSid = 97,
  WinUserModeDriversSid = 98,
  WinBuiltinHyperVAdminsSid = 99,
};

typedef enum
{
  addressIdx = 0,
  modeIdx = 1,
  classIdx = 2,
  keep_countIdx = 3,
  shared_countIdx = 4,
  update_countIdx = 5,
  exclusive_countIdx = 6,
  destroy_countIdx = 7,
  has_waitersIdx = 8,
  is_superlatchIdx = 9,
  is_poisonedIdx = 10,
  durationIdx = 11,
  database_idIdx = 12,
  file_idIdx = 13,
  page_idIdx = 14,
  task_ownerIdx = 15,
  continue_waitIdx = 16,
  LastField = 17,
} TAG_UNNAMED_8, *PTAG_UNNAMED_8;

class XE_AutoP<XE_FileSet>
{
}; /* size: 0x0008 */

enum WbemErrorEnum
{
  wbemNoErr = 0,
  wbemErrFailed = -2147217407,
  wbemErrNotFound = -2147217406,
  wbemErrAccessDenied = -2147217405,
  wbemErrProviderFailure = -2147217404,
  wbemErrTypeMismatch = -2147217403,
  wbemErrOutOfMemory = -2147217402,
  wbemErrInvalidContext = -2147217401,
  wbemErrInvalidParameter = -2147217400,
  wbemErrNotAvailable = -2147217399,
  wbemErrCriticalError = -2147217398,
  wbemErrInvalidStream = -2147217397,
  wbemErrNotSupported = -2147217396,
  wbemErrInvalidSuperclass = -2147217395,
  wbemErrInvalidNamespace = -2147217394,
  wbemErrInvalidObject = -2147217393,
  wbemErrInvalidClass = -2147217392,
  wbemErrProviderNotFound = -2147217391,
  wbemErrInvalidProviderRegistration = -2147217390,
  wbemErrProviderLoadFailure = -2147217389,
  wbemErrInitializationFailure = -2147217388,
  wbemErrTransportFailure = -2147217387,
  wbemErrInvalidOperation = -2147217386,
  wbemErrInvalidQuery = -2147217385,
  wbemErrInvalidQueryType = -2147217384,
  wbemErrAlreadyExists = -2147217383,
  wbemErrOverrideNotAllowed = -2147217382,
  wbemErrPropagatedQualifier = -2147217381,
  wbemErrPropagatedProperty = -2147217380,
  wbemErrUnexpected = -2147217379,
  wbemErrIllegalOperation = -2147217378,
  wbemErrCannotBeKey = -2147217377,
  wbemErrIncompleteClass = -2147217376,
  wbemErrInvalidSyntax = -2147217375,
  wbemErrNondecoratedObject = -2147217374,
  wbemErrReadOnly = -2147217373,
  wbemErrProviderNotCapable = -2147217372,
  wbemErrClassHasChildren = -2147217371,
  wbemErrClassHasInstances = -2147217370,
  wbemErrQueryNotImplemented = -2147217369,
  wbemErrIllegalNull = -2147217368,
  wbemErrInvalidQualifierType = -2147217367,
  wbemErrInvalidPropertyType = -2147217366,
  wbemErrValueOutOfRange = -2147217365,
  wbemErrCannotBeSingleton = -2147217364,
  wbemErrInvalidCimType = -2147217363,
  wbemErrInvalidMethod = -2147217362,
  wbemErrInvalidMethodParameters = -2147217361,
  wbemErrSystemProperty = -2147217360,
  wbemErrInvalidProperty = -2147217359,
  wbemErrCallCancelled = -2147217358,
  wbemErrShuttingDown = -2147217357,
  wbemErrPropagatedMethod = -2147217356,
  wbemErrUnsupportedParameter = -2147217355,
  wbemErrMissingParameter = -2147217354,
  wbemErrInvalidParameterId = -2147217353,
  wbemErrNonConsecutiveParameterIds = -2147217352,
  wbemErrParameterIdOnRetval = -2147217351,
  wbemErrInvalidObjectPath = -2147217350,
  wbemErrOutOfDiskSpace = -2147217349,
  wbemErrBufferTooSmall = -2147217348,
  wbemErrUnsupportedPutExtension = -2147217347,
  wbemErrUnknownObjectType = -2147217346,
  wbemErrUnknownPacketType = -2147217345,
  wbemErrMarshalVersionMismatch = -2147217344,
  wbemErrMarshalInvalidSignature = -2147217343,
  wbemErrInvalidQualifier = -2147217342,
  wbemErrInvalidDuplicateParameter = -2147217341,
  wbemErrTooMuchData = -2147217340,
  wbemErrServerTooBusy = -2147217339,
  wbemErrInvalidFlavor = -2147217338,
  wbemErrCircularReference = -2147217337,
  wbemErrUnsupportedClassUpdate = -2147217336,
  wbemErrCannotChangeKeyInheritance = -2147217335,
  wbemErrCannotChangeIndexInheritance = -2147217328,
  wbemErrTooManyProperties = -2147217327,
  wbemErrUpdateTypeMismatch = -2147217326,
  wbemErrUpdateOverrideNotAllowed = -2147217325,
  wbemErrUpdatePropagatedMethod = -2147217324,
  wbemErrMethodNotImplemented = -2147217323,
  wbemErrMethodDisabled = -2147217322,
  wbemErrRefresherBusy = -2147217321,
  wbemErrUnparsableQuery = -2147217320,
  wbemErrNotEventClass = -2147217319,
  wbemErrMissingGroupWithin = -2147217318,
  wbemErrMissingAggregationList = -2147217317,
  wbemErrPropertyNotAnObject = -2147217316,
  wbemErrAggregatingByObject = -2147217315,
  wbemErrUninterpretableProviderQuery = -2147217313,
  wbemErrBackupRestoreWinmgmtRunning = -2147217312,
  wbemErrQueueOverflow = -2147217311,
  wbemErrPrivilegeNotHeld = -2147217310,
  wbemErrInvalidOperator = -2147217309,
  wbemErrLocalCredentials = -2147217308,
  wbemErrCannotBeAbstract = -2147217307,
  wbemErrAmendedObject = -2147217306,
  wbemErrClientTooSlow = -2147217305,
  wbemErrNullSecurityDescriptor = -2147217304,
  wbemErrTimeout = -2147217303,
  wbemErrInvalidAssociation = -2147217302,
  wbemErrAmbiguousOperation = -2147217301,
  wbemErrQuotaViolation = -2147217300,
  wbemErrTransactionConflict = -2147217299,
  wbemErrForcedRollback = -2147217298,
  wbemErrUnsupportedLocale = -2147217297,
  wbemErrHandleOutOfDate = -2147217296,
  wbemErrConnectionFailed = -2147217295,
  wbemErrInvalidHandleRequest = -2147217294,
  wbemErrPropertyNameTooWide = -2147217293,
  wbemErrClassNameTooWide = -2147217292,
  wbemErrMethodNameTooWide = -2147217291,
  wbemErrQualifierNameTooWide = -2147217290,
  wbemErrRerunCommand = -2147217289,
  wbemErrDatabaseVerMismatch = -2147217288,
  wbemErrVetoPut = -2147217287,
  wbemErrVetoDelete = -2147217286,
  wbemErrInvalidLocale = -2147217280,
  wbemErrProviderSuspended = -2147217279,
  wbemErrSynchronizationRequired = -2147217278,
  wbemErrNoSchema = -2147217277,
  wbemErrProviderAlreadyRegistered = -2147217276,
  wbemErrProviderNotRegistered = -2147217275,
  wbemErrFatalTransportError = -2147217274,
  wbemErrEncryptedConnectionRequired = -2147217273,
  wbemErrRegistrationTooBroad = -2147213311,
  wbemErrRegistrationTooPrecise = -2147213310,
  wbemErrTimedout = -2147209215,
  wbemErrResetToDefault = -2147209214,
};

struct tagPANOSE
{
  /* 0x0000 */ unsigned char bFamilyType;
  /* 0x0001 */ unsigned char bSerifStyle;
  /* 0x0002 */ unsigned char bWeight;
  /* 0x0003 */ unsigned char bProportion;
  /* 0x0004 */ unsigned char bContrast;
  /* 0x0005 */ unsigned char bStrokeVariation;
  /* 0x0006 */ unsigned char bArmStyle;
  /* 0x0007 */ unsigned char bLetterform;
  /* 0x0008 */ unsigned char bMidline;
  /* 0x0009 */ unsigned char bXHeight;
}; /* size: 0x000a */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 12,
  NVld = 7,
  VldEddOffset = 4,
  BufSize = 79,
} TAG_UNNAMED_9, *PTAG_UNNAMED_9;

typedef enum
{
  ListElementOffset = 8,
} TAG_UNNAMED_10, *PTAG_UNNAMED_10;

typedef enum
{
  verbosityIdx = 0,
  componentIdx = 1,
  locationIdx = 2,
  messageIdx = 3,
  workitem_descriptionIdx = 4,
  transaction_idIdx = 5,
  correlation_idsIdx = 6,
  logical_pathIdx = 7,
  physical_pathIdx = 8,
  original_pathIdx = 9,
  LastField = 10,
} TAG_UNNAMED_11, *PTAG_UNNAMED_11;

struct IRootStorage
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 1,
  NDynamic = 15,
  NVld = 1,
  VldEddOffset = 13,
  BufSize = 86,
} TAG_UNNAMED_12, *PTAG_UNNAMED_12;

struct tagTYPEDESC
{
  union
  {
    /* 0x0000 */ struct tagTYPEDESC* lptdesc;
    /* 0x0000 */ struct tagARRAYDESC* lpadesc;
    /* 0x0000 */ unsigned long hreftype;
  }; /* size: 0x0008 */
  /* 0x0008 */ unsigned short vt;
  /* 0x000a */ char __PADDING__[6];
}; /* size: 0x0010 */

struct tagIDLDESC
{
  /* 0x0000 */ unsigned __int64 dwReserved;
  /* 0x0008 */ unsigned short wIDLFlags;
  /* 0x000a */ char __PADDING__[6];
}; /* size: 0x0010 */

struct tagPARAMDESC
{
  /* 0x0000 */ struct tagPARAMDESCEX* pparamdescex;
  /* 0x0008 */ unsigned short wParamFlags;
  /* 0x000a */ char __PADDING__[6];
}; /* size: 0x0010 */

struct tagELEMDESC
{
  /* 0x0000 */ struct tagTYPEDESC tdesc;
  union
  {
    /* 0x0010 */ struct tagIDLDESC idldesc;
    /* 0x0010 */ struct tagPARAMDESC paramdesc;
  }; /* size: 0x0010 */
}; /* size: 0x0020 */

enum tagVARKIND
{
  VAR_PERINSTANCE = 0,
  VAR_STATIC = 1,
  VAR_CONST = 2,
  VAR_DISPATCH = 3,
};

struct tagVARDESC
{
  /* 0x0000 */ long memid;
  /* 0x0004 */ long Padding_4;
  /* 0x0008 */ wchar_t* lpstrSchema;
  union
  {
    /* 0x0010 */ unsigned long oInst;
    /* 0x0010 */ struct tagVARIANT* lpvarValue;
  }; /* size: 0x0008 */
  /* 0x0018 */ struct tagELEMDESC elemdescVar;
  /* 0x0038 */ unsigned short wVarFlags;
  /* 0x003a */ char Padding_5[2];
  /* 0x003c */ enum tagVARKIND varkind;
}; /* size: 0x0040 */

struct XERelativeObjectId
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned int m_packageId : 10; /* bit position: 0 */
    /* 0x0000 */ unsigned int m_objectId : 18; /* bit position: 10 */
    /* 0x0000 */ unsigned int m_type : 4; /* bit position: 28 */
  }; /* bitfield */
}; /* size: 0x0004 */

struct XEStaticAttribute
{
  /* 0x0000 */ struct XERelativeObjectId m_type;
  /* 0x0004 */ long Padding_6;
  /* 0x0008 */ const wchar_t* m_name;
  /* 0x0010 */ unsigned __int64 m_value;
  /* 0x0018 */ const wchar_t* m_description;
  /* 0x0020 */ unsigned int m_resourceid;
  /* 0x0024 */ long __PADDING__[1];
}; /* size: 0x0028 */

struct XE_TArray<XEStaticAttribute,4>
{
  /* 0x0000 */ struct XEStaticAttribute m_array[4];
}; /* size: 0x00a0 */

struct XE_TArray<XECustomizableAttribute,0>
{
  /* 0x0000 */ struct XECustomizableAttribute* m_array;
}; /* size: 0x0008 */

struct XEDataAttribute
{
  /* 0x0000 */ struct XERelativeObjectId m_type;
  /* 0x0004 */ long Padding_7;
  /* 0x0008 */ const wchar_t* m_name;
  /* 0x0010 */ unsigned short m_offset;
  /* 0x0012 */ unsigned short m_capabilities;
  /* 0x0014 */ long Padding_8;
  /* 0x0018 */ const wchar_t* m_description;
  /* 0x0020 */ unsigned int m_resourceid;
  /* 0x0024 */ long __PADDING__[1];
}; /* size: 0x0028 */

struct XE_TArray<XEDataAttribute,17>
{
  /* 0x0000 */ struct XEDataAttribute m_array[17];
}; /* size: 0x02a8 */

struct XEObject
{
  /* 0x0000 */ unsigned short m_version;
  /* 0x0002 */ unsigned char m_genericCapabilites;
  /* 0x0003 */ unsigned char m_specificCapabilities;
  /* 0x0004 */ struct XERelativeObjectId m_rid;
  /* 0x0008 */ const wchar_t* m_name;
  /* 0x0010 */ const wchar_t* m_description;
  /* 0x0018 */ unsigned int m_resourceid;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

struct XEEvent
{
  /* 0x0000 */ struct XEObject m_object;
  /* 0x0020 */ unsigned short m_staticCount;
  /* 0x0022 */ unsigned short m_customizableCount;
  /* 0x0024 */ unsigned short m_dataCount;
  /* 0x0026 */ unsigned short m_fixedSizeDataCount;
  /* 0x0028 */ void* m_pEventHint;
  /* 0x0030 */ struct XEStaticAttribute* m_staticAttributes;
  /* 0x0038 */ struct XECustomizableAttribute* m_customizableAttributes;
  /* 0x0040 */ struct XEDataAttribute* m_dataAttributes;
}; /* size: 0x0048 */

struct XE_TEvent<4,0,17>
{
  /* 0x0000 */ struct XE_TArray<XEStaticAttribute,4> m_staticAttr;
  /* 0x00a0 */ struct XE_TArray<XECustomizableAttribute,0> m_customizableAttr;
  /* 0x00a8 */ struct XE_TArray<XEDataAttribute,17> m_dynamicAttr;
  /* 0x0350 */ struct XEEvent m_event;
}; /* size: 0x0398 */

struct SListBase::Elem
{
  /* 0x0000 */ struct SListBase::Elem* m_next;
}; /* size: 0x0008 */

struct SListBase
{
  /* 0x0000 */ struct SListBase::Elem m_head;
}; /* size: 0x0008 */

struct SESList<XESessionContext,56>
{
  /* 0x0000 */ struct SListBase m_list;
}; /* size: 0x0008 */

struct XE_SessionContextList
{
  /* 0x0000 */ struct SESList<XESessionContext,56> m_list;
}; /* size: 0x0008 */

class XeSqlPkg::broker_message_undeliverable
{
  union
  {
    /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
    /* 0x0000 */ struct XE_TEvent<4,0,17> sm_metadata;
    /* 0x0000 */ struct XE_SessionContextList sm_contexts;
    struct
    {
      /* 0x0000 */ const struct _GUID sm_guid;
      /* 0x0010 */ long Padding_9[140];
      /* 0x0240 */ unsigned char m_buf[102];
    }; /* size: 0x0076 */
    /* 0x0000 */ const int error_numberOffset;
    /* 0x0000 */ const int error_severityOffset;
    /* 0x0000 */ const int error_stateOffset;
    /* 0x0000 */ const int acknowledgement_fragment_numberOffset;
    /* 0x0000 */ const int message_fragment_numberOffset;
    /* 0x0000 */ const int acknowledgement_sequence_numberOffset;
    /* 0x0000 */ const int message_sequence_numberOffset;
    /* 0x0000 */ const int sequenced_messageOffset;
    /* 0x0000 */ const int is_initiatorOffset;
    /* 0x0000 */ const int conversation_idOffset;
    /* 0x0000 */ const int message_drop_reasonOffset;
    /* 0x0000 */ const int message_type_nameOffset;
    /* 0x0000 */ const int service_contract_nameOffset;
    /* 0x0000 */ const int from_service_nameOffset;
    /* 0x0000 */ const int from_broker_nameOffset;
    /* 0x0000 */ const int to_service_nameOffset;
    /* 0x0000 */ const int to_broker_nameOffset;
  }; /* size: 0x0398 */
}; /* size: 0x02a8 */

enum WbemComparisonFlagEnum
{
  wbemComparisonFlagIncludeAll = 0,
  wbemComparisonFlagIgnoreQualifiers = 1,
  wbemComparisonFlagIgnoreObjectSource = 2,
  wbemComparisonFlagIgnoreDefaultValues = 4,
  wbemComparisonFlagIgnoreClass = 8,
  wbemComparisonFlagIgnoreCase = 16,
  wbemComparisonFlagIgnoreFlavor = 32,
};

typedef struct _UNICODE_STRING
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short MaximumLength;
  /* 0x0004 */ long Padding_10;
  /* 0x0008 */ unsigned short* Buffer;
} UNICODE_STRING, *PUNICODE_STRING; /* size: 0x0010 */

typedef struct _PLUGPLAY_CONTROL_STATUS_DATA
{
  /* 0x0000 */ struct _UNICODE_STRING DeviceInstance;
  /* 0x0010 */ unsigned long Operation;
  /* 0x0014 */ unsigned long DeviceStatus;
  /* 0x0018 */ unsigned long DeviceProblem;
  /* 0x001c */ unsigned long Flags;
} PLUGPLAY_CONTROL_STATUS_DATA, *PPLUGPLAY_CONTROL_STATUS_DATA; /* size: 0x0020 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 17,
  NVld = 0,
  VldEddOffset = 16,
  BufSize = 66,
} TAG_UNNAMED_13, *PTAG_UNNAMED_13;

typedef struct _SYSTEM_POOLTAG
{
  union
  {
    /* 0x0000 */ unsigned char Tag[4];
    /* 0x0000 */ unsigned long TagUlong;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned long PagedAllocs;
  /* 0x0008 */ unsigned long PagedFrees;
  /* 0x000c */ long Padding_11;
  /* 0x0010 */ unsigned __int64 PagedUsed;
  /* 0x0018 */ unsigned long NonPagedAllocs;
  /* 0x001c */ unsigned long NonPagedFrees;
  /* 0x0020 */ unsigned __int64 NonPagedUsed;
} SYSTEM_POOLTAG, *PSYSTEM_POOLTAG; /* size: 0x0028 */

enum VARENUM
{
  VT_EMPTY = 0,
  VT_NULL = 1,
  VT_I2 = 2,
  VT_I4 = 3,
  VT_R4 = 4,
  VT_R8 = 5,
  VT_CY = 6,
  VT_DATE = 7,
  VT_BSTR = 8,
  VT_DISPATCH = 9,
  VT_ERROR = 10,
  VT_BOOL = 11,
  VT_VARIANT = 12,
  VT_UNKNOWN = 13,
  VT_DECIMAL = 14,
  VT_I1 = 16,
  VT_UI1 = 17,
  VT_UI2 = 18,
  VT_UI4 = 19,
  VT_I8 = 20,
  VT_UI8 = 21,
  VT_INT = 22,
  VT_UINT = 23,
  VT_VOID = 24,
  VT_HRESULT = 25,
  VT_PTR = 26,
  VT_SAFEARRAY = 27,
  VT_CARRAY = 28,
  VT_USERDEFINED = 29,
  VT_LPSTR = 30,
  VT_LPWSTR = 31,
  VT_RECORD = 36,
  VT_INT_PTR = 37,
  VT_UINT_PTR = 38,
  VT_FILETIME = 64,
  VT_BLOB = 65,
  VT_STREAM = 66,
  VT_STORAGE = 67,
  VT_STREAMED_OBJECT = 68,
  VT_STORED_OBJECT = 69,
  VT_BLOB_OBJECT = 70,
  VT_CF = 71,
  VT_CLSID = 72,
  VT_VERSIONED_STREAM = 73,
  VT_BSTR_BLOB = 4095,
  VT_VECTOR = 4096,
  VT_ARRAY = 8192,
  VT_BYREF = 16384,
  VT_RESERVED = 0xffff8000,
  VT_ILLEGAL = 0xffffffff,
  VT_ILLEGALMASKED = 4095,
  VT_TYPEMASK = 4095,
};

class CXColumn<unsigned __int64>
{
  /* 0x0000 */ long Padding_12[6];
  /* 0x0018 */ unsigned __int64* m_startPointer;
}; /* size: 0x0020 */

typedef enum
{
  database_idIdx = 0,
  flushed_logIdx = 1,
  end_of_logIdx = 2,
  clean_shutdownIdx = 3,
  group_idIdx = 4,
  replica_idIdx = 5,
  ag_database_idIdx = 6,
  LastField = 7,
} TAG_UNNAMED_14, *PTAG_UNNAMED_14;

typedef struct _LIST_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY* Flink;
  /* 0x0008 */ struct _LIST_ENTRY* Blink;
} LIST_ENTRY, *PLIST_ENTRY; /* size: 0x0010 */

enum ABORT_AND_LCK_EXCEPTIONS
{
  LCKFAIL_GETIAMPAGE_S = 0,
  LCKFAIL_GETIAMPAGE_X = 1,
  LCKFAIL_DEALLOCMIXEDPAGE = 2,
  LCKFAIL_DEALLOCINDEXEXTENTS_IAMPAGE = 3,
  LCKFAIL_DEALLOCEXT_FOR_DROPPED_AU = 4,
  LCKFAIL_DDAU_SCAN_AFTER_RECOVERY = 5,
  LCKFAIL_DDAU_LOCK_AND_VERIFY = 6,
  LCKFAIL_DDAU_DEALLOCFIRSTIAM_EMPTY_AU = 7,
  LCKFAIL_DDAU_DEALLOCFIRSTIAM_AULCK = 8,
  LCKFAIL_DDAU_PROCESSIAM_PGCNT = 9,
  LCKFAIL_IAMPAGEREF_LOCKSINGLESLOT = 10,
  LCKFAIL_ALLOCPAGE_FROM_TARGET_EXTENT = 11,
  LCKFAIL_BLOBBASE_LOCKRID = 12,
  LCKFAIL_BLOBBASE_LOCKPAGE = 13,
  LCKFAIL_CHKAGG_LOCKTABLE = 14,
  LCKFAIL_DBCC_LOCKDB = 15,
  LCKFAIL_DBCC_GAMSCAN_GETNEXTPAGE = 16,
  LCKFAIL_GHOSTCLEANUP_PROCESSTSKPKT = 17,
  LCKFAIL_AM_GETHOBTLOCK = 18,
  LCKFAIL_AM_LOCKROW_HOBT = 19,
  LCKFAIL_AM_LOCKROW_PAGE = 20,
  LCKFAIL_AM_LOCKROW_ROW = 21,
  LCKFAIL_DBMGR_GETDBTLONG1 = 22,
  LCKFAIL_DBMGR_OPENDB = 23,
  LCKFAIL_DBMGR_OPENDB_AUTOSTARTUP = 24,
  LCKFAIL_DBMGR_OPEN_UNSTARTED_U = 25,
  LCKFAIL_DBMGR_OPEN_UNSTARTED_S = 26,
  LCKFAIL_DBAUTOCLOSE_PROCESSTSKPKT = 27,
  LCKFAIL_DBMGR_STARTUPDB = 28,
  LCKFAIL_DBMGR_DETACHDB = 29,
  LCKFAIL_DBMGR_DROPDB = 30,
  LCKFAIL_DBMGR_REBUILDLOG = 31,
  LCKFAIL_DBMGR_CREATEREPLICA = 32,
  LCKFAIL_DBMGR_DROPREPLICA = 33,
  LCKFAIL_DBMGR_CHANGENAME = 34,
  LCKFAIL_DBMGR_XLOCK = 35,
  LCKFAIL_DBMGR_RECOLLATE = 36,
  LCKFAIL_DBMGR_LOCKFORSTATECHANGE_WAITFOREVER = 37,
  LCKFAIL_DBMGR_LOCKFORSTATECHANGE_DELAY = 38,
  LCKFAIL_DBMGR_LOCKFORSTATECHANGE_AFTERKILL = 39,
  LCKFAIL_DBCC_DBRECOVER = 40,
  LCKFAIL_DBT_INIT_N_SYNC = 41,
  LCKFAIL_FGMGR_LOCKFORDDL = 42,
  LCKFAIL_FILEMGR_FILEOPLOCK = 43,
  LCKFAIL_DBCC_REBUILDINDEX = 44,
  LCKFAIL_HEAPFRAGMENT_LOCKRES = 45,
  LCKFAIL_INDEXDDL_LOCKBUILDRES = 46,
  LCKFAIL_AM_ACQUIREROWLOCK = 47,
  LCKFAIL_AM_PROBEKEYRANGE = 48,
  LCKFAIL_AM_LOCKENDRANGE = 49,
  LCKFAIL_FASTLOADCNTXT_KEYRANGE = 50,
  LCKFAIL_BTREEROW_ACQUIRELOCK = 51,
  LCKFAIL_PAGECONTEXT_ACQUIRELOCK = 52,
  LCKFAIL_INDROWSCANNER_LOCKINFINITEKEY = 53,
  LCKFAIL_INDROWSCANNER_LOCKENDKEY = 54,
  LCKFAIL_MDL_LOCKGENERIC = 55,
  LCKFAIL_MDL_LOCKOBJID = 56,
  LCKFAIL_MDL_LOCKDB = 57,
  LCKFAIL_ACQUIRE_BULK_TABLE_LOCK_NOWAIT = 58,
  LCKFAIL_ACQUIRE_BULK_TABLE_LOCK_WAIT = 59,
  LCKFAIL_PREP_AU_FOR_DD_DATA = 60,
  LCKFAIL_PREP_AU_FOR_DD_SLOB = 61,
  LCKFAIL_PREP_AU_FOR_DD_LOB = 62,
  LCKFAIL_DBCC_PURGEIAMS = 63,
  LCKFAIL_SSB_LOCKSSBRES = 64,
  LCKFAIL_SSB_ACQUIRE_SI_X = 65,
  LCKFAIL_SSB_LOCKCONVGROUPBASE = 66,
  LCKFAIL_SSB_LOCKCONVGROUPBASEX = 67,
  LCKFAIL_CSTMTALTERDB_CHANGESTATE = 68,
  LCKFAIL_XDESRMREADWRITE_INIT = 69,
  LCKFAIL_XDESRMREADONLY_INIT = 70,
  LCKFAIL_XDES_LOCKOBJECT = 71,
  LCKFAIL_REPLACE_DB = 72,
  TRANABORT_CSTMTCREATEEXTENDEDINDEX_XRETEXECUTE = 73,
  ABORT_CQSCAN_CONSTRUCTOR = 74,
  ABORT_MD_CACHE_RWLOCK = 75,
  DEADLOCK_MD_CACHE_RWLOCK = 76,
  ABORT_MD_CLONE_LATCH = 77,
  DEADLOCK_CXPACKET_REMOVEHEAD = 78,
  DEADLOCK_CXPIPE_OPEN = 79,
  DEADLOCK_XCHNGWAIT = 80,
  DEADLOCK_SYNCHLOAD_GET = 81,
  ABORT_INITPFSPAGES_FAILPT_FIRST = 82,
  ABORT_INITPFSPAGES_FAILPT_SECOND = 83,
  ABORT_INITGAMPAGES_FAILPT_GAM = 84,
  ABORT_INITGAMPAGES_FAILPT_SGAM = 85,
  ABORT_ALLOC_ALLOCFIRST_FAILPT = 86,
  TRANABORT_BCPEXECSQL = 87,
  ABORT_FNPRODUCERTHREAD_SCANABORT = 88,
  ABORT_FNPRODUCERTHREAD_EXECABORT = 89,
  ABORT_RAISENETERROR = 90,
  ABORT_XDESRMREADWRITE_MAKEACTIVE_FAILPT = 91,
  ABORT_CRELOP_QUERY_YIELD = 92,
  ABORT_INITPFSPAGES = 93,
  ABORT_INITGAMPAGES = 94,
  ABORT_ALLOC_ALLOCFIRST = 95,
  ABORT_ALLOC_ALLOCEXTENT_GAM = 96,
  ABORT_ASSEMBLY_METAINFO_VERIFY = 97,
  ABORT_ASYNCHDISKPOOLLOCK_GET = 98,
  ABORT_ASYNCHDISKPOOLLOCK_PROCESSACTIONS = 99,
  ABORT_BCPROWSET_PROCESSTEXT_PRESPHINX = 100,
  ABORT_CBULKTEXT_READTEXTCOL = 101,
  ABORT_CBULKTEXT_INSERTTEXTDEFAULT = 102,
  ABORT_BOBMGR_GETBUF = 103,
  ABORT_BPOOL_FLUSHCACHE = 104,
  ABORT_CURSORASYNCPOP_NOTIFYADDROW = 105,
  ABORT_CURSORASYNCPOP_WAITFORROWS = 106,
  ABORT_CHECKPOI2_FIRST = 107,
  ABORT_CHECKPOI2_SECOND = 108,
  ABORT_CHKALLOC_EXTRACT_FROM_SEMD = 109,
  ABORT_CHKAGGBUF_MERGE = 110,
  ABORT_CHKAGGBUF_GETNEXTFACT_LOOP = 111,
  ABORT_CHKAGGBUF_GETNEXTFACT_FINAL = 112,
  ABORT_CHKTBL_REVALIDATEALLIND_LOOPTOP = 113,
  ABORT_CHKTBL_REVALIDATEALLIND_LOOPBTM = 114,
  ABORT_CHKOBJLIST_ADD = 115,
  ABORT_CHKTBL_BUILDANDCHECKOBJLIST = 116,
  ABORT_CHKTBL_PROCESSNEXTDATA = 117,
  ABORT_GHOST_CANSUSPENDWORK = 118,
  ABORT_CHKTBL_FIND_BAD_TIMESTAMP_PARENTS_YIELD = 119,
  ABORT_CLRHOST_SETUPAPPDOMAIN = 120,
  ABORT_CLR_UNMANAGEDTOMANAGED_CONSTRUCTCOMMON = 121,
  ABORT_YIELDANDCHECK = 122,
  ABORT_KEYRANGEGEN_SETUPNEXTCACHE = 123,
  ABORT_FIXPAGENOCHECK = 124,
  ABORT_DBCCBUFFER = 125,
  ABORT_PRINTTABLE_PRINTOBJECT = 126,
  ABORT_UPDATEUSAGE_INIT_FIRST_LOOP = 127,
  ABORT_UPDATEUSAGE_INIT_SECOND_LOOP = 128,
  ABORT_UPDATEUSAGE_UPDATEFOROBJ = 129,
  ABORT_DBCC_CALLPRINT = 130,
  ABORT_DBMGR_PRINTROLLBACKPROG = 131,
  ABORT_DBVERSTATEMGR_ENABLEVER = 132,
  ABORT_DBVERSTATEMGR_DISENABLEVER = 133,
  ABORT_DUMPLOG_EXECUTE = 134,
  ABORT_SEEVENT_WAIT = 135,
  ABORT_CMSQLEXECCTXT_STMTNOTIFYONEXCEPTION = 136,
  ABORT_EXTENTINFO_SCANOBJEXTENTINFO = 137,
  ABORT_FCB_ZEROFILE = 138,
  ABORT_DBCC_PRINTMESSAGE = 139,
  ABORT_DBCC_REPORT_SSB_ERROR = 140,
  ABORT_LATCHPAGE = 141,
  ABORT_CSTREAMBUF_WAITIOCOMPLETION = 142,
  ABORT_DBCC_REBALANCESPACES = 143,
  ABORT_DBCC_REORDERPAGES = 144,
  ABORT_LATCHBASE_SUSPEND = 145,
  ABORT_LATCHBASE_SUSPEND_FAILPT = 146,
  ABORT_AM_RECLAIMSPACEINHOBT_ABORT = 147,
  ABORT_AM_RECLAIMSPACEINHOBT_OTHER = 148,
  ABORT_SQLLOGMGR_DESTROY = 149,
  ABORT_SQLLOGMGR_WAITLCFLUSH = 150,
  ABORT_LSMGRCMD_WAITONCOMMAND = 151,
  ABORT_CXPACKET_APPEND1 = 152,
  ABORT_CXPACKET_APPEND2 = 153,
  ABORT_CXPACKET_REMOVEHEAD1 = 154,
  ABORT_CXPACKET_REMOVEHEAD2 = 155,
  ABORT_CXPACKET_REMOVEHEAD3 = 156,
  ABORT_CPARSER_FILLBUFFER = 157,
  ABORT_CXPIPE_OPEN = 158,
  ABORT_RELEASESPINLOCK_WAITONADDRESS = 159,
  ABORT_CQRYMEMMGR_GETMULISTACCESS = 160,
  ABORT_CQRYMEMQUEUE_BUFACQUIREGRANT = 161,
  ABORT_CQSCANHASH_HASHYIELD = 162,
  ABORT_CVALROWHASH_SETDATAX = 163,
  ABORT_CQSCANHASHMATCH_ITERATE1 = 164,
  ABORT_CQSCANHASHMATCH_ITERATE2 = 165,
  ABORT_CQSCANNLJOIN_GETROW = 166,
  ABORT_CQSCANNLJOINTRIVIAL_GETROW = 167,
  ABORT_CQSCANRMTBASE_CHECKATTN = 168,
  ABORT_XCHNGWAIT = 169,
  ABORT_CQUERYEXECCTXT_MEMMGRMUTEX = 170,
  ABORT_REXEXEC_FEXECAUX = 171,
  ABORT_REXEXEC_YIELD = 172,
  ABORT_ROWSETSS_FETCHNEXTROW = 173,
  ABORT_RESQUEUEBASE_DEQUEUE = 174,
  ABORT_SEDDL_CLEANUPTEXTALLOCS = 175,
  ABORT_SEDDL_TRANSFERFSFORINDEXCREATE = 176,
  ABORT_DBCC_COMPACTFILE = 177,
  ABORT_SORT_RELEASE_BUFFER = 178,
  ABORT_SORT_LMLINK = 179,
  ABORT_SORT_LMMERGE = 180,
  ABORT_SORT_MERGEPREPARE1 = 181,
  ABORT_SORT_MERGEPREPARE2 = 182,
  ABORT_SORT_MERGEGETNEXT = 183,
  ABORT_SORT_MERGEREAD = 184,
  ABORT_SORT_MERGEREREAD = 185,
  ABORT_SORT_GETSORTED = 186,
  ABORT_CHKTBLAFFINITY_CHKOBJ = 187,
  ABORT_DBCC_SHOWDBAFFINITY1 = 188,
  ABORT_DBCC_SHOWDBAFFINITY2 = 189,
  ABORT_CLR_EXECUDX = 190,
  ABORT_CLR_EXECUDXNODATAACCESS = 191,
  ABORT_SSB_UPDDELQUERYNOTIFICATION_WAIT = 192,
  ABORT_SSB_EXECUTERECEIVE = 193,
  ABORT_SSB_TASKMGR_HANDLEREUSABLE = 194,
  ABORT_ZEROFILE = 195,
  ABORT_RPCINTERFACES_RELAY1 = 196,
  ABORT_RPCINTERFACES_RELAY2 = 197,
  ABORT_RPCINTERFACES_RELAY3 = 198,
  ABORT_RPCINTERFACES_RELAY4 = 199,
  ABORT_STMT_WAIT = 200,
  ABORT_TABVALUEDCLRUDF_GETROW = 201,
  ABORT_BLOBHANDLEFACTORY_THROWPOSTPONED = 202,
  ABORT_BLOBHANDLEFACTORY_ACQUIREWRITEMUTEX = 203,
  ABORT_CVALROWHIM_SETDATAX = 204,
  ABORT_XDESRMREADWRITE_ROLLBACKTOLSN = 205,
  ABORT_PAGEFLUSHMGR_MANAGEBUF = 206,
  ABORT_SYNCHLOAD_GET = 207,
  ABORT_SSB_CSBCHECK_COLLECT_MSGTYPE_LOOP = 208,
  ABORT_SSB_CSBCHECK_COLLECT_SERVICECONTRACT_LOOP = 209,
  ABORT_SSB_CSBCHECK_COLLECT_SERVICEBINDING_LOOP = 210,
  ABORT_SSB_CSBCHECK_COLLECT_SERVICEID_LOOP = 211,
  ABORT_SSB_CSBCHECK_COLLECT_OBJECT_LOOP = 212,
  ABORT_SSB_CSBCHECK_COLLECT_CG_LOOP = 213,
  ABORT_SSB_CSBCHECK_COLLECT_MDOWNER_LOOP = 214,
  ABORT_SSB_CSBCHECK_COLLECTDIALOGENDPOINTDATA1 = 215,
  ABORT_SSB_CSBCHECK_COLLECTDIALOGENDPOINTDATA2 = 216,
  ABORT_SSB_CSBCHECK_COLLECTQUEUEDATA = 217,
  ABORT_SSB_CSBCHECK_COLLECTXMITQUEUEDATA = 218,
  ABORT_SSB_CSBCHECK_ANALYZE = 219,
  ABORT_SSB_CSBCHECK_REPAIRDROPPEDMSG = 220,
  ABORT_SSB_CSBCHECK_REPAIRDROPPFROMTRANSMISSION = 221,
  ABORT_SSB_CSBSECMGR_PERFTESTS_EMPTY = 222,
  ABORT_SSB_CSBSECMGR_PERFTESTS_ACQUIRE = 223,
  ABORT_SSB_CSBSECMGR_PERFTESTS_CREATESESSIONKEY = 224,
  ABORT_SSB_CSBSECMGR_PERFTESTS_IMPORTSESSIONKEY = 225,
  ABORT_SSB_CSBSECMGR_PERFTESTS_IMPORTPRIVATEKEY = 226,
  ABORT_SSB_CSBSECMGR_PERFTESTS_IMPORTPUBLICKEY = 227,
  ABORT_SSB_CSBSECMGR_PERFTESTS_ENCRYPTWITHSESSION = 228,
  ABORT_SSB_CSBSECMGR_PERFTESTS_DECRYPTWITHSESSION = 229,
  ABORT_SSB_CSBSECMGR_PERFTESTS_ENCRYPTWITHPUBLIC = 230,
  ABORT_SSB_CSBSECMGR_PERFTESTS_DECRYPTWITHPRIVATE = 231,
  ABORT_SSB_CSBSECMGR_PERFTESTS_HASHWITHPUBLIC = 232,
  ABORT_SSB_CSBSECMGR_PERFTESTS_VERIFYWITHSESSION = 233,
  ABORT_SSB_CSBSECMGR_PERFTESTS_SIGNHASHWITHPRIVATE = 234,
  ABORT_SSB_CSBSECMGR_PERFTESTS_VERIFYWITHPUBLIC = 235,
  ABORT_SSB_CSBSECMGR_PERFTESTS_CREATESALT = 236,
  ABORT_SSB_CSBSECMGR_PERFTESTS_INITSALTINSESSION = 237,
  ABORT_SSB_CSBSECMGR_PERFTESTS_HASHDATA = 238,
  ABORT_SSB_CSBSECMGR_PERFTESTS_ENCRYPTDATA = 239,
  ABORT_SSB_CSBSECMGR_PERFTESTS_DECRYPTDATA = 240,
  ABORT_SSB_CSBSECMGR_PERFTESTS_CREATECRYPTOCONTEXT = 241,
  ABORT_SSB_CSBSECMGR_PERFTESTS_CREATEPUBLIC = 242,
  ABORT_SSB_CSTMTCREATECONTRACT_PSTMTCOPY = 243,
  ABORT_SSB_CSTMTCREATESERVICE_PSTMTCOPY = 244,
  ABORT_SSB_CSTMTCREATESERVICE_SVCBROKEREXEC = 245,
  ABORT_SSB_CSTMTALTERSERVICE_PSTMTCOPY = 246,
  ABORT_SSB_CSTMTALTERSERVICE_SVCBROKEREXEC = 247,
  ABORT_SSB_CSBDDL_CREATECONTRACT = 248,
  ABORT_SSB_CSBDDL_ADDCONTRACTTOSERVICE = 249,
  ABORT_SSB_CSBDDL_ALTERSERVICEQUEUE = 250,
  ABORT_SSB_CSBDDL_DROPCONTRACTFROMSERVICE = 251,
  ABORT_SSB_CSBDDL_DROPCONTRACT_NOTIFUSER = 252,
  ABORT_SSB_CSBDDL_DROPCONTRACT_DROPREMOTE = 253,
  ABORT_SSB_CSBDDL_DROPCONTRACT_DIALOGSCAN = 254,
  ABORT_SSB_CSBDDL_DROPSERVICE = 255,
  ABORT_SSB_DIALOGENDPOINT_MOVE = 0,
  ABORT_SSB_DIALOGENDPOINT_RECEIVEMSG = 1,
  ABORT_SSB_DIALOGENDPOINT_EXECUTEACTION = 2,
  ABORT_SSB_DIALOGENDPOINT_DELDIALOGMSGS = 3,
  ABORT_SSB_DIALOGENDPOINT_DELOUTOFORDERMSGS = 4,
  ABORT_EXTENT_FRAGMENTATION_SCAN = 5,
  ABORT_SSB_CSBXMITSTATE_FETCHMSGS = 6,
  ABORT_SSB_CSBTRANSMISSION_FETCHMSGINFO = 7,
  ABORT_SSB_CSBTRANSMISSION_UPDATERECORDS = 8,
  ABORT_SSB_CSBTRANSMISSION_DELRECORDS = 9,
  ABORT_SSB_CSBQUEUEMONITOR_CHECKFOREMPTYWORKER = 10,
  ABORT_SSB_CLEANUPCONVERSATIONENDPOINTS = 11,
  ABORT_SSB_SBMGR_STARTUP_AFTER_SHUTDOWN = 12,
  ABORT_SSB_SBMGR_STARTUP_AFTER_STARTUP = 13,
  ABORT_SSB_SBMGR_STARTUP_AFTER_TIMERINIT = 14,
  ABORT_SSB_SBMGR_STARTUP_AFTER_MSGDISPATCHER_STARTUP = 15,
  ABORT_SSB_SBMGR_STARTUP_AFTER_ACTIVMGR_STARTUP = 16,
  ABORT_SSB_SBMGR_STARTUP_AFTER_MAPPINGMGR_STARTUP = 17,
  ABORT_SSB_SBMGR_SHUTDOWN_INITIAL = 18,
  ABORT_SSB_SBMGR_SHUTDOWN_MARKED_UNINITIALIZED = 19,
  ABORT_SSB_SBMGR_SHUTDOWN_MAPPINGMGR = 20,
  ABORT_SSB_SBMGR_SHUTDOWN_MSGDISPATCHER = 21,
  ABORT_SSB_SBMGR_SHUTDOWN_TIMEREVENT = 22,
  ABORT_SSB_SBMGR_SHUTDOWN_TASKMGR = 23,
  ABORT_SSB_SBMGR_ASBINIT = 24,
  ABORT_SSB_CDIALOGENDPOINT_BROKERINIT = 25,
  ABORT_SSB_MAPPINGMGR_NOTIFYBROKERINIT = 26,
  ABORT_SSB_ACTIVESB_BCKGRNDNOTIFY_MAPPABLE = 27,
  ABORT_SSB_ACTIVESB_BCKGRNDNOTIFY_NOTOK = 28,
  ABORT_SSB_ACTIVESB_BCKGRNDNOTIFY_CACHEMD = 29,
  ABORT_SSB_ACTIVESB_BCKGRNDNOTIFY_BROKERINIT = 30,
  ABORT_SSB_ACTIVESB_BCKGRNDNOTIFY_CREATEMONITORS = 31,
  ABORT_SSB_CSBOLEDBBINDING_CLEAR = 32,
  ABORT_LOB_RECLAIM_RESERVED_PGS = 33,
  ABORT_CUTROWSET_GETROW_YIELDCOUNT = 34,
  ABORT_OFFROW_READAHEAD = 35,
  LCKFAIL_RELOCATE_PAGE_CONTENTS = 36,
  ABORT_XSDGEN_YIELD = 38,
  ABORT_COMPPLAN_MAPCONTROL = 39,
  ABORT_XMLRWBIN_DLL_LOAD = 40,
  ABORT_RECOMPILABLE_STMT_CHECK_LOOP = 41,
  ABORT_FIND_AUTOSHRINK_DB_YIELD = 42,
  ABORT_SHOWPLANXML_SERIALIZE = 43,
  ABORT_CQSCANUPDATE_GETROW = 44,
  ABORT_CAPPDOMAIN_INIT_CREATEDOMAIN = 46,
  ABORT_CAPPDOMAIN_INIT_GETDOMAINID = 47,
  ABORT_CAPPDOMAIN_INIT_CREATESQLDOMAIN = 48,
  ABORT_CAPPDOMAIN_INVOKECLRFN = 49,
  ABORT_CAPPDOMAIN_LOOPBACKFORSTMTEXEC = 50,
  ABORT_CAPPDOMAIN_LOOPBACKFORCOMPILE = 51,
  ABORT_CAPPDOMAIN_LOADASSEMBLY = 52,
  ABORT_CAPPDOMAIN_GETTYPETOKEN = 53,
  ABORT_CAPPDOMAIN_CREATEMETHOD = 54,
  ABORT_CAPPDOMAIN_FORMMETHOD = 55,
  ABORT_CAPPDOMAIN_CREATEUDTTOKENS = 56,
  ABORT_CAPPDOMAIN_CREATEUDAGGTOKENS = 57,
  ABORT_CAPPDOMAIN_ADDLOCALSIGNATURE = 58,
  ABORT_CAPPDOMAIN_GETCLASSINTEROP = 59,
  ABORT_CAPPDOMAIN_GETFIELDINFO = 60,
  ABORT_CAPPDOMAIN_GETSQLRDRSCHEMA = 61,
  ABORT_CAPPDOMAIN_GETROWFROMSQLRDR = 62,
  ABORT_CAPPDOMAIN_SETXVARONSQLRDR = 63,
  ABORT_CAPPDOMAIN_FREEGCHANDLE = 64,
  ABORT_CAPPDOMAIN_CACHECLRLVLCTXT = 65,
  ABORT_CAPPDOMAIN_DESTROYCLRLVLCTXT = 66,
  ABORT_CAPPDOMAIN_ADDLAZYMSG = 67,
  ABORT_CAPPDOMAIN_HANDLENEWPROVIDERMD = 68,
  ABORT_CAPPDOMAIN_DEFAULTDBCHANGED = 69,
  ABORT_CAPPDOMAIN_STATEMENTCOMPLETED = 70,
  ABORT_CAPPDOMAIN_TRANSTARTED = 71,
  ABORT_CAPPDOMAIN_TRANCOMMITTED = 72,
  ABORT_CAPPDOMAIN_TRANROLLEDBACK = 73,
  ABORT_FCB_CHANGEFILESIZE = 74,
  ABORT_FCB_SETALLOCEND = 75,
  ABORT_DBCC_MOVEHEAPPAGES_SLEEP = 76,
  ABORT_DBCC_MOVEHEAPPAGES_YIELD = 77,
  ABORT_DBCC_MOVEBLOBPAGES_SLEEP = 78,
  ABORT_DBCC_MOVEBLOBPAGES_YIELD = 79,
  ABORT_CQUERYSCAN_STARTUP = 80,
  ABORT_CQSCANONLINEINDEX_GETROW = 81,
  ABORT_CQSCANONLINEINDEXNOCACHE_GETROW = 82,
  ABORT_HEAPDATASETSESSION_PURGEEMPTYPAGES_SLEEP = 83,
  ABORT_HEAPDATASETSESSION_PURGEEMPTYPAGES_YIELD = 84,
  ABORT_INDEXDATASETSESSION_MOVEPAGES_SLEEP = 85,
  ABORT_INDEXDATASETSESSION_MOVEPAGES_YIELD = 86,
  ABORT_DBCC_COMPACTFILE_SLEEP = 87,
  ABORT_DBCC_COMPACTFILE_YIELD = 88,
  ABORT_DBCC_COMPACTFILE_YIELD_FINAL = 89,
  ABORT_DBCC_PURGEEMPTYEXTENTS_SLEEP = 90,
  ABORT_DBCC_PURGEEMPTYEXTENTS_YIELD = 91,
  ABORT_DBCC_PURGEALLEMPTYEXTENTS_YIELD = 92,
  ABORT_DBCC_PURGEHEAP_SLEEP1 = 93,
  ABORT_DBCC_PURGEHEAP_SLEEP2 = 94,
  ABORT_DBCC_PURGEHEAP_YIELD1 = 95,
  ABORT_DBCC_PURGEHEAP_YIELD2 = 96,
  ABORT_CRELOP_QUERY_ALGEBRIZE_TOP = 97,
  ABORT_CRELOP_QUERY_ALGEBRIZE_END = 98,
  ABORT_ALLOC_ALLOCATEFIRST = 99,
  ABORT_ALLOC_ALLOCATEPAGES_FAILURE = 100,
  ABORT_ALLOC_ALLOC_PAGE_SGAM = 101,
  ABORT_ALLOC_NONLOGGEDEXTENTALLOC = 102,
  ABORT_BLOB_DELETEFORMAINT = 103,
  ABORT_BLOBBASE_REMOVENODE = 104,
  ABORT_BLOBBASE_FIXNODE = 105,
  ABORT_BLOBBASE_TRYFIXPAGE = 106,
  ABORT_CARD_UPDATEDENSITYFORJOIN_LEFT = 107,
  ABORT_CARD_UPDATEDENSITYFORJOIN_RIGHT = 108,
  ABORT_CARD_BUILDDENSITYMAP = 109,
  ABORT_CCURSORASYNCPOP_WAITFORROWS = 110,
  ABORT_CCOMPPLAN_INITPARAMS_LOCAL = 111,
  ABORT_CCOMPPLAN_INITPARAMS_PROC = 112,
  ABORT_CPROCHDR_PROCESSVARS = 113,
  ABORT_DBCC_SHOWCONTIG = 114,
  ABORT_INDEXANALYSIS_SCANSAMPLEDPAGES = 115,
  ABORT_DBCC_VERIFYSYSTBLSANITY = 116,
  ABORT_CMSQLEXECCONTEXT_EXECSTMTS_PREEXEC = 117,
  ABORT_CMSQLEXECCONTEXT_EXECSTMTS_POSTEXEC = 118,
  ABORT_FCB_OLDSETFREEEXTENTCOUNT = 119,
  ABORT_DBCC_REORGALLINDEXES = 120,
  ABORT_CMEMO_EXECUTETASKS = 121,
  ABORT_OPTTYPEVRSETARRAY_FINTERSECT = 122,
  ABORT_OPTTYPEVRSETARRAY_IFINDSET = 123,
  ABORT_OPTIMIZERUTIL_YIELDANDABORTCHECK = 124,
  ABORT_CCONSTRAINTPROP_ASSERTVALID_SET = 125,
  ABORT_CCONSTRAINTPROP_ASSERTVALID_VERIFY = 126,
  ABORT_CTSET_FMEMBER = 127,
  ABORT_CQSCANHASH_HASHYIELD_YIELDCOUNT = 128,
  ABORT_CVALROWHASH_SETDATAX_YIELD = 129,
  ABORT_CQSCANNLJOIN_GETROW_YIELDCOUNT = 130,
  ABORT_CQSCANNLJOINTRIVIAL_GETROW_YIELDCOUNT = 131,
  ABORT_CQSCANRMTSCAN_OPENCONNECTION = 132,
  ABORT_CQTE_DECODEEXPR = 133,
  ABORT_RECOVERYMGR_REDOPASS = 134,
  ABORT_CSQL_TRANSFORM = 135,
  ABORT_CSQL_FCOMPWRAPPER = 136,
  ABORT_CSQL_FCOMPILE = 137,
  ABORT_CSQL_FNORMALIZE = 138,
  ABORT_SSB_ACTIVATIONMGR_CREATEQUEUEMONITORS = 139,
  ABORT_SSB_ACTIVATIONMGR_NOTIFPOSTTRANSACTION = 140,
  ABORT_CREMAPCONTEXT_ADDMAPPING = 141,
  ABORT_CXTE_EXECCOMPILE = 142,
  ABORT_CALLDROPOBJECT_CATCH = 143,
  ABORT_ASSEMBLYMETAINFO_ALTERASSEMBLY_CREATEWORK = 144,
  ABORT_ASSEMBLYMETAINFO_ALTERASSEMBLY_UDXDEP = 145,
  ABORT_ASSEMBLYMETAINFO_ALTERASSEMBLY_UDTDEP = 146,
  ABORT_ASSEMBLYMETAINFO_ALTERASSEMBLY_UDAGGDEP = 147,
  TRANABORT_CRELOP_INSERTBULKQUERY_BINDTREE_GETTYPEINFO = 148,
  TRANABORT_CRELOP_INSERTBULKQUERY_BINDTREE_GETCOLID = 149,
  TRANABORT_CRELOP_INSERTBULKQUERY_BINDTREE_RESOLVECOLDEF = 150,
  TRANABORT_VERIFYBULKINSERTCONDITIONS_VIEWORTAB = 151,
  TRANABORT_VERIFYBULKINSERTCONDITIONS_OWNER = 152,
  TRANABORT_VERIFYBULKINSERTCONDITIONS_ACCESSCHECK = 153,
  TRANABORT_VERIFYBULKINSERTCONDITIONS_SYNCTRANSUB = 154,
  TRANABORT_CSCAOPARG_FOLDSCALAR = 155,
  TRANABORT_ALLOCATIONREQ_ALLOCATEFIRST_FAILPT = 156,
  TRANABORT_ALLOCATIONREQ_ALLOCATEPAGES_FAILPT = 157,
  TRANABORT_CHANGEEXTSTATEINIAM_FAILPT = 158,
  TRANABORT_CHANGEEXTSTATEINGAM_FAILPT = 159,
  TRANABORT_CHANGEEXTSTATEINSGAM_FAILPT = 160,
  TRANABORT_DEACTIVATEMIXEDEXT_FAILPT = 161,
  TRANABORT_BULKMAIN = 162,
  TRANABORT_BCPROWSET_CHECKPERM = 163,
  TRANABORT_BCPROWSET_POPIDENT = 164,
  TRANABORT_BCPROWSET_READROW = 165,
  TRANABORT_BCPROWSET_READCOL = 166,
  TRANABORT_CSQLSOURCE_POPSQLSCOPE = 167,
  TRANABORT_CSQLSOURCE_DESTRUCTOR = 168,
  TRANABORT_CSTMTERROR_XRETEXECUTE = 169,
  TRANABORT_BCPROWSET_READTEXTCOL = 170,
  TRANABORT_BCPROWSET_PROCESSTEXTCHUNK = 171,
  TRANABORT_BCPROWSET_PROCESSTEXTCHUNKSFINISH = 172,
  TRANABORT_BCPROWSET_INITPRESPHINX_OPENTARGET = 173,
  TRANABORT_BCPROWSET_INITPRESPHINX_CHECKSYSTAB = 174,
  TRANABORT_BCPROWSET_INITPRESPHINX_NODMPLDHOST = 175,
  TRANABORT_BCPROWSET_INITPRESPHINX_MINLEN = 176,
  TRANABORT_BCPROWSET_INITPRESPHINX_MAXLEN = 177,
  TRANABORT_BCPROWSET_EXECINS = 178,
  TRANABORT_BCPROWSET_GETCOLPRESPHINX_RSCOUNT = 179,
  TRANABORT_BCPROWSET_GETCOLPRESPHINX_COLATTR = 180,
  TRANABORT_BCPROWSET_GETCOLPRESPHINX_I8 = 181,
  TRANABORT_BCPROWSET_GETCOLPRESPHINX_SSVARIANT = 182,
  TRANABORT_BCPROWSET_GETCOLPRESPHINX_65VARCHARMAX = 183,
  TRANABORT_BCPROWSET_GETROWFROMNETPRESPHINX_SKIP = 184,
  TRANABORT_BCPROWSET_GETROWFROMNETPRESPHINX_READ = 185,
  TRANABORT_BCPROWSET_READROWPRESPHINX_MINLEN = 186,
  TRANABORT_BCPROWSET_READROWPRESPHINX_MAXLEN = 187,
  TRANABORT_BCPROWSET_PROCESSTEXTPRESPHINX_TOKEN = 188,
  TRANABORT_BCPROWSET_PROCESSTEXTPRESPHINX_COLS = 189,
  TRANABORT_BCPROWSET_PROCESSTEXTPRESPHINX_EOF = 190,
  TRANABORT_BCPROWSET_PROCESSTEXTPRESPHINX_SETTEXTPTR = 191,
  TRANABORT_BCPROWSET_PROCESSTEXTPRESPHINX_MINLEN = 192,
  TRANABORT_BCPROWSET_PROCESSTEXTPRESPHINX_MAXLEN = 193,
  TRANABORT_BCPIMPORT_INIT_IMED = 194,
  TRANABORT_BCPIMPORT_INIT_OBJTYPE = 195,
  TRANABORT_BCPIMPORT_INIT_ALLOWDDL = 196,
  TRANABORT_BCPIMPORT_INIT_BULKADMINROLE = 197,
  TRANABORT_BCPIMPORT_INIT_PHYSENTITY = 198,
  TRANABORT_BCPIMPORT_INIT_SYNCTRANSUB = 199,
  TRANABORT_BCPIMPORT_INIT_CNSTR_IMED = 200,
  TRANABORT_BCPIMPORT_INIT_CREATEPROVIDER = 201,
  TRANABORT_BCPIMPORT_INITFOROPENRS_IMED = 202,
  TRANABORT_BCPIMPORT_INITFOROPENRS_OBJTYPE = 203,
  TRANABORT_BCPIMPORT_INITFOROPENRS_PHYSENTITY = 204,
  TRANABORT_BCPIMPORT_INITFOROPENRS_CREATEPROVIDER = 205,
  TRANABORT_BCP_CREATEPROVIDER = 206,
  TRANABORT_BCPIMPORT_EXECINSSTMT = 207,
  TRANABORT_IMPIBCPROWSET_GETDATAPRESPHINX_COLS = 208,
  TRANABORT_IMPIBCPROWSET_GETDATAPRESPHINX_ROWSIZE = 209,
  TRANABORT_IMPIBCPROWSET_GETDATAPRESPHINX_COLSIZE = 210,
  TRANABORT_IMPIBCPROWSET_GETDATAPRESPHINX_REGCOLSIZE = 211,
  TRANABORT_IMPIBCPROWSET_GETDATAPRESPHINX_DBPART_VALUE_SIZE = 212,
  TRANABORT_BCP_READCOLMETADATA_TOKEN = 213,
  TRANABORT_BCP_READCOLMETADATA_COLCOUNT = 214,
  TRANABORT_BCP_READCOLMETADATA_TYPE = 215,
  TRANABORT_BCP_READCOLMETADATA_PRECISION = 216,
  TRANABORT_BCP_READCOLMETADATA_SCALE = 217,
  TRANABORT_BCP_READCOLMETADATA_TLEN = 218,
  TRANABORT_BCP_READCOLMETADATA_COLNAME = 219,
  TRANABORT_CBULKTEXT_APPEND = 220,
  TRANABORT_CBULKTEXT_READTEXTCOL_LOOP = 221,
  TRANABORT_CBULKTEXT_READTEXTCOL_END = 222,
  TRANABORT_CBULKTEXT_INSTEXTDEFAULT_LOOP = 223,
  TRANABORT_CBULKTEXT_INSTEXTDEFAULT_END = 224,
  TRANABORT_CHECKPOINT2 = 225,
  TRANABORT_CAPAGEAGGOBJ_FINALERRORCHECK_FAILPT = 226,
  TRANABORT_DBCCNOTTEXTPTR = 227,
  TRANABORT_DBCCCLEANTABLE = 228,
  TRANABORT_GETNEXTI8METADATAID = 229,
  TRANABORT_ECATBITSYUKON_GETNEWSCHEMAOBJECTID_CLASS = 230,
  TRANABORT_ECATBITSYUKON_GETNEWSCHEMAOBJECTID = 231,
  ABORT_QUERYDRIVER_AGGWAIT = 232,
  TRANABORT_INDEXANALYSIS_ERRORHANDLER = 233,
  TRANABORT_DBMGR_CREATESSYSDATABASESROW = 234,
  TRANABORT_DBMGR_SYNCBOOTPAGEWITHDBREG = 235,
  TRANABORT_DBMGR_CHANGEDBSTATE = 236,
  TRANABORT_DBCCDBREINDEX = 237,
  TRANABORT_FCB_SYNCWRITEPREEMPTIVE_CREATEEVENT = 238,
  TRANABORT_FCB_SYNCWRITEPREEMPTIVE_FAILPT = 239,
  TRANABORT_FCB_SYNCWRITEPREEMPTIVE_CLOSEHANDLE = 240,
  TRANABORT_CSTMTDROPINDEX_XRETDROPEXECUTE = 241,
  TRANABORT_CSTMTDROPSTATS_XRETDROPEXECUTE = 242,
  TRANABORT_CSTMTTRUNCATETABLE_XRETEXECUTE = 243,
  TRANABORT_CSTMTDROPEVTNOTIF_XRETDROPEVTNOTIF = 244,
  TRANABORT_FCB_CREATEPHYSICALFILE_CREATEFILE = 245,
  TRANABORT_FCB_CREATEPHYSICALFILE_NOTFILE = 246,
  TRANABORT_FCB_SHOULDPAGEBECOPIED = 247,
  TRANABORT_FGMGR_MAKEDEFAULTFGCB = 248,
  TRANABORT_ESARITHERRORHANDLER = 249,
  TRANABORT_GETIDENTI2I4 = 250,
  TRANABORT_CSTMTCREATEINDEX_XRETEXECUTE = 251,
  TRANABORT_CSTMTCREATEINDEX_XRETPOSTTRIGGER = 252,
  TRANABORT_CSTMTCREATESTATS_XRETEXECUTE = 253,
  TRANABORT_CSTMTALTERINDEX_XRETEXECUTE = 254,
  TRANABORT_DBCC_REORGALLINDEXES = 255,
  TRANABORT_INVOKE_OBJECT_LOCKMATCHID = 0,
  TRANABORT_INVOKE_SCALARTYPE_LOCKMATCHID = 1,
  TRANABORT_INVOKE_TRIGGEREX_VALIDATETYPEANDORDER_DBID_OBJID = 2,
  TRANABORT_INVOKE_TRIGGEREX_VALIDATETYPEANDORDER_TRIG = 3,
  TRANABORT_INVOKE_TRIGGEREX_VALIDATETYPEANDORDER_ACCESS = 4,
  TRANABORT_INVOKE_TRIGGEREX_VALIDATETYPEANDORDER_INSTEADTRIG = 5,
  TRANABORT_INVOKE_TRIGGEREX_VALIDATETYPEANDORDER_MDEVENTTYPE = 6,
  TRANABORT_INVOKE_TRIGGEREX_VALIDATETYPEANDORDER_TYPEMATCH = 7,
  TRANABORT_INVOKE_TRIGGEREX_VALIDATETYPEANDORDER_ORDER = 8,
  TRANABORT_OSFILEASILOCKBYTES_CONSTRUCTOR_CREATEFILE = 9,
  TRANABORT_OSFILEASILOCKBYTES_CONSTRUCTOR_NOTFILE = 10,
  TRANABORT_OSFILEASILOCKBYTES_CONSTRUCTOR_READ = 11,
  TRANABORT_OSFILEASILOCKBYTES_CONSTRUCTOR_BYTESREAD = 12,
  TRANABORT_OSFILEASILOCKBYTES_CONSTRUCTOR_BYTEORDER = 13,
  TRANABORT_OSFILEASILOCKBYTES_CREATE = 14,
  TRANABORT_OPENOSFILEASLOB_CLONEFOREXECUTE_ACCESS = 15,
  TRANABORT_OPENOSFILEASLOB_CLONEFOREXECUTE_IMPERSONATED = 16,
  TRANABORT_LSMGR_SENDPAGE_EXTLOCK = 17,
  TRANABORT_LSMGR_SENDPAGE_PAGELOCK = 18,
  TRANABORT_TVP_ORPHANCREATE = 19,
  TRANABORT_CSTMTCREATESQL_XRETEXECUTE = 20,
  TRANABORT_TVP_BUILDORPHANXVAR = 21,
  TRANABORT_CSTMTCREATEPRTFUNCTION_XRETEXECUTE = 22,
  TRANABORT_CSTMTALTERPRTFUNCTION_XRETEXECUTE = 23,
  TRANABORT_CSTMTDROPPRTFUNCTION_XRETEXECUTE = 24,
  TRANABORT_CSTMTCREATEPRTSCHEME_XRETEXECUTE = 25,
  TRANABORT_CSTMTALTERPRTSCHEME_XRETEXECUTE = 26,
  TRANABORT_CSTMTDROPPRTSCHEME_XRETEXECUTE = 27,
  TRANABORT_REPLUPDATESCHEMA = 28,
  TRANABORT_ROWSETBULK_INSERTROW = 29,
  TRANABORT_ROWSETBULK_VERIFYUNIQUENESS = 30,
  ABORT_CAPPDOMAIN_GETUDXTOKEN = 31,
  ABORT_CAPPDOMAIN_GETMETHODTOKENWITHNAME = 32,
  TRANABORT_CHECKTABLEAFFINITY_CHECKOBJECT = 33,
  TRANABORT_CEXECLEVEL_PUSHSQLSCOPEINTERNAL = 34,
  TRANABORT_CSQLOBJECT_PUSHSQLSCOPEINTERNAL = 35,
  TRANABORT_CSTMTUPDSTATS_XRETEXECUTE = 36,
  TRANABORT_STREAMFILEMGR_CREATEDIRECTORY = 37,
  TRANABORT_STREAMFILEMGR_CREATEHEADERPAGEFILE_CREATEFILE = 38,
  TRANABORT_STREAMFILEMGR_CREATEHEADERPAGEFILE_WRITE = 39,
  TRANABORT_STREAMFILEMGR_CREATEDFSLINK = 40,
  TRANABORT_STREAMFILEMGR_CREATELINKSHARE_GETCOMPNAME = 41,
  TRANABORT_STREAMFILEMGR_CREATELINKSHARE_ADDSHARE = 42,
  TRANABORT_STREAMFILEMGR_GETSHARENAMEFORLOCALPATH = 43,
  TRANABORT_STREAMFILEMGR_CREATETXFRM = 44,
  TRANABORT_STREAMFILEMGR_SETSHAREOWNERSHIP = 45,
  TRANABORT_CSTMTINSERTBULK_FCOMPILE_SORTED = 46,
  TRANABORT_CSTMTINSERTBULK_FCOMPILE_COLS = 47,
  TRANABORT_CSTMTUPDATETEXT_UPDATETEXT = 48,
  TRANABORT_CSTMTUPDATETEXT_XRETEXECUTE = 49,
  TRANABORT_CTABLECREATE_CREATEXMLNODETABLES = 50,
  TRANABORT_CTABLECREATE_LCCREATEIMPL = 51,
  TRANABORT_CTABLECREATE_EXECCRTFORKEY = 52,
  TRANABORT_CSTMTALTERTABLE_XRETEXECUTE = 53,
  TRANABORT_CSTMTCREATESYNONYM_XRETEXECUTE = 54,
  TRANABORT_CTABVARFORUDF_CREATE = 55,
  TRANABORT_CSTMTDROPTYPE_XRETEXECUTE = 56,
  TRANABORT_CSTMTCREATETYPE_XRETEXECUTE = 57,
  TRANABORT_DTCXACTRMONLY_PREPAREDTCXACT = 58,
  TRANABORT_XDESRMREADWRITE_ROLLBACKTOLSN_FAILPT = 59,
  TRANABORT_CREATEEMPTYXMLINDEX = 60,
  TRANABORT_CSTMTCREATEXMLINDEX_XRETEXECUTE = 61,
  TRANABORT_XMLPARSEERROR = 62,
  TRANABORT_CXSTMTDDL_FEXECUTEALLTRIGGERS_DBID = 63,
  TRANABORT_CXSTMTDDL_FEXECUTEALLTRIGGERS = 64,
  TRANABORT_CXSTMTDML_FEXECALLTRIGGERS = 65,
  LCKFAIL_SSB_ILLEGAL = 66,
  LCKFAIL_SSB_ILLEGAL2 = 67,
  ABORT_CQSCANRANGEPREFETCH_GETROW = 68,
  ABORT_CAPPDOMAIN_TRANENDED = 69,
  ABORT_XML_PARSER_YIELD = 70,
  ABORT_CQSCANRANGE_YIELDCOUNT = 71,
  ABORT_CAPPDOMAIN_GETNAMEFROMTYPEID = 72,
  ABORT_CAPPDOMAIN_GETNAMEFROMMETHODTYPE = 73,
  ABORT_CAPPDOMAIN_GETMETHODTOKEN = 74,
  ABORT_WAITFOR_CURSOR_ASYNC_POPL = 75,
  ABORT_WAITFOR_CURSOR_FETCH_IN_ASYNC = 76,
  ABORT_DM_ACTIVE_CURSORS_ITERATION = 77,
  ABORT_IMAGELOCKBYTES_READAT = 78,
  ABORT_TEXTLOCKBYTES_READAT = 79,
  LCKFAIL_BULK_TEMP_PAGE = 80,
  LCKFAIL_AM_VERSIONING_INRECOVERY = 81,
  ABORT_CAPPDOMAIN_GETNAMEFROMFIELDHANDLE = 82,
  ABORT_CAPPDOMAIN_GETFIELDTOKENBYNAME = 83,
  ABORT_CAPPDOMAIN_GETTYPEINFO = 84,
  ABORT_CAPPDOMAIN_VALIDATE = 85,
  ABORT_DBCC_SHRINK_CHECK_FILE_YIELD = 86,
  ABORT_UNORDERPAGEIDSCANNER = 87,
  ABORT_DBCC_COMPACT_LOBS_IN_SHRINK_YIELD = 88,
  ABORT_DBCC_WAIT_VERSION_SCAN_DONE_IN_SHRINKDB = 89,
  ABORT_DBCC_WAIT_VERSION_SCAN_DONE_IN_SHRINKFILE = 90,
  ABORT_DBCC_WAIT_VERSION_SCAN_DONE_IN_PROCESS_PAGES = 91,
  ABORT_DBCC_SHRINK_TEST_PAGE_MOVE_SLEEP = 92,
  ABORT_SSB_REPOSITION_TRANSMITTERS = 93,
  ABORT_QUERYNOTIF_TM_CLOCK = 94,
  DEADLOCK_APPDOMAIN_READY = 95,
  ABORT_APPDOMAIN_READY = 96,
  ABORT_APPDOMAIN_CREATEDDL = 97,
  LCKFAIL_DBMGR_GETDBTLONG2 = 98,
  LCKFAIL_STARTTEMPDB = 99,
  ABORT_DBCC_STREAMING_UDT_CHECK = 100,
  ABORT_DBCC_FIND_COMPACTABLE_LOB = 101,
  ABORT_DBCC_SETUP_LOB_COMPACTION_FILE_RANGE = 102,
  ABORT_DBCC_SETUP_LOB_COMPACTION_IN_FILE = 103,
  ABORT_ALLOCSCAN_GET_NEXT_SCAN_EXTENT = 104,
  ABORT_QE_TRACEBUFFER_ACCESS = 105,
  DEADLOCK_RANGE_NEEDTOWAIT = 106,
  ABORT_CQSCANTVFSTREAM_GETROW_YIELDCOUNT = 107,
  ABORT_CQSCANTVFSTREAM_GETROW = 108,
  ABORT_CQSCANSORT_YIELDCOUNT = 109,
  ABORT_CXPACKETMGR_OPEN = 110,
  ABORT_BEGIN_BULKLOAD = 111,
  ABORT_ASSEMBLYMETAINFO_CHECK_SERIALIZATION = 112,
  ABORT_SORT_ADDRUN = 113,
  ABORT_BULK_ALLOCEXTENT = 114,
  ABORT_VDC_ENTRY = 115,
  ABORT_VDC_EXIT = 116,
  ABORT_FOR_XML_TOP_SEND_CHUNK = 117,
  ABORT_CXSTMTQUERY_POSTGETROW = 118,
  ABORT_CQSCANBITMAP = 119,
  LCKFAIL_LOCK_PAGE_EXPECT_SUCCESS = 120,
  LCKFAIL_LOCK_PAGE_FOR_DEALLOC = 121,
  TRANABORT_BCP_NOCOLMETADATA = 122,
  TRANABORT_BCP_ODDSIZEUNICODE = 123,
  ABORT_QO_TF_HANG = 125,
  TRANABORT_CSTMTDROPBROKER_XRETDROPEXECUTE = 126,
  ABORT_DBCC_COLUMN_LEVEL_CHECKS_DATA = 127,
  ABORT_DBCC_COLUMN_LEVEL_CHECKS_INDEX = 128,
  LCKFAIL_PLANGUIDE = 129,
  ABORT_ALLOC_DROP_AU_INTERNAL = 130,
  ABORT_DM_EXEC_GET_ROW = 131,
  ABORT_CQSCANFILTER_YIELDCOUNT = 132,
  ABORT_PMOGETLOCAL = 133,
  LCKFAIL_LOCK_EXTENT_EXPECT_SUCCESS = 134,
  ABORT_DBCC_PURGEHEAP_SLEEP3 = 135,
  ABORT_DBCC_PURGEHEAP_YIELD3 = 136,
  ABORT_MEMILB_YIELD = 137,
  ABORT_FREE_SPACE_SCAN_GETNEXTPAGE = 138,
  TRANABORT_BCPROWSET_VALIDATE_LOB = 139,
  ABORT_WORKFILE_MAXBUF = 140,
  LCKFAIL_AM_BULK_OPERATION = 141,
  ABORT_REPLICA_COPY_PAGES = 142,
  ABORT_BUF_SMALL1 = 143,
  ABORT_BUF_SMALL2 = 144,
  ABORT_BUF_SMALL3 = 145,
  ABORT_BUF_SMALL4 = 146,
  ABORT_BUF_SMALL5 = 147,
  ABORT_BUF_SMALL6 = 148,
  ABORT_BUF_SMALL7 = 149,
  ABORT_BUF_SMALL8 = 150,
  ABORT_BUF_SMALL9 = 151,
  ABORT_BUF_SMALL10 = 152,
  ABORT_BUF_SMALL11 = 153,
  ABORT_BUF_SMALL12 = 154,
  ABORT_BUF_SMALL13 = 155,
  ABORT_BUF_SMALL14 = 156,
  ABORT_PMO_LOCK_ACQUIRE = 157,
  ABORT_COPY_SKELETON = 158,
  ABORT_COMPUTE_LAST_STMT_IN_COND = 159,
  LCKFAIL_SHRINK_REMOVEIAMPAGE = 160,
  ABORT_SORT_ADDPAGE = 161,
  ABORT_CQUERYPREPARE = 162,
  TRANABORT_REPLCONN_PERM_FAILURE = 163,
  ABORT_QE_INDEX_SORT_OPEN = 164,
  ABORT_SHOWPLAN_LEGACY = 165,
  ABORT_FIXLOBPAGE = 166,
  ABORT_CAPPDOMAIN_GETSTRINGTOKEN = 167,
  ABORT_CAPPDOMAIN_GETOFFSETTOSTRINGDATA = 168,
  ABORT_QO_RESOURCE_SEMAPHORE = 169,
  ABORT_SPACE_SCAN = 170,
  ABORT_OIB_PHANTOM_HANDLE = 171,
  ABORT_OIB_SCHEMA_CHECK = 172,
  ABORT_OIB_ONLINE_STATE = 173,
  ABORT_OIB_BEFORE_DML_LOAD_INDEX = 174,
  ABORT_OIB_AFTER_DML_LOAD_INDEX = 175,
  ABORT_CQSCANRCSPOOL = 176,
  TRANABORT_SETSAVEPOINT = 177,
  ABORT_BEFORE_VLR = 178,
  ABORT_ALLOC_DEFERRED_DROP_AU = 179,
  LCKFAIL_DBM_INTERNALREDO = 180,
  ABORT_EXT_ALLOCATOR_CLEANUP = 181,
  ABORT_PAGE_CACHE_ENTRY_CLEANUP = 182,
  ABORT_BUF_SMALL15 = 183,
  ABORT_BUF_SMALL16 = 184,
  ABORT_BUF_SMALL17 = 185,
  ABORT_BUF_SMALL18 = 186,
  LCKFAIL_DBCC_MOVEPAGE = 187,
  ABORT_FSAGENT_MUTEX_WAIT = 188,
  ABORT_FSAGENT_RWLOCK_WAIT_FOR_READ = 189,
  ABORT_FSAGENT_RWLOCK_WAIT_FOR_WRITE = 190,
  ABORT_GRD_WSGM_MARK_DB_REPAIR = 191,
  ABORT_LAZYCOMMIT_FLUSH_DBLOCK_WAIT = 192,
  LCKFAIL_DUMMYDB_DB_X_FAILED = 193,
  ABORT_REVERT_UP_FOR_EXPR = 194,
  ABORT_REMOTE_SUBTHREAD = 195,
  ABORT_QUERY_RECV_FROM_MCI = 196,
  ABORT_DBCC_FACT_STORE_HASERRORS = 197,
  ABORT_BULK_ALLOCATOR_CLEANUP = 198,
  ABORT_GRPSETS_COMPUTATION = 199,
  ABORT_CREATE_ACCESSOR = 200,
  ABORT_CHECKTABLES_PRINTSTATS = 201,
  ABORT_LOGICAL_FRAGMENTATION_SCAN_YIELD = 202,
  ABORT_THROTTLED_REQUEST = 203,
  ABORT_RG_SOS_RM_CONFIGURATION = 204,
  LCKFAIL_RG_DDL_OPERATION = 205,
  ABORT_DBVSSSNAPSHOT_CREATE = 206,
  ABORT_FS_HEADER_RWLOCK_WAIT = 207,
  LCKFAIL_CSTMTALTERDB_CREATEFG = 208,
  ABORT_FSTR_CFG_MUTEX = 209,
  DEADLOCK_FSTR_CFG_MUTEX = 210,
  ABORT_FSTR_CFG_RWLOCK = 211,
  DEADLOCK_FSTR_CFG_RWLOCK = 212,
  ABORT_DBCC_ADD_FACTSTORE_ENTRY = 213,
  ABORT_BUF_SMALL19 = 214,
  ABORT_BUF_SMALL20 = 215,
  ABORT_CXROWSET_SYNCH = 216,
  ABORT_FCB_REENCRYPTION = 217,
  LCKFAIL_DEK_CHANGE = 218,
  LCKFAIL_TDE_SCAN_PAGE_LOCK = 219,
  LCKFAIL_TDE_SCAN_EXTENT_LOCK = 220,
  ABORT_SSB_CSBCHECK_COLLECT_CONVPRIORITYID_LOOP = 221,
  LCKFAIL_CONVPRI = 222,
  ABORT_WAIT_TESTHOOK = 223,
  ABORT_RPC_RESPONSE = 224,
  ABORT_CHECKTABLES_FLUSH_ALLOCUNITHASHTABLE = 225,
  ABORT_CHECKTABLES_FLUSH_CHECKOBJECTLIST = 226,
  ABORT_BUF_SMALL21 = 227,
  ABORT_AUDITMANAGER_CHANGE = 228,
  ABORT_SCHEMAMGR_FLUSH_DELTA_COUNTS_YIELD = 229,
  ABORT_ROWSET_VERSION_SCAN = 230,
  LCKFAIL_DBCCCLEANPAGE_EXTENT = 231,
  LCKFAIL_DBCCCLEANPAGE_PAGE = 232,
  ABORT_XML_TEXTPARSER = 233,
  LCKFAIL_TDE_SCAN_BULK_LOCK = 234,
  ABORT_RG_SOS_RM_RESET_STATISTICS = 235,
  ABORT_WORKFILE_PAGE_ERROR = 236,
  DEADLOCK_VDM_PREPARE_VIEW = 237,
  ABORT_VDM_PREPARE_VIEW = 238,
  ABORT_UPDATEUSAGE_COUNT_ROW_YIELD = 239,
  ABORT_METADATA_LAZYCACHE_RWLOCK = 240,
  ABORT_LIKE_YIELD = 241,
  LCKFAIL_LSMGR_ACQUIRE_DB_XLOCK = 242,
  LCKFAIL_ALLOCUNIT_BULK_OPERATION_PAGE_ACQUIRE_SLOCK = 243,
  ABORT_CAPPDOMAIN_GETTYPEHANDLEFROMTYPEID = 244,
  ABORT_CAPPDOMAIN_GETMETHODHANDLEFROMMETHODID = 245,
  ABORT_CAPPDOMAIN_GETTYPETOKENBYNAME = 246,
  LCKFAIL_IAM_PURGE = 247,
  ABORT_DVM_THREAD = 248,
  ABORT_CANCEL_SERVICE_THREAD = 249,
  LCK_FAIL_EXTENTDMV_GETHOBTLOCK = 250,
  ABORT_WAIT_MASTER_DB_READY = 251,
  ABORT_WAIT_TEMP_DB_READY = 252,
  ABORT_TCMA_NOTIFICATION_WAIT = 253,
  DEADLOCK_TRAN_RPC = 254,
  ABORT_TCMA_OUTCOMECACHE_WAIT = 255,
  ABORT_WAIT_REQUEST_FOR_COMMIT = 0,
  LCKFAIL_DBMGR_LOCKFORSTATECHANGE = 1,
  ABORT_MD_VALIDATE_CACHED_COUNT = 2,
  DEADLOCK_RPC_COMMAND = 3,
  LCKFAIL_GETPARTITIONLOCK = 4,
  ABORT_SE_REPL_SEND = 5,
  ABORT_SE_REPL_CSN = 6,
  ABORT_SE_REPL_COMMIT_ACK = 7,
  ABORT_SEQUEUE_DEQUEUE = 8,
  ABORT_SE_REPL_SECONDARY_CLOSED = 9,
  ABORT_ASYNC_TRANSPORT_FLOW_CONTROL = 10,
  ABORT_ASYNC_TRANSPORT_TEST = 11,
  ABORT_SE_REPL_WAIT_FOR_ENOUGH_SECONDARIES = 12,
  ABORT_SE_REPL_WAIT_FOR_PRIMARY_FAILURE = 13,
  ABORT_SE_REPL_WAIT_FOR_SECONDARY_CATCHUP_COMPLETE = 14,
  ABORT_SE_REPL_ROLLBACK_ACK = 15,
  ABORT_SE_REPL_KILL_WAIT = 0,
  ABORT_SE_REPL_DELETE_ABORT = 1,
  ABORT_SE_REPL_SECONDARY_CATCHUP_COMPLETE = 2,
  LCKFAIL_SEREPL_LOCKOBJID = 3,
  LCKFAIL_SEREPL_LOCKPARTITION = 4,
  ABORT_SEREPL_PARTITION_EVENT = 5,
  ABORT_SE_REPL_WAIT_FOR_DELETE_COMPLETE = 6,
  LCKFAIL_FABRICMONITOR_RESTARTDB = 7,
  ABORT_SE_REPL_WAIT_FOR_METADATA_COMPLETE_ACK = 8,
  ABORT_SE_REPL_FLOW_CONTROL = 9,
  ABORT_SE_REPL_LOG_SCAN = 10,
  ABORT_LOG_CACHED_SCAN = 11,
  ABORT_LOG_CACHED_SCAN_2 = 12,
  FABRIC_PAIR = 13,
  ABORT_LOCK_PARTITION_COPY = 14,
  ABORT_LOCK_PARTITION_DELETE = 15,
  ABORT_PARTITION_STARTUP_POST_RECOVERY = 16,
  ABORT_PARTITION_ADD = 17,
  ABORT_PARTITION_DEFERRED_CLEANUP = 18,
  ABORT_PARTITION_CHECKPOINT = 19,
  ABORT_PARTITION_GIVEUP_SNAPSHOTS = 20,
  ABORT_PARTITION_EMPTY_TG = 21,
  ABORT_PARTITION_SIGNAL = 22,
  ABORT_PARTITION_SOFT_RESTART = 23,
  ABORT_PARTITION_KILL_NODE = 24,
  ABORT_FABRIC_MONITOR_REQUEST = 25,
  ABORT_MDREPL_DDL_LOCK = 26,
  ABORT_MD_PARTITION_LOCK = 27,
  ABORT_LOCK_PARTITION_CATCHUP = 28,
  ABORT_SEREPL_ROWSET_METADATA_CACHE_REFRESH = 29,
  ABORT_SEREPL_ROWSET_METADATA_CACHE_CLEAR = 30,
  ABORT_PARTITION_CHECKPOINT_IDENTITY = 31,
  ABORT_PARTITION_MGR_USE = 32,
  LCKFAIL_SEREPL_ESCALATION = 33,
  LCKFAIL_XDESRMREADWRITE_GETDBLOCK = 34,
  LCKFAIL_XDESRMREADONLY_GETDBLOCK = 35,
  ABORT_SE_REPL_WAIT_ITEM = 36,
  ABORT_PARTITION_REFRESH_OPTIONS = 37,
  LCKFAIL_DBMGR_REFRESH_OPTIONS = 38,
  LCKFAIL_DBMGR_SET_SCOPE_ATTRS = 39,
  ABORT_SE_REPL_XACT_MESSAGE_FAILPOINT = 40,
  ABORT_SE_REPL_PREPARE_TO_COPY = 41,
  LCKFAIL_TDE_ACQUIREENCRYPTIONLOCK = 4,
  ABORT_CHGTRCK_WAITFORCHANGES = 5,
  ABORT_SEQUENCE_DDL = 6,
  ABORT_GETSEQUENCENEXT = 7,
  LCKFAIL_REDO_LOCK_ACQUISITION = 8,
  ABORT_HADR_MSG_ABORT = 9,
  ABORT_HADR_ACTION = 10,
  ABORT_LOGPOOL_WAITFREEPOOLS = 11,
  ABORT_LOGPOOL_WAITREPLACEMENTSET = 12,
  ABORT_LOGPOOL_WAITLOGCONSUMER = 13,
  LCKFAIL_HADR_DBMGR_LOCK_UPGRADE = 14,
  ABORT_LOGPOOL_RESEARCHLOOP = 15,
  ABORT_HADR_AG_MUTEX = 16,
  ABORT_HADR_WSFC_UTIL = 17,
  ABORT_LOGPOOL_READAHEADLOOP = 18,
  ABORT_XDESTSVERMGR_UPDATE_TASK_YIELD = 19,
  ABORT_HADR_DBMGR_ABORT = 20,
  LCKFAIL_AM_ACQUIRESMOLOCK = 21,
  LCKFAIL_SEDDL_CLEANUPTEXTALLOCS = 22,
  ABORT_WAIT_STARTUP_DEPENDENCY_MATRIX_MODE = 23,
  ABORT_RPC_COMMAND = 24,
  ABORT_DATAPORT_WAIT = 25,
  LCKFAIL_GLM_PRIMARY_BRICK_REQUEST_FAILURE = 26,
  LCKFAIL_GLM_LOCAL_BRICK_REQUEST_FAILURE = 27,
  LCKFAIL_QN_WAITFOR_DBSTARTUP = 28,
  LCKFAIL_MATRIX_DATABASE_SEGMENT_MAP = 29,
  ABORT_OPEN_DB = 30,
  ABORT_WAIT_MASTER_UPGRADED = 31,
  ABORT_WAIT_MASTER_MD_READY = 32,
  ABORT_MATRIX_SETUP_STORED_PROCEDURE = 33,
  ABORT_DISTRIBUTED_CACHE_RACE_WAIT = 34,
  ABORT_TCM_XACT_BRANCH_CREATE = 35,
  LCKFAIL_MATRIXFY_DB = 36,
  DEADLOCK_MATRIX_WORKSPACE_TASK_WAIT = 37,
  ABORT_TCM_AGENT_LOCK = 38,
  LCKFAIL_GLM_UNDO_FAILURE = 39,
  LCKFAIL_METAUTIL_SYSTEMHOBT = 40,
  ABORT_COOP_SCAN = 41,
  ABORT_BPQSCAN_COLSCAN = 42,
  ABORT_BPQSCAN_HASHTABLEBUILD = 43,
  ABORT_QE_BATCH_PROCESSING = 44,
  DEADLOCK_SYNCPOINT = 45,
  ABORT_SYNCPOINT = 46,
  ABORT_COLUMNSTORE_DICT_REHASHING_FAILED = 47,
  ABORT_DBCC_CSINDEX = 48,
  ABORT_QE_RANGE_SCAN = 49,
  LCKFAIL_XEVENT_STATE_CHANGE = 50,
  LCKFAIL_MDL_UNCACHE = 51,
  ABORT_HADR_AR_CRITICAL_SECTION = 52,
  ABORT_HADR_DBR_SUBSCRIBER_CRITICAL_SECTION = 53,
  LCKFAIL_HADR_DB_MANAGEMENT_LOCK = 54,
  ABORT_HADR_XRF_MUTEX = 55,
  ABORT_HADR_VERSIONING_STATE = 56,
  ABORT_ITER_INDEX_STATS = 57,
  LCKFAIL_HADR_DDL_DB_LOCK_ACQUIRE = 58,
  ABORT_VERSION_STORE_CLEANUP = 59,
  LCKFAIL_DDAU_DEALLOCFIRSTIAM_PGLCK = 60,
  LCKFAIL_PROCESS_TT_FOR_CLEANUP = 61,
  LCKFAIL_OIBLOB_TRACKING_TABLE_INIT = 62,
  LCKFAIL_OIBLOB_TRACKING_TABLE_CLEANUP = 63,
  LCKFAIL_OIBLOB_CLEANTABLE = 64,
  LCKFAIL_ASSOCIATE_TEXT_ALLOCUNIT = 65,
  LCKFAIL_CLOUD_BILLING_PARTITION_SIZE = 66,
  ABORT_CREATE_PARTITION_FUNCTION_DDL = 67,
  LCKFAIL_FINDIAM_LOCKLASTIAM = 68,
  ABORT_AUTOALLOCCACHE_FINDIAM = 69,
  ABORT_IAMPAGECACHE_POPULATEIAM = 70,
  ABORT_IAMPAGECACHE_FINDIAM = 71,
  LCKFAIL_SQM_ENABLE_VERSIONING = 72,
  ABORT_CREATE_ROWSETS_GET_COLMOD = 73,
  ABORT_AM_SCHEMAMGR_UNSHARED_CACHE = 74,
  ABORT_CORRUPTED_PAGE = 75,
  LCKFAIL_ARMGR_GETDBLOCK = 76,
  ABORT_COLLECT_DEPENDENCIES = 77,
  LCKFAIL_HADR_DBMGR_LOCK_ACQUIRE_WITH_KILL = 78,
  ABORT_VERSIONING_COMMITTING = 79,
  ABORT_OIBLOB_CLEANUP_TASK = 80,
  ABORT_REFRESH_BOOTPAGE = 81,
  ABORT_HK_MATGEN_ADD_EXPRESSION = 82,
  ABORT_HK_MATGEN_PRECONVERT_QUERY = 83,
  ABORT_COMMIT_TABLE_MULTIAUTOLOCK_SHARED = 84,
  ABORT_COMMIT_TABLE_MULTIAUTOLOCK_EXCLUSIVE = 85,
  ABORT_SE_REPL_WAIT_FOR_PARTIAL_XACT_DRAIN_ACK = 86,
  ABORT_SE_REPL_WAIT_FOR_CATCHUP_DRAIN_ACK = 87,
  ABORT_XE_XML_CONFIG = 88,
  ABORT_FSLOG_TRUNCATION = 89,
  ABORT_FABRIC_REPLICA_PUBLISHER_SUSBSCRIPTION_LIST_MUTEX = 90,
  ABORT_FABRIC_REPLICA_CONTROLLER_MUTEX_WAIT = 91,
  ABORT_FABRIC_REPLICA_CONTROLLER_CACHE_LOCK_WAIT = 92,
  ABORT_FABRIC_REPLICA_CONTROLLER_LIST_LOCK_WAIT = 93,
  ABORT_SE_REPL_WAIT_FOR_SPECIFIC_SECONDARY_FLUSH = 94,
  ABORT_XTP_OFFLINE_CHECKPOINT = 95,
  ABORT_XTP_DMV_GET_ROW = 96,
  ABORT_XTP_CHECKPOINT_WAIT = 97,
  ABORT_SCRIPTDEPLOYMENT_FETCH_WORKER = 98,
  ABORT_SCRIPTDEPLOYMENT_REQUEST_WAIT = 99,
  ABORT_SCRIPTDEPLOYMENT_WORKER_WAIT = 100,
  ABORT_SCRIPTDEPLOYMENT_REQUEST_SUBMIT = 101,
  ABORT_SCRIPTDEPLOYMENT_MAX_WORKER_ATTEMPT = 102,
  ABORT_SCRIPTDEPLOYMENT_COMPLETE_REQUEST_UPDATE_DEPLOYMENTS = 103,
  ABORT_SCRIPTDEPLOYMENT_CANCEL = 104,
  ABORT_SCRIPTDEPLOYMENT_UPDATE_DEPLOYMENTS = 105,
  ABORT_SCRIPTDEPLOYMENT_UPDATE_STATUS = 106,
  ABORT_SCRIPTDEPLOYMENT_FETCH_NEXT_TARGETDB = 107,
  ABORT_SCRIPTDEPLOYMENT_UNPROTECT_PASSWORD = 108,
  ABORT_SE_REPL_WARMUP_PARTITION = 109,
  ABORT_SE_REPL_ESTIMATE_CATCHUP = 110,
  ABORT_QDS_LOCK_DB = 111,
  ABORT_QDS_LOCK_STMT = 112,
  ABORT_QDS_LOCK_INTERVAL = 113,
  ABORT_QDS_LOCK_QUERY_TEXT = 114,
  ABORT_QDS_ASYNC_TASK = 115,
  TRANABORT_XFCB_SYNCWRITEPREEMPTIVE_ERROR = 116,
  ABORT_WINFAB_PREEMPTIVE = 117,
  ABORT_HKPROCENTRY_LOCK_WAIT = 118,
  LCKFAIL_DROP_CLOUD_PARTITION = 119,
  ABORT_WAITFOR_CLOUD_PARTITION_STARTUP = 120,
  LCKFAIL_REPLICATE_LOGICAL_DB = 121,
  LCKFAIL_LC_TABLE_CREATE = 122,
  ABORT_LOG_CONSOLIDATION = 123,
  LCKFAIL_LC_DB = 124,
  ABORT_ROWSETCOLUMNSTOREADAPTER_BATCH_YIELD = 125,
  ABORT_COLUMNSTORE_SCAN_DESERIALIZATION_YIELD = 126,
  ABORT_COLUMNSTORE_BUILD_FAIL = 127,
  LCKFAIL_CSI_ROWGROUP = 128,
  LCKFAIL_CSI_BULK_ROWSET = 129,
  LCKFAIL_CSI_ROWGROUP_INDEXBULD = 130,
  LCKFAIL_CSI_CREATE_DELTASTORE = 131,
  LCKFAIL_CSI_ACQUIRE_DELTASTORE = 132,
  ABORT_CQSCAN_OFFLINEINDEXBUILD_YIELDCOUNT = 133,
  LCKFAIL_CSI_ROWGROUP_FLUSH = 134,
  LCKFAIL_CSI_ACQUIRE_DELTASTORE_INDEX_BUILD = 135,
  ABORT_BUF_SMALL_CSI_1 = 136,
  ABORT_BUF_SMALL_CSI_2 = 137,
  LCKFAIL_CSI_TUPLEMOVER_ROWGROUP = 138,
  LCKFAIL_CSI_ROWGROUP_RECOVERY = 139,
  LCKFAIL_CSI_HOBT_TUPLE_MOVER_QUERY = 140,
  LCKFAIL_CSI_HOBT_TUPLE_MOVER_MOVER = 141,
  ABORT_COLSTORE_INDEX_BUILD = 142,
  LCKFAIL_CSI_STVF_HOBT = 143,
  LCKFAIL_CSI_TM_EXCLUSSION_STMT = 144,
  LCKFAIL_CSI_HOBT_TUPLE_MOVER_DELTASTORECREATE = 145,
  ABORT_NTEXTLOCKBYTES_READAT = 146,
  ABORT_SSB_FWD_PERIODIC_NOTIFICATION_LOOP1 = 147,
  ABORT_SSB_FWD_PERIODIC_NOTIFICATION_LOOP2 = 148,
  ABORT_DL_LCKTIMEOUT_EXCEPTIONID_LAST = 149,
};

typedef enum
{
  page_packets_queuedIdx = 0,
  LastField = 1,
} TAG_UNNAMED_15, *PTAG_UNNAMED_15;

enum XeSqlPkg::file_written_to_replica::CustomizableSlots
{
  collect_pathSlot = 0,
  collect_io_dataSlot = 1,
};

union XE_PublishedDescriptor::DataSource::Data
{
  union
  {
    /* 0x0000 */ const void* m_ptr;
    /* 0x0000 */ void* m_hStream;
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

enum XERWMode
{
  XERW_READ = 0,
  XERW_WRITE = 1,
};

struct tagSCROLLINFO
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ unsigned int fMask;
  /* 0x0008 */ int nMin;
  /* 0x000c */ int nMax;
  /* 0x0010 */ unsigned int nPage;
  /* 0x0014 */ int nPos;
  /* 0x0018 */ int nTrackPos;
}; /* size: 0x001c */

typedef struct _PAGEDIR_INFORMATION
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 DontUse : 9; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 PageDirectoryBase : 48; /* bit position: 9 */
    /* 0x0000 */ unsigned __int64 Reserved : 7; /* bit position: 57 */
  }; /* bitfield */
} PAGEDIR_INFORMATION, *PPAGEDIR_INFORMATION; /* size: 0x0008 */

typedef enum
{
  MaxPageLists = 17,
  LastList = 16,
} TAG_UNNAMED_16, *PTAG_UNNAMED_16;

typedef enum
{
  opcodeIdx = 0,
  task_addressIdx = 1,
  passesIdx = 2,
  LastField = 3,
} TAG_UNNAMED_17, *PTAG_UNNAMED_17;

class XE_AutoRg<unsigned char>
{
}; /* size: 0x0008 */

class XE_MetadataSerializer
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned int m_DataLength;
      /* 0x0004 */ unsigned int m_PaddedLength;
      /* 0x0008 */ class XE_AutoRg<unsigned char> m_buffer;
      /* 0x0010 */ unsigned int m_offset;
    }; /* size: 0x0014 */
    /* 0x0000 */ const int SERIALIZED_METADATASIZE_OFFSET;
  }; /* size: 0x0014 */
}; /* size: 0x0018 */

struct IDirectWriterLock
{
}; /* size: 0x0008 */

enum URLIS
{
  URLIS_URL = 0,
  URLIS_OPAQUE = 1,
  URLIS_NOHISTORY = 2,
  URLIS_FILEURL = 3,
  URLIS_APPLIABLE = 4,
  URLIS_DIRECTORY = 5,
  URLIS_HASQUERY = 6,
};

typedef enum
{
  linked_server_nameIdx = 0,
  provider_nameIdx = 1,
  propertiesIdx = 2,
  LastField = 3,
} TAG_UNNAMED_18, *PTAG_UNNAMED_18;

struct XEPackage0::ActivityIdAction
{
}; /* size: 0x0001 */

enum tagMSHLFLAGS
{
  MSHLFLAGS_NORMAL = 0,
  MSHLFLAGS_TABLESTRONG = 1,
  MSHLFLAGS_TABLEWEAK = 2,
  MSHLFLAGS_NOPING = 4,
  MSHLFLAGS_RESERVED1 = 8,
  MSHLFLAGS_RESERVED2 = 16,
  MSHLFLAGS_RESERVED3 = 32,
  MSHLFLAGS_RESERVED4 = 64,
};

struct XE_TArray<XEDataAttribute,7>
{
  /* 0x0000 */ struct XEDataAttribute m_array[7];
}; /* size: 0x0118 */

struct XE_TEvent<4,0,7>
{
  /* 0x0000 */ struct XE_TArray<XEStaticAttribute,4> m_staticAttr;
  /* 0x00a0 */ struct XE_TArray<XECustomizableAttribute,0> m_customizableAttr;
  /* 0x00a8 */ struct XE_TArray<XEDataAttribute,7> m_dynamicAttr;
  /* 0x01c0 */ struct XEEvent m_event;
}; /* size: 0x0208 */

class XeSqlPkg::logreader_process_text_ptr
{
  union
  {
    /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
    /* 0x0000 */ struct XE_TEvent<4,0,7> sm_metadata;
    /* 0x0000 */ struct XE_SessionContextList sm_contexts;
    struct
    {
      /* 0x0000 */ const struct _GUID sm_guid;
      /* 0x0010 */ long Padding_13[140];
      /* 0x0240 */ unsigned char m_buf[36];
    }; /* size: 0x0034 */
    /* 0x0000 */ const int log_operationOffset;
    /* 0x0000 */ const int rowset_idOffset;
    /* 0x0000 */ const int text_pointer_timestampOffset;
    /* 0x0000 */ const int text_pointer_file_idOffset;
    /* 0x0000 */ const int text_pointer_page_idOffset;
    /* 0x0000 */ const int text_pointer_slot_idOffset;
    /* 0x0000 */ const int current_lsnOffset;
  }; /* size: 0x0208 */
}; /* size: 0x0268 */

enum EFormatType
{
  eFormatInvalid = 0,
  eFormatChar = 1,
  eFormatShort = 2,
  eFormatInt = 3,
  eFormatInt64 = 4,
  eFormatFloat = 5,
  eFormatDouble = 6,
  eFormatString = 7,
  eFormatPointer = 8,
  eFormatRid = 9,
  eFormatBuf = 10,
  eFormatPage = 11,
  eFormatDate = 12,
  eFormatPhrase = 13,
  eFormatPageid = 14,
  eFormatLSN = 15,
  eFormatXid = 16,
  eFormatTimestamp = 17,
  eFormatNull = 18,
};

struct IFont
{
}; /* size: 0x0008 */

typedef enum
{
  SINGLE_PARTITION = 1,
} TAG_UNNAMED_19, *PTAG_UNNAMED_19;

typedef struct _RPC_HTTP_TRANSPORT_CREDENTIALS_A
{
  /* 0x0000 */ struct _SEC_WINNT_AUTH_IDENTITY_A* TransportCredentials;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ unsigned long AuthenticationTarget;
  /* 0x0010 */ unsigned long NumberOfAuthnSchemes;
  /* 0x0014 */ long Padding_14;
  /* 0x0018 */ unsigned long* AuthnSchemes;
  /* 0x0020 */ unsigned char* ServerCertificateSubject;
} RPC_HTTP_TRANSPORT_CREDENTIALS_A, *PRPC_HTTP_TRANSPORT_CREDENTIALS_A; /* size: 0x0028 */

typedef enum
{
  number_pagesIdx = 0,
  first_page_file_idIdx = 1,
  first_page_idIdx = 2,
  page_file_offsetIdx = 3,
  numa_node_idIdx = 4,
  LastField = 5,
} TAG_UNNAMED_20, *PTAG_UNNAMED_20;

struct POWERBROADCAST_SETTING
{
  /* 0x0000 */ struct _GUID PowerSetting;
  /* 0x0010 */ unsigned long DataLength;
  /* 0x0014 */ unsigned char Data[1];
  /* 0x0015 */ char __PADDING__[3];
}; /* size: 0x0018 */

enum XEErrorStates
{
  XEES_NOSTATE = 0,
  XEES_ENGINE_INIT = 1,
  XEES_ENGINE_RESOLVENAME = 2,
  XEES_ENGINE_RESOLVEHANDLE = 3,
  XEES_ENGINE_CREATESINGLETONTARGET = 4,
  XEES_ENGINE_ENABLE_EVENT = 5,
  XEES_ENGINE_REGISTER_MODULE = 6,
  XEES_ENGINE_SESSION_CREATE = 7,
  XEES_ENGINE_CREATE_PACKAGE_HOLDER = 8,
  XEES_ENGINE_FORMAT_MESSAGE = 9,
  XEES_ENGINE_GET_LAST_ERROR = 10,
  XEES_SERVICE_MUTEX = 11,
  XEES_SERVICE_RWLOCK = 12,
  XEES_SERVICE_EVENTMANUAL = 13,
  XEES_SERVICE_MEMORY = 14,
  XEES_SERVICE_ASYNCIO = 15,
  XEES_SERVICE_SECTIONS = 16,
  XEES_SERVICE_ALLOC_MESSAGE = 17,
  XEES_SESSION_CREATE = 18,
  XEES_SESSION_ADD_TARGET = 19,
  XEES_SESSION_ENABLE_EVENT = 20,
  XEES_SESSION_MANIP = 21,
  XEES_SESSION_TARGET_CREATE = 22,
  XEES_SESSION_EVENT_CREATE = 23,
  XEES_SESSION_DESERIALIZE = 24,
  XEES_SESSION_SUBMIT = 25,
  XEES_SESSION_TARGET_PRIVATE_API = 26,
  XEES_BUFFERMGR_CREATE = 27,
  XEES_BUFFER_CREATE = 28,
  XEES_PREDICATE_CREATE = 29,
  XEES_PACKAGE_ENABLE_EVENT = 30,
  XEES_FLUSH_REQUEST_CREATE = 31,
  XEES_CONFIG_CREATECRCLIST = 32,
  XEES_CONFIG_INVALID_OPTION = 33,
  XEES_ENGINE_UNREGISTER_MODULE = 34,
  XEES_STATE_LAST = 35,
};

struct IXMLDOMDocument
{
}; /* size: 0x0008 */

enum XEBaseTypes
{
  XEBT_NONE = 0,
  XEBT_INT8 = 1,
  XEBT_INT16 = 2,
  XEBT_INT32 = 3,
  XEBT_INT64 = 4,
  XEBT_UINT8 = 5,
  XEBT_UINT16 = 6,
  XEBT_UINT32 = 7,
  XEBT_UINT64 = 8,
  XEBT_FLOAT32 = 9,
  XEBT_FLOAT64 = 10,
  XEBT_CPU_CYCLE = 11,
  XEBT_FILETIME = 12,
  XEBT_PTR = 13,
  XEBT_ASTR = 14,
  XEBT_WSTR = 15,
  XEBT_UUID_PTR = 16,
  XEBT_CHAR = 17,
  XEBT_WCHAR = 18,
  XEBT_VLD_ASTR = 19,
  XEBT_VLD_WSTR = 20,
  XEBT_VLD_UUID = 21,
  XEBT_VLD_PTR = 22,
  XEBT_VLD_CALLSTACK = 23,
  XEBT_ACTIVID = 24,
  XEBT_ACTIVIDXFER = 25,
  XEBT_BOOLEAN = 26,
  XEBT_VLD_XML = 27,
  XEBT_LAST = 28,
};

struct ISynchronize
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 13,
  NVld = 7,
  VldEddOffset = 5,
  BufSize = 81,
} TAG_UNNAMED_21, *PTAG_UNNAMED_21;

typedef enum
{
  ListElementOffset = 0,
  NextPtrOffset = 8,
} TAG_UNNAMED_22, *PTAG_UNNAMED_22;

typedef enum
{
  offset = 64,
} TAG_UNNAMED_23, *PTAG_UNNAMED_23;

typedef enum
{
  wait_typeIdx = 0,
  opcodeIdx = 1,
  durationIdx = 2,
  LastField = 3,
} TAG_UNNAMED_24, *PTAG_UNNAMED_24;

typedef enum
{
  database_idIdx = 0,
  database_segment_idIdx = 1,
  filegroup_idIdx = 2,
  new_propertyIdx = 3,
  LastField = 4,
} TAG_UNNAMED_25, *PTAG_UNNAMED_25;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 7,
  NVld = 2,
  VldEddOffset = 4,
  BufSize = 48,
} TAG_UNNAMED_26, *PTAG_UNNAMED_26;

enum tag_WBEMSTATUS
{
  WBEM_NO_ERROR = 0,
  WBEM_S_NO_ERROR = 0,
  WBEM_S_SAME = 0,
  WBEM_S_FALSE = 1,
  WBEM_S_ALREADY_EXISTS = 0x40001,
  WBEM_S_RESET_TO_DEFAULT = 0x40002,
  WBEM_S_DIFFERENT = 0x40003,
  WBEM_S_TIMEDOUT = 0x40004,
  WBEM_S_NO_MORE_DATA = 0x40005,
  WBEM_S_OPERATION_CANCELLED = 0x40006,
  WBEM_S_PENDING = 0x40007,
  WBEM_S_DUPLICATE_OBJECTS = 0x40008,
  WBEM_S_ACCESS_DENIED = 0x40009,
  WBEM_S_PARTIAL_RESULTS = 0x40010,
  WBEM_S_SOURCE_NOT_AVAILABLE = 0x40017,
  WBEM_E_FAILED = -2147217407,
  WBEM_E_NOT_FOUND = -2147217406,
  WBEM_E_ACCESS_DENIED = -2147217405,
  WBEM_E_PROVIDER_FAILURE = -2147217404,
  WBEM_E_TYPE_MISMATCH = -2147217403,
  WBEM_E_OUT_OF_MEMORY = -2147217402,
  WBEM_E_INVALID_CONTEXT = -2147217401,
  WBEM_E_INVALID_PARAMETER = -2147217400,
  WBEM_E_NOT_AVAILABLE = -2147217399,
  WBEM_E_CRITICAL_ERROR = -2147217398,
  WBEM_E_INVALID_STREAM = -2147217397,
  WBEM_E_NOT_SUPPORTED = -2147217396,
  WBEM_E_INVALID_SUPERCLASS = -2147217395,
  WBEM_E_INVALID_NAMESPACE = -2147217394,
  WBEM_E_INVALID_OBJECT = -2147217393,
  WBEM_E_INVALID_CLASS = -2147217392,
  WBEM_E_PROVIDER_NOT_FOUND = -2147217391,
  WBEM_E_INVALID_PROVIDER_REGISTRATION = -2147217390,
  WBEM_E_PROVIDER_LOAD_FAILURE = -2147217389,
  WBEM_E_INITIALIZATION_FAILURE = -2147217388,
  WBEM_E_TRANSPORT_FAILURE = -2147217387,
  WBEM_E_INVALID_OPERATION = -2147217386,
  WBEM_E_INVALID_QUERY = -2147217385,
  WBEM_E_INVALID_QUERY_TYPE = -2147217384,
  WBEM_E_ALREADY_EXISTS = -2147217383,
  WBEM_E_OVERRIDE_NOT_ALLOWED = -2147217382,
  WBEM_E_PROPAGATED_QUALIFIER = -2147217381,
  WBEM_E_PROPAGATED_PROPERTY = -2147217380,
  WBEM_E_UNEXPECTED = -2147217379,
  WBEM_E_ILLEGAL_OPERATION = -2147217378,
  WBEM_E_CANNOT_BE_KEY = -2147217377,
  WBEM_E_INCOMPLETE_CLASS = -2147217376,
  WBEM_E_INVALID_SYNTAX = -2147217375,
  WBEM_E_NONDECORATED_OBJECT = -2147217374,
  WBEM_E_READ_ONLY = -2147217373,
  WBEM_E_PROVIDER_NOT_CAPABLE = -2147217372,
  WBEM_E_CLASS_HAS_CHILDREN = -2147217371,
  WBEM_E_CLASS_HAS_INSTANCES = -2147217370,
  WBEM_E_QUERY_NOT_IMPLEMENTED = -2147217369,
  WBEM_E_ILLEGAL_NULL = -2147217368,
  WBEM_E_INVALID_QUALIFIER_TYPE = -2147217367,
  WBEM_E_INVALID_PROPERTY_TYPE = -2147217366,
  WBEM_E_VALUE_OUT_OF_RANGE = -2147217365,
  WBEM_E_CANNOT_BE_SINGLETON = -2147217364,
  WBEM_E_INVALID_CIM_TYPE = -2147217363,
  WBEM_E_INVALID_METHOD = -2147217362,
  WBEM_E_INVALID_METHOD_PARAMETERS = -2147217361,
  WBEM_E_SYSTEM_PROPERTY = -2147217360,
  WBEM_E_INVALID_PROPERTY = -2147217359,
  WBEM_E_CALL_CANCELLED = -2147217358,
  WBEM_E_SHUTTING_DOWN = -2147217357,
  WBEM_E_PROPAGATED_METHOD = -2147217356,
  WBEM_E_UNSUPPORTED_PARAMETER = -2147217355,
  WBEM_E_MISSING_PARAMETER_ID = -2147217354,
  WBEM_E_INVALID_PARAMETER_ID = -2147217353,
  WBEM_E_NONCONSECUTIVE_PARAMETER_IDS = -2147217352,
  WBEM_E_PARAMETER_ID_ON_RETVAL = -2147217351,
  WBEM_E_INVALID_OBJECT_PATH = -2147217350,
  WBEM_E_OUT_OF_DISK_SPACE = -2147217349,
  WBEM_E_BUFFER_TOO_SMALL = -2147217348,
  WBEM_E_UNSUPPORTED_PUT_EXTENSION = -2147217347,
  WBEM_E_UNKNOWN_OBJECT_TYPE = -2147217346,
  WBEM_E_UNKNOWN_PACKET_TYPE = -2147217345,
  WBEM_E_MARSHAL_VERSION_MISMATCH = -2147217344,
  WBEM_E_MARSHAL_INVALID_SIGNATURE = -2147217343,
  WBEM_E_INVALID_QUALIFIER = -2147217342,
  WBEM_E_INVALID_DUPLICATE_PARAMETER = -2147217341,
  WBEM_E_TOO_MUCH_DATA = -2147217340,
  WBEM_E_SERVER_TOO_BUSY = -2147217339,
  WBEM_E_INVALID_FLAVOR = -2147217338,
  WBEM_E_CIRCULAR_REFERENCE = -2147217337,
  WBEM_E_UNSUPPORTED_CLASS_UPDATE = -2147217336,
  WBEM_E_CANNOT_CHANGE_KEY_INHERITANCE = -2147217335,
  WBEM_E_CANNOT_CHANGE_INDEX_INHERITANCE = -2147217328,
  WBEM_E_TOO_MANY_PROPERTIES = -2147217327,
  WBEM_E_UPDATE_TYPE_MISMATCH = -2147217326,
  WBEM_E_UPDATE_OVERRIDE_NOT_ALLOWED = -2147217325,
  WBEM_E_UPDATE_PROPAGATED_METHOD = -2147217324,
  WBEM_E_METHOD_NOT_IMPLEMENTED = -2147217323,
  WBEM_E_METHOD_DISABLED = -2147217322,
  WBEM_E_REFRESHER_BUSY = -2147217321,
  WBEM_E_UNPARSABLE_QUERY = -2147217320,
  WBEM_E_NOT_EVENT_CLASS = -2147217319,
  WBEM_E_MISSING_GROUP_WITHIN = -2147217318,
  WBEM_E_MISSING_AGGREGATION_LIST = -2147217317,
  WBEM_E_PROPERTY_NOT_AN_OBJECT = -2147217316,
  WBEM_E_AGGREGATING_BY_OBJECT = -2147217315,
  WBEM_E_UNINTERPRETABLE_PROVIDER_QUERY = -2147217313,
  WBEM_E_BACKUP_RESTORE_WINMGMT_RUNNING = -2147217312,
  WBEM_E_QUEUE_OVERFLOW = -2147217311,
  WBEM_E_PRIVILEGE_NOT_HELD = -2147217310,
  WBEM_E_INVALID_OPERATOR = -2147217309,
  WBEM_E_LOCAL_CREDENTIALS = -2147217308,
  WBEM_E_CANNOT_BE_ABSTRACT = -2147217307,
  WBEM_E_AMENDED_OBJECT = -2147217306,
  WBEM_E_CLIENT_TOO_SLOW = -2147217305,
  WBEM_E_NULL_SECURITY_DESCRIPTOR = -2147217304,
  WBEM_E_TIMED_OUT = -2147217303,
  WBEM_E_INVALID_ASSOCIATION = -2147217302,
  WBEM_E_AMBIGUOUS_OPERATION = -2147217301,
  WBEM_E_QUOTA_VIOLATION = -2147217300,
  WBEM_E_RESERVED_001 = -2147217299,
  WBEM_E_RESERVED_002 = -2147217298,
  WBEM_E_UNSUPPORTED_LOCALE = -2147217297,
  WBEM_E_HANDLE_OUT_OF_DATE = -2147217296,
  WBEM_E_CONNECTION_FAILED = -2147217295,
  WBEM_E_INVALID_HANDLE_REQUEST = -2147217294,
  WBEM_E_PROPERTY_NAME_TOO_WIDE = -2147217293,
  WBEM_E_CLASS_NAME_TOO_WIDE = -2147217292,
  WBEM_E_METHOD_NAME_TOO_WIDE = -2147217291,
  WBEM_E_QUALIFIER_NAME_TOO_WIDE = -2147217290,
  WBEM_E_RERUN_COMMAND = -2147217289,
  WBEM_E_DATABASE_VER_MISMATCH = -2147217288,
  WBEM_E_VETO_DELETE = -2147217287,
  WBEM_E_VETO_PUT = -2147217286,
  WBEM_E_INVALID_LOCALE = -2147217280,
  WBEM_E_PROVIDER_SUSPENDED = -2147217279,
  WBEM_E_SYNCHRONIZATION_REQUIRED = -2147217278,
  WBEM_E_NO_SCHEMA = -2147217277,
  WBEM_E_PROVIDER_ALREADY_REGISTERED = -2147217276,
  WBEM_E_PROVIDER_NOT_REGISTERED = -2147217275,
  WBEM_E_FATAL_TRANSPORT_ERROR = -2147217274,
  WBEM_E_ENCRYPTED_CONNECTION_REQUIRED = -2147217273,
  WBEM_E_PROVIDER_TIMED_OUT = -2147217272,
  WBEM_E_NO_KEY = -2147217271,
  WBEM_E_PROVIDER_DISABLED = -2147217270,
  WBEMESS_E_REGISTRATION_TOO_BROAD = -2147213311,
  WBEMESS_E_REGISTRATION_TOO_PRECISE = -2147213310,
  WBEMESS_E_AUTHZ_NOT_PRIVILEGED = -2147213309,
  WBEMMOF_E_EXPECTED_QUALIFIER_NAME = -2147205119,
  WBEMMOF_E_EXPECTED_SEMI = -2147205118,
  WBEMMOF_E_EXPECTED_OPEN_BRACE = -2147205117,
  WBEMMOF_E_EXPECTED_CLOSE_BRACE = -2147205116,
  WBEMMOF_E_EXPECTED_CLOSE_BRACKET = -2147205115,
  WBEMMOF_E_EXPECTED_CLOSE_PAREN = -2147205114,
  WBEMMOF_E_ILLEGAL_CONSTANT_VALUE = -2147205113,
  WBEMMOF_E_EXPECTED_TYPE_IDENTIFIER = -2147205112,
  WBEMMOF_E_EXPECTED_OPEN_PAREN = -2147205111,
  WBEMMOF_E_UNRECOGNIZED_TOKEN = -2147205110,
  WBEMMOF_E_UNRECOGNIZED_TYPE = -2147205109,
  WBEMMOF_E_EXPECTED_PROPERTY_NAME = -2147205108,
  WBEMMOF_E_TYPEDEF_NOT_SUPPORTED = -2147205107,
  WBEMMOF_E_UNEXPECTED_ALIAS = -2147205106,
  WBEMMOF_E_UNEXPECTED_ARRAY_INIT = -2147205105,
  WBEMMOF_E_INVALID_AMENDMENT_SYNTAX = -2147205104,
  WBEMMOF_E_INVALID_DUPLICATE_AMENDMENT = -2147205103,
  WBEMMOF_E_INVALID_PRAGMA = -2147205102,
  WBEMMOF_E_INVALID_NAMESPACE_SYNTAX = -2147205101,
  WBEMMOF_E_EXPECTED_CLASS_NAME = -2147205100,
  WBEMMOF_E_TYPE_MISMATCH = -2147205099,
  WBEMMOF_E_EXPECTED_ALIAS_NAME = -2147205098,
  WBEMMOF_E_INVALID_CLASS_DECLARATION = -2147205097,
  WBEMMOF_E_INVALID_INSTANCE_DECLARATION = -2147205096,
  WBEMMOF_E_EXPECTED_DOLLAR = -2147205095,
  WBEMMOF_E_CIMTYPE_QUALIFIER = -2147205094,
  WBEMMOF_E_DUPLICATE_PROPERTY = -2147205093,
  WBEMMOF_E_INVALID_NAMESPACE_SPECIFICATION = -2147205092,
  WBEMMOF_E_OUT_OF_RANGE = -2147205091,
  WBEMMOF_E_INVALID_FILE = -2147205090,
  WBEMMOF_E_ALIASES_IN_EMBEDDED = -2147205089,
  WBEMMOF_E_NULL_ARRAY_ELEM = -2147205088,
  WBEMMOF_E_DUPLICATE_QUALIFIER = -2147205087,
  WBEMMOF_E_EXPECTED_FLAVOR_TYPE = -2147205086,
  WBEMMOF_E_INCOMPATIBLE_FLAVOR_TYPES = -2147205085,
  WBEMMOF_E_MULTIPLE_ALIASES = -2147205084,
  WBEMMOF_E_INCOMPATIBLE_FLAVOR_TYPES2 = -2147205083,
  WBEMMOF_E_NO_ARRAYS_RETURNED = -2147205082,
  WBEMMOF_E_MUST_BE_IN_OR_OUT = -2147205081,
  WBEMMOF_E_INVALID_FLAGS_SYNTAX = -2147205080,
  WBEMMOF_E_EXPECTED_BRACE_OR_BAD_TYPE = -2147205079,
  WBEMMOF_E_UNSUPPORTED_CIMV22_QUAL_VALUE = -2147205078,
  WBEMMOF_E_UNSUPPORTED_CIMV22_DATA_TYPE = -2147205077,
  WBEMMOF_E_INVALID_DELETEINSTANCE_SYNTAX = -2147205076,
  WBEMMOF_E_INVALID_QUALIFIER_SYNTAX = -2147205075,
  WBEMMOF_E_QUALIFIER_USED_OUTSIDE_SCOPE = -2147205074,
  WBEMMOF_E_ERROR_CREATING_TEMP_FILE = -2147205073,
  WBEMMOF_E_ERROR_INVALID_INCLUDE_FILE = -2147205072,
  WBEMMOF_E_INVALID_DELETECLASS_SYNTAX = -2147205071,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 0,
  NVld = 0,
  VldEddOffset = -1,
  BufSize = 0,
} TAG_UNNAMED_27, *PTAG_UNNAMED_27;

typedef enum
{
  endpoint_typeIdx = 0,
  portIdx = 1,
  clusterIdx = 2,
  addressIdx = 3,
  LastField = 4,
} TAG_UNNAMED_28, *PTAG_UNNAMED_28;

typedef enum _tagQUERYOPTION
{
  QUERY_EXPIRATION_DATE = 1,
  QUERY_TIME_OF_LAST_CHANGE = 2,
  QUERY_CONTENT_ENCODING = 3,
  QUERY_CONTENT_TYPE = 4,
  QUERY_REFRESH = 5,
  QUERY_RECOMBINE = 6,
  QUERY_CAN_NAVIGATE = 7,
  QUERY_USES_NETWORK = 8,
  QUERY_IS_CACHED = 9,
  QUERY_IS_INSTALLEDENTRY = 10,
  QUERY_IS_CACHED_OR_MAPPED = 11,
  QUERY_USES_CACHE = 12,
  QUERY_IS_SECURE = 13,
  QUERY_IS_SAFE = 14,
  QUERY_USES_HISTORYFOLDER = 15,
  QUERY_IS_CACHED_AND_USABLE_OFFLINE = 16,
} tagQUERYOPTION, *PtagQUERYOPTION;

class AutoSpinlockHolder<259,1,1>;

struct IGlobalInterfaceTable
{
}; /* size: 0x0008 */

enum MemoryNode::FAILURES
{
  FAIL_VIRTUAL_RESERVE = 0,
  FAIL_VIRTUAL_COMMIT = 1,
  FAIL_PAGE_ALLOCATION = 2,
  FAIL_RESERVED_PAGE_ALLOCATION = 3,
  FAIL_BUFFER_ALLOCATION = 4,
  FAIL_PAGE_RESERVATION = 5,
  FAIL_LAST = 6,
};

typedef enum
{
  asb_idIdx = 0,
  database_idIdx = 1,
  initiator_flagIdx = 2,
  unique_idIdx = 3,
  timerIdx = 4,
  dialog_idIdx = 5,
  LastField = 6,
} TAG_UNNAMED_29, *PTAG_UNNAMED_29;

struct DLGTEMPLATE
{
  /* 0x0000 */ unsigned long style;
  /* 0x0004 */ unsigned long dwExtendedStyle;
  /* 0x0008 */ unsigned short cdit;
  /* 0x000a */ short x;
  /* 0x000c */ short y;
  /* 0x000e */ short cx;
  /* 0x0010 */ short cy;
}; /* size: 0x0012 */

enum WMIDPREQUESTCODE
{
  WMI_GET_ALL_DATA = 0,
  WMI_GET_SINGLE_INSTANCE = 1,
  WMI_SET_SINGLE_INSTANCE = 2,
  WMI_SET_SINGLE_ITEM = 3,
  WMI_ENABLE_EVENTS = 4,
  WMI_DISABLE_EVENTS = 5,
  WMI_ENABLE_COLLECTION = 6,
  WMI_DISABLE_COLLECTION = 7,
  WMI_REGINFO = 8,
  WMI_EXECUTE_METHOD = 9,
  WMI_CAPTURE_STATE = 10,
};

struct IEnumString
{
}; /* size: 0x0008 */

typedef struct _xml_error
{
  /* 0x0000 */ unsigned int _nLine;
  /* 0x0004 */ long Padding_15;
  /* 0x0008 */ wchar_t* _pchBuf;
  /* 0x0010 */ unsigned int _cchBuf;
  /* 0x0014 */ unsigned int _ich;
  /* 0x0018 */ wchar_t* _pszFound;
  /* 0x0020 */ wchar_t* _pszExpected;
  /* 0x0028 */ unsigned long _reserved1;
  /* 0x002c */ unsigned long _reserved2;
} xml_error, *Pxml_error; /* size: 0x0030 */

enum SHGLOBALCOUNTER
{
  GLOBALCOUNTER_SEARCHMANAGER = 0,
  GLOBALCOUNTER_SEARCHOPTIONS = 1,
  GLOBALCOUNTER_FOLDERSETTINGSCHANGE = 2,
  GLOBALCOUNTER_RATINGS = 3,
  GLOBALCOUNTER_APPROVEDSITES = 4,
  GLOBALCOUNTER_RESTRICTIONS = 5,
  GLOBALCOUNTER_SHELLSETTINGSCHANGED = 6,
  GLOBALCOUNTER_SYSTEMPIDLCHANGE = 7,
  GLOBALCOUNTER_OVERLAYMANAGER = 8,
  GLOBALCOUNTER_QUERYASSOCIATIONS = 9,
  GLOBALCOUNTER_IESESSIONS = 10,
  GLOBALCOUNTER_IEONLY_SESSIONS = 11,
  GLOBALCOUNTER_APPLICATION_DESTINATIONS = 12,
  __UNUSED_RECYCLE_WAS_GLOBALCOUNTER_CSCSYNCINPROGRESS = 13,
  GLOBALCOUNTER_BITBUCKETNUMDELETERS = 14,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_SHARES = 15,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_A = 16,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_B = 17,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_C = 18,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_D = 19,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_E = 20,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_F = 21,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_G = 22,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_H = 23,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_I = 24,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_J = 25,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_K = 26,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_L = 27,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_M = 28,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_N = 29,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_O = 30,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_P = 31,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_Q = 32,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_R = 33,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_S = 34,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_T = 35,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_U = 36,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_V = 37,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_W = 38,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_X = 39,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_Y = 40,
  GLOBALCOUNTER_RECYCLEDIRTYCOUNT_DRIVE_Z = 41,
  __UNUSED_RECYCLE_WAS_GLOBALCOUNTER_RECYCLEDIRTYCOUNT_SERVERDRIVE = 42,
  __UNUSED_RECYCLE_WAS_GLOBALCOUNTER_RECYCLEGLOBALDIRTYCOUNT = 43,
  GLOBALCOUNTER_RECYCLEBINENUM = 44,
  GLOBALCOUNTER_RECYCLEBINCORRUPTED = 45,
  GLOBALCOUNTER_RATINGS_STATECOUNTER = 46,
  GLOBALCOUNTER_PRIVATE_PROFILE_CACHE = 47,
  GLOBALCOUNTER_INTERNETTOOLBAR_LAYOUT = 48,
  GLOBALCOUNTER_FOLDERDEFINITION_CACHE = 49,
  GLOBALCOUNTER_COMMONPLACES_LIST_CACHE = 50,
  GLOBALCOUNTER_PRIVATE_PROFILE_CACHE_MACHINEWIDE = 51,
  GLOBALCOUNTER_ASSOCCHANGED = 52,
  GLOBALCOUNTER_APP_ITEMS_STATE_STORE_CACHE = 53,
  GLOBALCOUNTER_IMMERSIVE_SCALE_CACHE = 54,
  GLOBALCOUNTER_SETTINGSYNC_ENABLED = 55,
  GLOBALCOUNTER_MAXIMUMVALUE = 56,
};

typedef struct _UNWIND_HISTORY_TABLE_ENTRY
{
  /* 0x0000 */ unsigned __int64 ImageBase;
  /* 0x0008 */ struct _RUNTIME_FUNCTION* FunctionEntry;
} UNWIND_HISTORY_TABLE_ENTRY, *PUNWIND_HISTORY_TABLE_ENTRY; /* size: 0x0010 */

enum MemoryNotificationType
{
  memNotifyPhysicalReclaim = 1,
  memNotifyVirtualReclaim = 2,
  memNotifyPhysicalAvailable = 3,
  memNotifyVirtualAvailable = 4,
};

typedef enum
{
  stageIdx = 0,
  num_destinations_unsuppressedIdx = 1,
  num_services_deletedIdx = 2,
  did_reclassifyIdx = 3,
  LastField = 4,
} TAG_UNNAMED_30, *PTAG_UNNAMED_30;

typedef enum
{
  schema_mgr_database_idIdx = 0,
  versionIdx = 1,
  operationIdx = 2,
  hobt_idIdx = 3,
  ddl_operationIdx = 4,
  column_idIdx = 5,
  LastField = 6,
} TAG_UNNAMED_31, *PTAG_UNNAMED_31;

typedef enum
{
  NStatic = 4,
  NCustomizable = 1,
  NDynamic = 5,
  NVld = 1,
  VldEddOffset = 3,
  BufSize = 21,
} TAG_UNNAMED_32, *PTAG_UNNAMED_32;

typedef enum
{
  worker_addressIdx = 0,
  number_pagesIdx = 1,
  page_sizeIdx = 2,
  page_locationIdx = 3,
  allocator_typeIdx = 4,
  pool_idIdx = 5,
  memory_clerk_addressIdx = 6,
  memory_clerk_nameIdx = 7,
  LastField = 8,
} TAG_UNNAMED_33, *PTAG_UNNAMED_33;

struct XE_ETWActionMetadata
{
  /* 0x0000 */ struct _GUID m_packageGuid;
  /* 0x0010 */ struct XERelativeObjectId m_rid;
  /* 0x0014 */ unsigned int m_length;
}; /* size: 0x0018 */

enum WbemImpersonationLevelEnum
{
  wbemImpersonationLevelAnonymous = 1,
  wbemImpersonationLevelIdentify = 2,
  wbemImpersonationLevelImpersonate = 3,
  wbemImpersonationLevelDelegate = 4,
};

enum SYSGEOTYPE
{
  GEO_NATION = 1,
  GEO_LATITUDE = 2,
  GEO_LONGITUDE = 3,
  GEO_ISO2 = 4,
  GEO_ISO3 = 5,
  GEO_RFC1766 = 6,
  GEO_LCID = 7,
  GEO_FRIENDLYNAME = 8,
  GEO_OFFICIALNAME = 9,
  GEO_TIMEZONES = 10,
  GEO_OFFICIALLANGUAGES = 11,
  GEO_ISO_UN_NUMBER = 12,
  GEO_PARENT = 13,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 0,
  NVld = 0,
  VldEddOffset = -1,
  BufSize = 0,
} TAG_UNNAMED_34, *PTAG_UNNAMED_34;

typedef struct _MIDL_STUB_MESSAGE
{
  /* 0x0000 */ struct _RPC_MESSAGE* RpcMsg;
  /* 0x0008 */ unsigned char* Buffer;
  /* 0x0010 */ unsigned char* BufferStart;
  /* 0x0018 */ unsigned char* BufferEnd;
  /* 0x0020 */ unsigned char* BufferMark;
  /* 0x0028 */ unsigned long BufferLength;
  /* 0x002c */ unsigned long MemorySize;
  /* 0x0030 */ unsigned char* Memory;
  /* 0x0038 */ unsigned char IsClient;
  /* 0x0039 */ unsigned char Pad;
  /* 0x003a */ unsigned short uFlags2;
  /* 0x003c */ int ReuseBuffer;
  /* 0x0040 */ struct NDR_ALLOC_ALL_NODES_CONTEXT* pAllocAllNodesContext;
  /* 0x0048 */ struct NDR_POINTER_QUEUE_STATE* pPointerQueueState;
  /* 0x0050 */ int IgnoreEmbeddedPointers;
  /* 0x0054 */ long Padding_16;
  /* 0x0058 */ unsigned char* PointerBufferMark;
  /* 0x0060 */ unsigned char CorrDespIncrement;
  /* 0x0061 */ unsigned char uFlags;
  /* 0x0062 */ unsigned short UniquePtrCount;
  /* 0x0064 */ long Padding_17;
  /* 0x0068 */ unsigned __int64 MaxCount;
  /* 0x0070 */ unsigned long Offset;
  /* 0x0074 */ unsigned long ActualCount;
  /* 0x0078 */ void* pfnAllocate /* function */;
  /* 0x0080 */ void* pfnFree /* function */;
  /* 0x0088 */ unsigned char* StackTop;
  /* 0x0090 */ unsigned char* pPresentedType;
  /* 0x0098 */ unsigned char* pTransmitType;
  /* 0x00a0 */ void* SavedHandle;
  /* 0x00a8 */ const struct _MIDL_STUB_DESC* StubDesc;
  /* 0x00b0 */ struct _FULL_PTR_XLAT_TABLES* FullPtrXlatTables;
  /* 0x00b8 */ unsigned long FullPtrRefId;
  /* 0x00bc */ unsigned long PointerLength;
  struct /* bitfield */
  {
    /* 0x00c0 */ int fInDontFree : 1; /* bit position: 0 */
    /* 0x00c0 */ int fDontCallFreeInst : 1; /* bit position: 1 */
    /* 0x00c0 */ int fInOnlyParam : 1; /* bit position: 2 */
    /* 0x00c0 */ int fHasReturn : 1; /* bit position: 3 */
    /* 0x00c0 */ int fHasExtensions : 1; /* bit position: 4 */
    /* 0x00c0 */ int fHasNewCorrDesc : 1; /* bit position: 5 */
    /* 0x00c0 */ int fIsIn : 1; /* bit position: 6 */
    /* 0x00c0 */ int fIsOut : 1; /* bit position: 7 */
    /* 0x00c0 */ int fIsOicf : 1; /* bit position: 8 */
    /* 0x00c0 */ int fBufferValid : 1; /* bit position: 9 */
    /* 0x00c0 */ int fHasMemoryValidateCallback : 1; /* bit position: 10 */
    /* 0x00c0 */ int fInFree : 1; /* bit position: 11 */
    /* 0x00c0 */ int fNeedMCCP : 1; /* bit position: 12 */
    /* 0x00c0 */ int fUnused : 3; /* bit position: 13 */
    /* 0x00c0 */ int fUnused2 : 16; /* bit position: 16 */
  }; /* bitfield */
  /* 0x00c4 */ unsigned long dwDestContext;
  /* 0x00c8 */ void* pvDestContext;
  /* 0x00d0 */ struct
  {
    /* 0x00d0 */ void* pad[2];
    /* 0x00e0 */ void* userContext;
  } /* size: 0x0018 */** SavedContextHandles;
  /* 0x00d8 */ long ParamNumber;
  /* 0x00dc */ long Padding_18;
  /* 0x00e0 */ struct IRpcChannelBuffer* pRpcChannelBuffer;
  /* 0x00e8 */ struct ARRAY_INFO* pArrayInfo;
  /* 0x00f0 */ unsigned long* SizePtrCountArray;
  /* 0x00f8 */ unsigned long* SizePtrOffsetArray;
  /* 0x0100 */ unsigned long* SizePtrLengthArray;
  /* 0x0108 */ void* pArgQueue;
  /* 0x0110 */ unsigned long dwStubPhase;
  /* 0x0114 */ long Padding_19;
  /* 0x0118 */ void* LowStackMark;
  /* 0x0120 */ struct _NDR_ASYNC_MESSAGE* pAsyncMsg;
  /* 0x0128 */ struct _NDR_CORRELATION_INFO* pCorrInfo;
  /* 0x0130 */ unsigned char* pCorrMemory;
  /* 0x0138 */ void* pMemoryList;
  /* 0x0140 */ __int64 pCSInfo;
  /* 0x0148 */ unsigned char* ConformanceMark;
  /* 0x0150 */ unsigned char* VarianceMark;
  /* 0x0158 */ __int64 Unused;
  /* 0x0160 */ struct _NDR_PROC_CONTEXT* pContext;
  /* 0x0168 */ void* ContextHandleHash;
  /* 0x0170 */ void* pUserMarshalList;
  /* 0x0178 */ __int64 Reserved51_3;
  /* 0x0180 */ __int64 Reserved51_4;
  /* 0x0188 */ __int64 Reserved51_5;
} MIDL_STUB_MESSAGE, *PMIDL_STUB_MESSAGE; /* size: 0x0190 */

typedef enum
{
  ListElementOffset = 8,
} TAG_UNNAMED_35, *PTAG_UNNAMED_35;

struct SrvProcSLock
{
}; /* size: 0x0004 */

typedef struct __vc_attributes::cpp_quoteAttribute
{
  /* 0x0000 */ const char* string;
} _vc_attributes::cpp_quoteAttribute, *P_vc_attributes::cpp_quoteAttribute; /* size: 0x0008 */

typedef enum _tagPARSEACTION
{
  PARSE_CANONICALIZE = 1,
  PARSE_FRIENDLY = 2,
  PARSE_SECURITY_URL = 3,
  PARSE_ROOTDOCUMENT = 4,
  PARSE_DOCUMENT = 5,
  PARSE_ANCHOR = 6,
  PARSE_ENCODE_IS_UNESCAPE = 7,
  PARSE_DECODE_IS_ESCAPE = 8,
  PARSE_PATH_FROM_URL = 9,
  PARSE_URL_FROM_PATH = 10,
  PARSE_MIME = 11,
  PARSE_SERVER = 12,
  PARSE_SCHEMA = 13,
  PARSE_SITE = 14,
  PARSE_DOMAIN = 15,
  PARSE_LOCATION = 16,
  PARSE_SECURITY_DOMAIN = 17,
  PARSE_ESCAPE = 18,
  PARSE_UNESCAPE = 19,
} tagPARSEACTION, *PtagPARSEACTION;

struct IGlobalOptions
{
}; /* size: 0x0008 */

class ExDumpTriggers
{
  union
  {
    /* 0x0000 */ const unsigned int TRIGGERS_PER_BLOCK;
    /* 0x0000 */ class ExDumpTriggers* m_next;
  }; /* size: 0x0008 */
  /* 0x0008 */ unsigned long m_triggers[8];
}; /* size: 0x0028 */

enum ReplacesCorHdrNumericDefines
{
  COMIMAGE_FLAGS_ILONLY = 1,
  COMIMAGE_FLAGS_32BITREQUIRED = 2,
  COMIMAGE_FLAGS_IL_LIBRARY = 4,
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 0x10000,
  COR_VERSION_MAJOR_V2 = 2,
  COR_VERSION_MAJOR = 2,
  COR_VERSION_MINOR = 5,
  COR_DELETED_NAME_LENGTH = 8,
  COR_VTABLEGAP_NAME_LENGTH = 8,
  NATIVE_TYPE_MAX_CB = 1,
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,
  IMAGE_COR_MIH_METHODRVA = 1,
  IMAGE_COR_MIH_EHRVA = 2,
  IMAGE_COR_MIH_BASICBLOCK = 8,
  COR_VTABLE_32BIT = 1,
  COR_VTABLE_64BIT = 2,
  COR_VTABLE_FROM_UNMANAGED = 4,
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8,
  COR_VTABLE_CALL_MOST_DERIVED = 16,
  IMAGE_COR_EATJ_THUNK_SIZE = 32,
  MAX_CLASS_NAME = 1024,
  MAX_PACKAGE_NAME = 1024,
};

enum XECustomizableAttrAggregation
{
  XEAGG_MAX = 0,
  XEAGG_FLAG = 1,
  XEAGG_LAST = 2,
};

enum XECustomizableAttrCapabilities
{
  XECAC_MANDATORY = 1,
  XECAC_DEFAULT = 0,
};

struct XECustomizableAttribute
{
  /* 0x0000 */ struct XERelativeObjectId m_type;
  /* 0x0004 */ long Padding_20;
  /* 0x0008 */ const wchar_t* m_name;
  /* 0x0010 */ unsigned __int64 m_value;
  /* 0x0018 */ unsigned __int64 m_defaultValue;
  /* 0x0020 */ enum XECustomizableAttrAggregation m_aggregation;
  /* 0x0024 */ enum XECustomizableAttrCapabilities m_capabilities;
  /* 0x0028 */ const wchar_t* m_description;
  /* 0x0030 */ unsigned int m_resourceid;
  /* 0x0034 */ long __PADDING__[1];
}; /* size: 0x0038 */

struct XE_TArray<XECustomizableAttribute,2>
{
  /* 0x0000 */ struct XECustomizableAttribute m_array[2];
}; /* size: 0x0070 */

struct XE_TArray<XEDataAttribute,10>
{
  /* 0x0000 */ struct XEDataAttribute m_array[10];
}; /* size: 0x0190 */

struct XE_TEvent<4,2,10>
{
  /* 0x0000 */ struct XE_TArray<XEStaticAttribute,4> m_staticAttr;
  /* 0x00a0 */ struct XE_TArray<XECustomizableAttribute,2> m_customizableAttr;
  /* 0x0110 */ struct XE_TArray<XEDataAttribute,10> m_dynamicAttr;
  /* 0x02a0 */ struct XEEvent m_event;
}; /* size: 0x02e8 */

class XeSqlPkg::sp_statement_starting
{
  union
  {
    /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
    /* 0x0000 */ struct XE_TEvent<4,2,10> sm_metadata;
    /* 0x0000 */ struct XE_SessionContextList sm_contexts;
    struct
    {
      /* 0x0000 */ const struct _GUID sm_guid;
      /* 0x0010 */ long Padding_21[140];
      /* 0x0240 */ unsigned char m_buf[41];
    }; /* size: 0x0039 */
    /* 0x0000 */ const int source_database_idOffset;
    /* 0x0000 */ const int object_idOffset;
    /* 0x0000 */ const int object_typeOffset;
    /* 0x0000 */ const int stateOffset;
    /* 0x0000 */ const int nest_levelOffset;
    /* 0x0000 */ const int line_numberOffset;
    /* 0x0000 */ const int offsetOffset;
    /* 0x0000 */ const int offset_endOffset;
    /* 0x0000 */ const int object_nameOffset;
    /* 0x0000 */ const int statementOffset;
  }; /* size: 0x02e8 */
}; /* size: 0x0270 */

typedef enum
{
  resource_typeIdx = 0,
  modeIdx = 1,
  owner_typeIdx = 2,
  transaction_idIdx = 3,
  database_idIdx = 4,
  lockspace_workspace_idIdx = 5,
  lockspace_sub_idIdx = 6,
  lockspace_nest_idIdx = 7,
  resource_0Idx = 8,
  resource_1Idx = 9,
  resource_2Idx = 10,
  deadlock_idIdx = 11,
  object_idIdx = 12,
  associated_object_idIdx = 13,
  durationIdx = 14,
  resource_descriptionIdx = 15,
  database_nameIdx = 16,
  LastField = 17,
} TAG_UNNAMED_36, *PTAG_UNNAMED_36;

typedef enum
{
  MAX_IOS = 128,
  MAX_VOLUMES = 60,
  CALIBRATED_MAXIOBW = 100,
  CALIBRATED_MAXIOSINPROGRESS = 10,
} TAG_UNNAMED_37, *PTAG_UNNAMED_37;

class XE_ResolvedObjectXML<XEPredicateSource>
{
}; /* size: 0x0020 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 9,
  NVld = 0,
  VldEddOffset = 8,
  BufSize = 25,
} TAG_UNNAMED_38, *PTAG_UNNAMED_38;

struct NDR_ALLOC_ALL_NODES_CONTEXT;

class CAutoP<XEPackage0::RingTarget::PackageEntry>
{
}; /* size: 0x0008 */

typedef enum
{
  tasks_countIdx = 0,
  execution_flagsIdx = 1,
  LastField = 2,
} TAG_UNNAMED_39, *PTAG_UNNAMED_39;

typedef struct _ASSEMBLY_STORAGE_MAP_RESOLUTION_CALLBACK_DATA_RESOLUTION_SUCCESSFUL
{
  /* 0x0000 */ void* ResolutionContext;
  /* 0x0008 */ unsigned long RootIndexUsed;
  /* 0x000c */ long __PADDING__[1];
} ASSEMBLY_STORAGE_MAP_RESOLUTION_CALLBACK_DATA_RESOLUTION_SUCCESSFUL, *PASSEMBLY_STORAGE_MAP_RESOLUTION_CALLBACK_DATA_RESOLUTION_SUCCESSFUL; /* size: 0x0010 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 6,
  NVld = 0,
  VldEddOffset = 5,
  BufSize = 36,
} TAG_UNNAMED_40, *PTAG_UNNAMED_40;

enum WbemPrivilegeEnum
{
  wbemPrivilegeCreateToken = 1,
  wbemPrivilegePrimaryToken = 2,
  wbemPrivilegeLockMemory = 3,
  wbemPrivilegeIncreaseQuota = 4,
  wbemPrivilegeMachineAccount = 5,
  wbemPrivilegeTcb = 6,
  wbemPrivilegeSecurity = 7,
  wbemPrivilegeTakeOwnership = 8,
  wbemPrivilegeLoadDriver = 9,
  wbemPrivilegeSystemProfile = 10,
  wbemPrivilegeSystemtime = 11,
  wbemPrivilegeProfileSingleProcess = 12,
  wbemPrivilegeIncreaseBasePriority = 13,
  wbemPrivilegeCreatePagefile = 14,
  wbemPrivilegeCreatePermanent = 15,
  wbemPrivilegeBackup = 16,
  wbemPrivilegeRestore = 17,
  wbemPrivilegeShutdown = 18,
  wbemPrivilegeDebug = 19,
  wbemPrivilegeAudit = 20,
  wbemPrivilegeSystemEnvironment = 21,
  wbemPrivilegeChangeNotify = 22,
  wbemPrivilegeRemoteShutdown = 23,
  wbemPrivilegeUndock = 24,
  wbemPrivilegeSyncAgent = 25,
  wbemPrivilegeEnableDelegation = 26,
  wbemPrivilegeManageVolume = 27,
};

struct CXFileHeader
{
  union
  {
    /* 0x0000 */ const unsigned int CX_FILE_MAGIC_BITS;
    /* 0x0000 */ const unsigned int CX_FILE_VER_1;
    /* 0x0000 */ const unsigned int CX_FILE_ENCODER;
    /* 0x0000 */ const unsigned int CX_MIN_PAGE_SIZE;
    /* 0x0000 */ const unsigned int CX_MAX_PAGE_SIZE;
    /* 0x0000 */ unsigned int m_majic;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned int m_ver;
  /* 0x0008 */ unsigned int m_encoder;
  /* 0x000c */ unsigned int m_pageSize;
  /* 0x0010 */ unsigned int m_sectorSize;
  /* 0x0014 */ unsigned long m_options;
  /* 0x0018 */ unsigned int m_directorySize;
  /* 0x001c */ unsigned long m_cleanShutdown;
}; /* size: 0x0020 */

class XE_AutoP<void>
{
}; /* size: 0x0008 */

class CXFile
{
  union
  {
    /* 0x0000 */ const unsigned long NO_COMPRESSION;
    /* 0x0000 */ const unsigned long NO_CHECKSUM;
    /* 0x0000 */ const unsigned long SEQUENTIONAL_ONLY;
    /* 0x0000 */ const unsigned __int64 MAX_ENTRY_SIZE;
    /* 0x0000 */ struct CXFileHeader m_fileHeader;
  }; /* size: 0x0020 */
  /* 0x0020 */ wchar_t m_fileName[260];
  /* 0x0228 */ struct CXFileDirectoryEntry* m_dirEntries;
  /* 0x0230 */ class XE_AutoP<void> m_dirEntriesAllocation;
  /* 0x0238 */ unsigned int m_dirTableStart;
  /* 0x023c */ unsigned int m_dirTableLength;
  /* 0x0240 */ unsigned __int64 m_filePosition;
}; /* size: 0x0248 */

typedef struct __vc_attributes::helper_attributes::default_valueAttribute
{
  /* 0x0000 */ void* value;
} _vc_attributes::helper_attributes::default_valueAttribute, *P_vc_attributes::helper_attributes::default_valueAttribute; /* size: 0x0008 */

class CAutoP<XE_LogWriter<XE_MetadataEncoder<XE_FileWriter<XE_FileWriterDefaultPolicy<1,&XEPackage0::DefaultFileExtenstion>,XE_MetadataTracker> > > >
{
}; /* size: 0x0008 */

typedef enum
{
  error_numberIdx = 0,
  file_sizeIdx = 1,
  file_pathIdx = 2,
  LastField = 3,
} TAG_UNNAMED_41, *PTAG_UNNAMED_41;

struct XE_TArray<XECustomizableAttribute,1>
{
  /* 0x0000 */ struct XECustomizableAttribute m_array[1];
}; /* size: 0x0038 */

struct XE_TArray<XEDataAttribute,14>
{
  /* 0x0000 */ struct XEDataAttribute m_array[14];
}; /* size: 0x0230 */

struct XE_TEvent<4,1,14>
{
  /* 0x0000 */ struct XE_TArray<XEStaticAttribute,4> m_staticAttr;
  /* 0x00a0 */ struct XE_TArray<XECustomizableAttribute,1> m_customizableAttr;
  /* 0x00d8 */ struct XE_TArray<XEDataAttribute,14> m_dynamicAttr;
  /* 0x0308 */ struct XEEvent m_event;
}; /* size: 0x0350 */

class XeSqlPkg::preconnect_completed
{
  union
  {
    /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
    /* 0x0000 */ struct XE_TEvent<4,1,14> sm_metadata;
    /* 0x0000 */ struct XE_SessionContextList sm_contexts;
    struct
    {
      /* 0x0000 */ const struct _GUID sm_guid;
      /* 0x0010 */ long Padding_22[140];
      /* 0x0240 */ unsigned char m_buf[83];
    }; /* size: 0x0063 */
    /* 0x0000 */ const int preconnect_typeOffset;
    /* 0x0000 */ const int database_idOffset;
    /* 0x0000 */ const int object_idOffset;
    /* 0x0000 */ const int object_typeOffset;
    /* 0x0000 */ const int durationOffset;
    /* 0x0000 */ const int cpu_timeOffset;
    /* 0x0000 */ const int physical_readsOffset;
    /* 0x0000 */ const int logical_readsOffset;
    /* 0x0000 */ const int writesOffset;
    /* 0x0000 */ const int error_numberOffset;
    /* 0x0000 */ const int error_stateOffset;
    /* 0x0000 */ const int object_nameOffset;
    /* 0x0000 */ const int workload_group_nameOffset;
    /* 0x0000 */ const int database_nameOffset;
  }; /* size: 0x0350 */
}; /* size: 0x0298 */

enum WbemCimtypeEnum
{
  wbemCimtypeSint8 = 16,
  wbemCimtypeUint8 = 17,
  wbemCimtypeSint16 = 2,
  wbemCimtypeUint16 = 18,
  wbemCimtypeSint32 = 3,
  wbemCimtypeUint32 = 19,
  wbemCimtypeSint64 = 20,
  wbemCimtypeUint64 = 21,
  wbemCimtypeReal32 = 4,
  wbemCimtypeReal64 = 5,
  wbemCimtypeBoolean = 11,
  wbemCimtypeString = 8,
  wbemCimtypeDatetime = 101,
  wbemCimtypeReference = 102,
  wbemCimtypeChar16 = 103,
  wbemCimtypeObject = 13,
};

typedef struct _s__RTTIBaseClassArray
{
  union
  {
    /* 0x0000 */ const struct _s__RTTIBaseClassDescriptor2** arrayOfBaseClassDescriptors /* zero-length array */;
    /* 0x0000 */ long __PADDING__[1];
  }; /* size: 0x0004 */
} s__RTTIBaseClassArray, *Ps__RTTIBaseClassArray; /* size: 0x0004 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 33,
  NVld = 0,
  VldEddOffset = 32,
  BufSize = 196,
} TAG_UNNAMED_42, *PTAG_UNNAMED_42;

enum AllocOptions
{
  NoAllocOption = 0,
  PartOfReservation = 1,
  NoExternalNotification = 2,
  DecommitPage = 4,
  TryOnlyCurrentNode = 8,
};

typedef struct __vc_attributes::lcidAttribute
{
} _vc_attributes::lcidAttribute, *P_vc_attributes::lcidAttribute; /* size: 0x0001 */

typedef enum __MIDL_IInternetSecurityManager_0001
{
  PUAF_DEFAULT = 0,
  PUAF_NOUI = 1,
  PUAF_ISFILE = 2,
  PUAF_WARN_IF_DENIED = 4,
  PUAF_FORCEUI_FOREGROUND = 8,
  PUAF_CHECK_TIFS = 16,
  PUAF_DONTCHECKBOXINDIALOG = 32,
  PUAF_TRUSTED = 64,
  PUAF_ACCEPT_WILDCARD_SCHEME = 128,
  PUAF_ENFORCERESTRICTED = 256,
  PUAF_NOSAVEDFILECHECK = 512,
  PUAF_REQUIRESAVEDFILECHECK = 1024,
  PUAF_DONT_USE_CACHE = 4096,
  PUAF_RESERVED1 = 8192,
  PUAF_RESERVED2 = 16384,
  PUAF_LMZ_UNLOCKED = 0x10000,
  PUAF_LMZ_LOCKED = 0x20000,
  PUAF_DEFAULTZONEPOL = 0x40000,
  PUAF_NPL_USE_LOCKED_IF_RESTRICTED = 0x80000,
  PUAF_NOUIIFLOCKED = 0x100000,
  PUAF_DRAGPROTOCOLCHECK = 0x200000,
} _MIDL_IInternetSecurityManager_0001, *P_MIDL_IInternetSecurityManager_0001;

typedef struct _JOBOBJECT_END_OF_JOB_TIME_INFORMATION
{
  /* 0x0000 */ unsigned long EndOfJobTimeAction;
} JOBOBJECT_END_OF_JOB_TIME_INFORMATION, *PJOBOBJECT_END_OF_JOB_TIME_INFORMATION; /* size: 0x0004 */

enum PROXY_PHASE
{
  PROXY_CALCSIZE = 0,
  PROXY_GETBUFFER = 1,
  PROXY_MARSHAL = 2,
  PROXY_SENDRECEIVE = 3,
  PROXY_UNMARSHAL = 4,
};

typedef enum
{
  use_local_rowsetIdx = 0,
  row_deletedIdx = 1,
  LastField = 2,
} TAG_UNNAMED_43, *PTAG_UNNAMED_43;

typedef enum
{
  destination_idIdx = 0,
  brick_idIdx = 1,
  query_operation_node_idIdx = 2,
  query_idIdx = 3,
  LastField = 4,
} TAG_UNNAMED_44, *PTAG_UNNAMED_44;

class Spinlock<289,1,1>
{
}; /* size: 0x0004 */

struct std::_Pair_base<XE_FileSet::Entry *,XE_FileSet::Entry *>
{
  /* 0x0000 */ class XE_FileSet::Entry* first;
  /* 0x0008 */ class XE_FileSet::Entry* second;
}; /* size: 0x0010 */

enum SOSHOST_IOTYPE
{
  SOSHOST_IOTYPE_DISKIO = 0,
  SOSHOST_IOTYPE_NETWORKIO = 1,
  SOSHOST_IOTYPE_LAST = 2,
};

typedef union _LARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ __int64 QuadPart;
  }; /* size: 0x0008 */
} LARGE_INTEGER, *PLARGE_INTEGER; /* size: 0x0008 */

typedef struct _JOBOBJECT_BASIC_ACCOUNTING_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER TotalUserTime;
  /* 0x0008 */ union _LARGE_INTEGER TotalKernelTime;
  /* 0x0010 */ union _LARGE_INTEGER ThisPeriodTotalUserTime;
  /* 0x0018 */ union _LARGE_INTEGER ThisPeriodTotalKernelTime;
  /* 0x0020 */ unsigned long TotalPageFaultCount;
  /* 0x0024 */ unsigned long TotalProcesses;
  /* 0x0028 */ unsigned long ActiveProcesses;
  /* 0x002c */ unsigned long TotalTerminatedProcesses;
} JOBOBJECT_BASIC_ACCOUNTING_INFORMATION, *PJOBOBJECT_BASIC_ACCOUNTING_INFORMATION; /* size: 0x0030 */

typedef struct _IO_COUNTERS
{
  /* 0x0000 */ unsigned __int64 ReadOperationCount;
  /* 0x0008 */ unsigned __int64 WriteOperationCount;
  /* 0x0010 */ unsigned __int64 OtherOperationCount;
  /* 0x0018 */ unsigned __int64 ReadTransferCount;
  /* 0x0020 */ unsigned __int64 WriteTransferCount;
  /* 0x0028 */ unsigned __int64 OtherTransferCount;
} IO_COUNTERS, *PIO_COUNTERS; /* size: 0x0030 */

typedef struct _JOBOBJECT_BASIC_AND_IO_ACCOUNTING_INFORMATION
{
  /* 0x0000 */ struct _JOBOBJECT_BASIC_ACCOUNTING_INFORMATION BasicInfo;
  /* 0x0030 */ struct _IO_COUNTERS IoInfo;
} JOBOBJECT_BASIC_AND_IO_ACCOUNTING_INFORMATION, *PJOBOBJECT_BASIC_AND_IO_ACCOUNTING_INFORMATION; /* size: 0x0060 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 0,
  VldEddOffset = 2,
  BufSize = 20,
} TAG_UNNAMED_45, *PTAG_UNNAMED_45;

typedef enum
{
  NStatic = 3,
  NCustomizable = 0,
  NDynamic = 4,
  NVld = 0,
  VldEddOffset = 3,
  BufSize = 20,
} TAG_UNNAMED_46, *PTAG_UNNAMED_46;

typedef enum
{
  NStatic = 4,
  NCustomizable = 1,
  NDynamic = 7,
  NVld = 3,
  VldEddOffset = 3,
  BufSize = 42,
} TAG_UNNAMED_47, *PTAG_UNNAMED_47;

class TypeListNode<enum Worker::CallbackType,TypeListNode<NullType,TypeListNode<NullType,NullType> > >
{
}; /* size: 0x0001 */

typedef enum _IDL_CS_CONVERT
{
  IDL_CS_NO_CONVERT = 0,
  IDL_CS_IN_PLACE_CONVERT = 1,
  IDL_CS_NEW_BUFFER_CONVERT = 2,
} IDL_CS_CONVERT, *PIDL_CS_CONVERT;

struct tagMULTI_QI
{
  /* 0x0000 */ const struct _GUID* pIID;
  /* 0x0008 */ struct IUnknown* pItf;
  /* 0x0010 */ HRESULT hr;
  /* 0x0014 */ long __PADDING__[1];
}; /* size: 0x0018 */

enum CAutoSetupExecContextsForInternalTasks::EStartupErrorHandling
{
  x_StopServerOnStartupError = 0,
  x_ErrorlogAndThrowOnStartupError = 1,
};

class CAutoBase<XE_BufferMap>
{
  /* 0x0000 */ class XE_BufferMap* m_pt;
}; /* size: 0x0008 */

enum ASSOCDATA
{
  ASSOCDATA_MSIDESCRIPTOR = 1,
  ASSOCDATA_NOACTIVATEHANDLER = 2,
  ASSOCDATA_QUERYCLASSSTORE = 3,
  ASSOCDATA_HASPERUSERASSOC = 4,
  ASSOCDATA_EDITFLAGS = 5,
  ASSOCDATA_VALUE = 6,
  ASSOCDATA_MAX = 7,
};

typedef struct _SERVICE_STATUS
{
  /* 0x0000 */ unsigned long dwServiceType;
  /* 0x0004 */ unsigned long dwCurrentState;
  /* 0x0008 */ unsigned long dwControlsAccepted;
  /* 0x000c */ unsigned long dwWin32ExitCode;
  /* 0x0010 */ unsigned long dwServiceSpecificExitCode;
  /* 0x0014 */ unsigned long dwCheckPoint;
  /* 0x0018 */ unsigned long dwWaitHint;
} SERVICE_STATUS, *PSERVICE_STATUS; /* size: 0x001c */

typedef struct _FILETIME
{
  /* 0x0000 */ unsigned long dwLowDateTime;
  /* 0x0004 */ unsigned long dwHighDateTime;
} FILETIME, *PFILETIME; /* size: 0x0008 */

class CMallocSpy
{
  /* 0x0000 */ long Padding_23[2];
  /* 0x0008 */ char m_szDebugName[256];
  /* 0x0108 */ unsigned __int64 m_cbCurSize;
  /* 0x0110 */ int m_iCurLine;
  /* 0x0114 */ long Padding_24;
  /* 0x0118 */ const char* m_szCurFile;
  /* 0x0120 */ unsigned char m_bCurTag;
  /* 0x0121 */ char Padding_25[7];
  /* 0x0128 */ class CMallocSpy::CDebugData* m_pddRealloc;
  /* 0x0130 */ unsigned long m_cRef;
  /* 0x0134 */ unsigned long m_cAllocCalls;
  /* 0x0138 */ unsigned __int64 m_rgcbAllocTotal[32];
  /* 0x0238 */ unsigned __int64 m_rgcbFreeTotal[32];
  /* 0x0338 */ unsigned long m_cFreeCalls;
  /* 0x033c */ long Padding_26;
  /* 0x0340 */ class CMallocSpy::CDebugData* m_pddMemList;
  /* 0x0348 */ unsigned long m_cbFailCb;
  struct /* bitfield */
  {
    /* 0x034c */ unsigned long m_fStrict : 1; /* bit position: 0 */
    /* 0x034c */ unsigned long m_fTrackOn : 1; /* bit position: 1 */
    /* 0x034c */ unsigned long m_fAllowLarge : 1; /* bit position: 2 */
    /* 0x034c */ unsigned long m_fReadOnly : 1; /* bit position: 3 */
  }; /* bitfield */
  /* 0x0350 */ unsigned long m_bTraceOpt;
  /* 0x0354 */ struct _FILETIME m_creationTime;
  /* 0x035c */ unsigned long m_order;
  /* 0x0360 */ unsigned long m_rgcAllocHist[8];
  /* 0x0380 */ void* m_pvMark;
  /* 0x0388 */ class CMallocSpy::CDebugData* m_pddNextToIterate;
  /* 0x0390 */ class StackFrames<16>* m_pFrames;
  /* 0x0398 */ unsigned long m_cPinnedAllocs;
  /* 0x039c */ long Padding_27;
  /* 0x03a0 */ const class IMemObj* m_parentPmo;
  union
  {
    /* 0x0000 */ unsigned long sm_allocationOrder;
    /* 0x0000 */ const unsigned __int64 SizeofCGuardBytes;
    /* 0x0000 */ const char** sm_MemObjTagsToNames /* zero-length array */;
  }; /* size: 0x0008 */
}; /* size: 0x03a8 */

class CMemDbg<CMemObj>
{
  /* 0x0000 */ const unsigned __int64 xsm_cbMaxSizeFitsOnPage;
  /* 0x0008 */ long Padding_28[66];
  /* 0x0110 */ class SOS_Task* m_pTask;
  /* 0x0118 */ int m_fUseFree;
  /* 0x011c */ unsigned long m_bTraceOptions;
  /* 0x0120 */ class CMallocSpy m_msSpy;
  /* 0x04c8 */ int m_fReadOnly;
  /* 0x04cc */ int m_fCheckThreadAccess;
  /* 0x04d0 */ int m_fBeingDestroyed;
  /* 0x04d4 */ long Padding_29;
  /* 0x04d8 */ class Worker* m_pLockOwner;
}; /* size: 0x04e0 */

typedef enum
{
  ReaderBit = 1,
  ReaderCountMask = -2,
  ReaderCountShift = 1,
} TAG_UNNAMED_48, *PTAG_UNNAMED_48;

typedef struct _KEY_NAME_INFORMATION
{
  /* 0x0000 */ unsigned long NameLength;
  /* 0x0004 */ wchar_t Name[1];
  /* 0x0006 */ char __PADDING__[2];
} KEY_NAME_INFORMATION, *PKEY_NAME_INFORMATION; /* size: 0x0008 */

typedef enum
{
  internal_stvf_idIdx = 0,
  client_brick_idIdx = 1,
  client_stream_idIdx = 2,
  server_brick_idIdx = 3,
  server_session_idIdx = 4,
  LastField = 5,
} TAG_UNNAMED_49, *PTAG_UNNAMED_49;

struct XEMapEntry
{
  /* 0x0000 */ unsigned int m_code;
  /* 0x0004 */ long Padding_30;
  /* 0x0008 */ const wchar_t* m_str;
}; /* size: 0x0010 */

enum tagSTGC
{
  STGC_DEFAULT = 0,
  STGC_OVERWRITE = 1,
  STGC_ONLYIFCURRENT = 2,
  STGC_DANGEROUSLYCOMMITMERELYTODISKCACHE = 4,
  STGC_CONSOLIDATE = 8,
};

typedef enum
{
  conversation_group_actionIdx = 0,
  conversation_group_idIdx = 1,
  LastField = 2,
} TAG_UNNAMED_50, *PTAG_UNNAMED_50;

enum SYSTEM_POWER_CONDITION
{
  PoAc = 0,
  PoDc = 1,
  PoHot = 2,
  PoConditionMaximum = 3,
};

typedef enum
{
  pool_idIdx = 0,
  databasepages_memoryIdx = 1,
  cache_memoryIdx = 2,
  compile_memoryIdx = 3,
  used_memoryIdx = 4,
  target_memoryIdx = 5,
  LastField = 6,
} TAG_UNNAMED_51, *PTAG_UNNAMED_51;

typedef enum
{
  CastResult = 0,
} TAG_UNNAMED_52, *PTAG_UNNAMED_52;

enum DISTRIBUTED_CACHEID
{
  DISTRIBUTED_CACHE_TEST = 0,
  DISTRIBUTED_CACHE_OBJCP = 1,
  DISTRIBUTED_CACHE_SQLCP = 2,
  DISTRIBUTED_CACHE_LAST = 3,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 6,
  NVld = 1,
  VldEddOffset = 4,
  BufSize = 30,
} TAG_UNNAMED_53, *PTAG_UNNAMED_53;

struct IBindCallbackRedirect
{
}; /* size: 0x0008 */

typedef enum
{
  addressIdx = 0,
  sizeIdx = 1,
  tagIdx = 2,
  allocation_stampIdx = 3,
  pmo_addressIdx = 4,
  pmo_typeIdx = 5,
  LastField = 6,
} TAG_UNNAMED_54, *PTAG_UNNAMED_54;

struct AsyncIPipeDouble
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 6,
  NVld = 2,
  VldEddOffset = 3,
  BufSize = 36,
} TAG_UNNAMED_55, *PTAG_UNNAMED_55;

typedef enum _TRACE_QUERY_INFO_CLASS
{
  TraceGuidQueryList = 0,
  TraceGuidQueryInfo = 1,
  TraceGuidQueryProcess = 2,
  TraceStackTracingInfo = 3,
  TraceSystemTraceEnableFlagsInfo = 4,
  TraceSampledProfileIntervalInfo = 5,
  TraceProfileSourceConfigInfo = 6,
  TraceProfileSourceListInfo = 7,
  TracePmcEventListInfo = 8,
  TracePmcCounterListInfo = 9,
  MaxTraceSetInfoClass = 10,
} TRACE_QUERY_INFO_CLASS, *PTRACE_QUERY_INFO_CLASS;

struct tagRMTPACK
{
  /* 0x0000 */ struct ISequentialStream* pISeqStream;
  /* 0x0008 */ unsigned long cbData;
  /* 0x000c */ unsigned long cBSTR;
  /* 0x0010 */ wchar_t** rgBSTR;
  /* 0x0018 */ unsigned long cVARIANT;
  /* 0x001c */ long Padding_31;
  /* 0x0020 */ struct tagVARIANT* rgVARIANT;
  /* 0x0028 */ unsigned long cIDISPATCH;
  /* 0x002c */ long Padding_32;
  /* 0x0030 */ struct IDispatch** rgIDISPATCH;
  /* 0x0038 */ unsigned long cIUNKNOWN;
  /* 0x003c */ long Padding_33;
  /* 0x0040 */ struct IUnknown** rgIUNKNOWN;
  /* 0x0048 */ unsigned long cPROPVARIANT;
  /* 0x004c */ long Padding_34;
  /* 0x0050 */ struct tagPROPVARIANT* rgPROPVARIANT;
  /* 0x0058 */ unsigned long cArray;
  /* 0x005c */ long Padding_35;
  /* 0x0060 */ struct tagVARIANT* rgArray;
}; /* size: 0x0068 */

typedef enum
{
  message_typeIdx = 0,
  message_sub_typeIdx = 1,
  statusIdx = 2,
  backup_lsnIdx = 3,
  oldest_xact_lsnIdx = 4,
  min_skip_lsnIdx = 5,
  message_log_idIdx = 6,
  LastField = 7,
} TAG_UNNAMED_56, *PTAG_UNNAMED_56;

typedef enum
{
  statementIdx = 0,
  LastField = 1,
} TAG_UNNAMED_57, *PTAG_UNNAMED_57;

typedef enum _PROCESSOR_CACHE_TYPE
{
  CacheUnified = 0,
  CacheInstruction = 1,
  CacheData = 2,
  CacheTrace = 3,
} PROCESSOR_CACHE_TYPE, *PPROCESSOR_CACHE_TYPE;

typedef struct _CACHE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Level;
  /* 0x0001 */ unsigned char Associativity;
  /* 0x0002 */ unsigned short LineSize;
  /* 0x0004 */ unsigned long Size;
  /* 0x0008 */ enum _PROCESSOR_CACHE_TYPE Type;
} CACHE_DESCRIPTOR, *PCACHE_DESCRIPTOR; /* size: 0x000c */

typedef enum
{
  operationIdx = 0,
  endpoint_typeIdx = 1,
  eventIdx = 2,
  stateIdx = 3,
  actionIdx = 4,
  connection_idIdx = 5,
  addressIdx = 6,
  LastField = 7,
} TAG_UNNAMED_58, *PTAG_UNNAMED_58;

enum tagTYPEKIND
{
  TKIND_ENUM = 0,
  TKIND_RECORD = 1,
  TKIND_MODULE = 2,
  TKIND_INTERFACE = 3,
  TKIND_DISPATCH = 4,
  TKIND_COCLASS = 5,
  TKIND_ALIAS = 6,
  TKIND_UNION = 7,
  TKIND_MAX = 8,
};

typedef enum
{
  OsPageSize = 4096,
} TAG_UNNAMED_59, *PTAG_UNNAMED_59;

typedef enum
{
  worker_addressIdx = 0,
  number_pagesIdx = 1,
  page_sizeIdx = 2,
  page_locationIdx = 3,
  allocator_typeIdx = 4,
  numa_node_idIdx = 5,
  steal_optionsIdx = 6,
  pool_idIdx = 7,
  LastField = 8,
} TAG_UNNAMED_60, *PTAG_UNNAMED_60;

class PeriodicTimer<120000>::AutoCheck
{
  /* 0x0000 */ class PeriodicTimer<120000>* m_timer;
  /* 0x0008 */ class SOS_Ticks<InterruptTicks<unsigned __int64>,-3> m_currentTime;
}; /* size: 0x0010 */

enum tagBINDSTATUS
{
  BINDSTATUS_FINDINGRESOURCE = 1,
  BINDSTATUS_CONNECTING = 2,
  BINDSTATUS_REDIRECTING = 3,
  BINDSTATUS_BEGINDOWNLOADDATA = 4,
  BINDSTATUS_DOWNLOADINGDATA = 5,
  BINDSTATUS_ENDDOWNLOADDATA = 6,
  BINDSTATUS_BEGINDOWNLOADCOMPONENTS = 7,
  BINDSTATUS_INSTALLINGCOMPONENTS = 8,
  BINDSTATUS_ENDDOWNLOADCOMPONENTS = 9,
  BINDSTATUS_USINGCACHEDCOPY = 10,
  BINDSTATUS_SENDINGREQUEST = 11,
  BINDSTATUS_CLASSIDAVAILABLE = 12,
  BINDSTATUS_MIMETYPEAVAILABLE = 13,
  BINDSTATUS_CACHEFILENAMEAVAILABLE = 14,
  BINDSTATUS_BEGINSYNCOPERATION = 15,
  BINDSTATUS_ENDSYNCOPERATION = 16,
  BINDSTATUS_BEGINUPLOADDATA = 17,
  BINDSTATUS_UPLOADINGDATA = 18,
  BINDSTATUS_ENDUPLOADDATA = 19,
  BINDSTATUS_PROTOCOLCLASSID = 20,
  BINDSTATUS_ENCODING = 21,
  BINDSTATUS_VERIFIEDMIMETYPEAVAILABLE = 22,
  BINDSTATUS_CLASSINSTALLLOCATION = 23,
  BINDSTATUS_DECODING = 24,
  BINDSTATUS_LOADINGMIMEHANDLER = 25,
  BINDSTATUS_CONTENTDISPOSITIONATTACH = 26,
  BINDSTATUS_FILTERREPORTMIMETYPE = 27,
  BINDSTATUS_CLSIDCANINSTANTIATE = 28,
  BINDSTATUS_IUNKNOWNAVAILABLE = 29,
  BINDSTATUS_DIRECTBIND = 30,
  BINDSTATUS_RAWMIMETYPE = 31,
  BINDSTATUS_PROXYDETECTING = 32,
  BINDSTATUS_ACCEPTRANGES = 33,
  BINDSTATUS_COOKIE_SENT = 34,
  BINDSTATUS_COMPACT_POLICY_RECEIVED = 35,
  BINDSTATUS_COOKIE_SUPPRESSED = 36,
  BINDSTATUS_COOKIE_STATE_UNKNOWN = 37,
  BINDSTATUS_COOKIE_STATE_ACCEPT = 38,
  BINDSTATUS_COOKIE_STATE_REJECT = 39,
  BINDSTATUS_COOKIE_STATE_PROMPT = 40,
  BINDSTATUS_COOKIE_STATE_LEASH = 41,
  BINDSTATUS_COOKIE_STATE_DOWNGRADE = 42,
  BINDSTATUS_POLICY_HREF = 43,
  BINDSTATUS_P3P_HEADER = 44,
  BINDSTATUS_SESSION_COOKIE_RECEIVED = 45,
  BINDSTATUS_PERSISTENT_COOKIE_RECEIVED = 46,
  BINDSTATUS_SESSION_COOKIES_ALLOWED = 47,
  BINDSTATUS_CACHECONTROL = 48,
  BINDSTATUS_CONTENTDISPOSITIONFILENAME = 49,
  BINDSTATUS_MIMETEXTPLAINMISMATCH = 50,
  BINDSTATUS_PUBLISHERAVAILABLE = 51,
  BINDSTATUS_DISPLAYNAMEAVAILABLE = 52,
  BINDSTATUS_SSLUX_NAVBLOCKED = 53,
  BINDSTATUS_SERVER_MIMETYPEAVAILABLE = 54,
  BINDSTATUS_SNIFFED_CLASSIDAVAILABLE = 55,
  BINDSTATUS_64BIT_PROGRESS = 56,
  BINDSTATUS_LAST = 56,
  BINDSTATUS_RESERVED_0 = 57,
  BINDSTATUS_RESERVED_1 = 58,
  BINDSTATUS_RESERVED_2 = 59,
  BINDSTATUS_RESERVED_3 = 60,
  BINDSTATUS_RESERVED_4 = 61,
  BINDSTATUS_RESERVED_5 = 62,
  BINDSTATUS_RESERVED_6 = 63,
  BINDSTATUS_RESERVED_7 = 64,
  BINDSTATUS_RESERVED_8 = 65,
  BINDSTATUS_RESERVED_9 = 66,
  BINDSTATUS_LAST_PRIVATE = 66,
};

typedef enum
{
  idIdx = 0,
  timestampIdx = 1,
  session_idIdx = 2,
  error_codeIdx = 3,
  api_nameIdx = 4,
  calling_api_nameIdx = 5,
  call_stackIdx = 6,
  LastField = 7,
} TAG_UNNAMED_61, *PTAG_UNNAMED_61;

class SOS_MemoryBlockAllocatorFinalizer
{
  /* 0x0000 */ class SOS_MemoryBlockAllocatorFinalizer* sm_rgpFinalizer[1];
}; /* size: 0x0008 */

enum SHREGDEL_FLAGS
{
  SHREGDEL_DEFAULT = 0,
  SHREGDEL_HKCU = 1,
  SHREGDEL_HKLM = 16,
  SHREGDEL_BOTH = 17,
};

enum AllocationFailMode
{
  ALLOCATIONFAIL_RETRY = 0,
  ALLOCATIONFAIL_FAST = 1,
  ALLOCATIONFAIL_SILENT = 2,
  ALLOCATIONFAIL_NOZERO = 4,
  ALLOCATIONFAIL_FAST_PAGES = 8,
  ALLOCATIONFAIL_NO_OTHER_NODES = 16,
};

struct tagLOGFONTW
{
  /* 0x0000 */ long lfHeight;
  /* 0x0004 */ long lfWidth;
  /* 0x0008 */ long lfEscapement;
  /* 0x000c */ long lfOrientation;
  /* 0x0010 */ long lfWeight;
  /* 0x0014 */ unsigned char lfItalic;
  /* 0x0015 */ unsigned char lfUnderline;
  /* 0x0016 */ unsigned char lfStrikeOut;
  /* 0x0017 */ unsigned char lfCharSet;
  /* 0x0018 */ unsigned char lfOutPrecision;
  /* 0x0019 */ unsigned char lfClipPrecision;
  /* 0x001a */ unsigned char lfQuality;
  /* 0x001b */ unsigned char lfPitchAndFamily;
  /* 0x001c */ wchar_t lfFaceName[32];
}; /* size: 0x005c */

struct tagENUMLOGFONTEXW
{
  /* 0x0000 */ struct tagLOGFONTW elfLogFont;
  /* 0x005c */ wchar_t elfFullName[64];
  /* 0x00dc */ wchar_t elfStyle[32];
  /* 0x011c */ wchar_t elfScript[32];
}; /* size: 0x015c */

struct tagDESIGNVECTOR
{
  /* 0x0000 */ unsigned long dvReserved;
  /* 0x0004 */ unsigned long dvNumAxes;
  /* 0x0008 */ long dvValues[16];
}; /* size: 0x0048 */

struct tagENUMLOGFONTEXDVW
{
  /* 0x0000 */ struct tagENUMLOGFONTEXW elfEnumLogfontEx;
  /* 0x015c */ struct tagDESIGNVECTOR elfDesignVector;
}; /* size: 0x01a4 */

struct XSAVE_CPU_INFO
{
  /* 0x0000 */ unsigned char Processor;
  /* 0x0001 */ char Padding_36;
  /* 0x0002 */ unsigned short Family;
  /* 0x0004 */ unsigned short Model;
  /* 0x0006 */ unsigned short Stepping;
  /* 0x0008 */ unsigned short ExtendedModel;
  /* 0x000a */ char Padding_37[2];
  /* 0x000c */ unsigned long ExtendedFamily;
  /* 0x0010 */ unsigned __int64 MicrocodeVersion;
  /* 0x0018 */ unsigned long Reserved;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

typedef struct _XSAVE_SUPPORTED_CPU
{
  /* 0x0000 */ struct XSAVE_CPU_INFO CpuInfo;
  union
  {
    /* 0x0020 */ struct XSAVE_CPU_ERRATA* CpuErrata;
    /* 0x0020 */ unsigned __int64 Unused;
  }; /* size: 0x0008 */
} XSAVE_SUPPORTED_CPU, *PXSAVE_SUPPORTED_CPU; /* size: 0x0028 */

typedef struct _XSAVE_VENDOR
{
  /* 0x0000 */ unsigned long VendorId[3];
  /* 0x000c */ long Padding_38;
  /* 0x0010 */ struct _XSAVE_SUPPORTED_CPU SupportedCpu;
} XSAVE_VENDOR, *PXSAVE_VENDOR; /* size: 0x0038 */

typedef enum
{
  NStatic = 3,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 0,
  VldEddOffset = 2,
  BufSize = 16,
} TAG_UNNAMED_62, *PTAG_UNNAMED_62;

typedef enum
{
  database_idIdx = 0,
  object_idIdx = 1,
  column_idIdx = 2,
  LastField = 3,
} TAG_UNNAMED_63, *PTAG_UNNAMED_63;

class XE_ErrorContext
{
  /* 0x0000 */ struct XEErrorContext* m_ErrorContext;
}; /* size: 0x0008 */

enum XeSqlPkg::module_start::CustomizableSlots
{
  collect_statementSlot = 0,
};

enum DBSORTENUM
{
  DBSORT_ASCENDING = 0,
  DBSORT_DESCENDING = 1,
};

struct IWbemShutdown
{
}; /* size: 0x0008 */

enum tag_WBEM_CONDITION_FLAG_TYPE
{
  WBEM_FLAG_ALWAYS = 0,
  WBEM_FLAG_ONLY_IF_TRUE = 1,
  WBEM_FLAG_ONLY_IF_FALSE = 2,
  WBEM_FLAG_ONLY_IF_IDENTICAL = 3,
  WBEM_MASK_PRIMARY_CONDITION = 3,
  WBEM_FLAG_KEYS_ONLY = 4,
  WBEM_FLAG_REFS_ONLY = 8,
  WBEM_FLAG_LOCAL_ONLY = 16,
  WBEM_FLAG_PROPAGATED_ONLY = 32,
  WBEM_FLAG_SYSTEM_ONLY = 48,
  WBEM_FLAG_NONSYSTEM_ONLY = 64,
  WBEM_MASK_CONDITION_ORIGIN = 112,
  WBEM_FLAG_CLASS_OVERRIDES_ONLY = 256,
  WBEM_FLAG_CLASS_LOCAL_AND_OVERRIDES = 512,
  WBEM_MASK_CLASS_CONDITION = 768,
};

class AutoSpinlockHolder<321,1,1>;

class XE_AutoP<XEAction>
{
}; /* size: 0x0008 */

enum tagOLERENDER
{
  OLERENDER_NONE = 0,
  OLERENDER_DRAW = 1,
  OLERENDER_FORMAT = 2,
  OLERENDER_ASIS = 3,
};

typedef enum
{
  NStatic = 3,
  NCustomizable = 0,
  NDynamic = 4,
  NVld = 0,
  VldEddOffset = 3,
  BufSize = 28,
} TAG_UNNAMED_64, *PTAG_UNNAMED_64;

enum SOS_SYNC_WAIT_OPTIONS
{
  SYNC_WAIT_NORMAL = 0,
  SYNC_WAIT_BOOST = 1,
};

enum tagMKREDUCE
{
  MKRREDUCE_ONE = 0x30000,
  MKRREDUCE_TOUSER = 0x20000,
  MKRREDUCE_THROUGHUSER = 0x10000,
  MKRREDUCE_ALL = 0,
};

typedef enum
{
  object_idIdx = 0,
  plan_guide_nameIdx = 1,
  LastField = 2,
} TAG_UNNAMED_65, *PTAG_UNNAMED_65;

typedef enum _tagINTERNETFEATURELIST
{
  FEATURE_OBJECT_CACHING = 0,
  FEATURE_ZONE_ELEVATION = 1,
  FEATURE_MIME_HANDLING = 2,
  FEATURE_MIME_SNIFFING = 3,
  FEATURE_WINDOW_RESTRICTIONS = 4,
  FEATURE_WEBOC_POPUPMANAGEMENT = 5,
  FEATURE_BEHAVIORS = 6,
  FEATURE_DISABLE_MK_PROTOCOL = 7,
  FEATURE_LOCALMACHINE_LOCKDOWN = 8,
  FEATURE_SECURITYBAND = 9,
  FEATURE_RESTRICT_ACTIVEXINSTALL = 10,
  FEATURE_VALIDATE_NAVIGATE_URL = 11,
  FEATURE_RESTRICT_FILEDOWNLOAD = 12,
  FEATURE_ADDON_MANAGEMENT = 13,
  FEATURE_PROTOCOL_LOCKDOWN = 14,
  FEATURE_HTTP_USERNAME_PASSWORD_DISABLE = 15,
  FEATURE_SAFE_BINDTOOBJECT = 16,
  FEATURE_UNC_SAVEDFILECHECK = 17,
  FEATURE_GET_URL_DOM_FILEPATH_UNENCODED = 18,
  FEATURE_TABBED_BROWSING = 19,
  FEATURE_SSLUX = 20,
  FEATURE_DISABLE_NAVIGATION_SOUNDS = 21,
  FEATURE_DISABLE_LEGACY_COMPRESSION = 22,
  FEATURE_FORCE_ADDR_AND_STATUS = 23,
  FEATURE_XMLHTTP = 24,
  FEATURE_DISABLE_TELNET_PROTOCOL = 25,
  FEATURE_FEEDS = 26,
  FEATURE_BLOCK_INPUT_PROMPTS = 27,
  FEATURE_ENTRY_COUNT = 28,
} tagINTERNETFEATURELIST, *PtagINTERNETFEATURELIST;

struct XESessionNotificationPayload
{
  /* 0x0000 */ unsigned short m_version;
  /* 0x0002 */ char Padding_39[6];
  /* 0x0008 */ void* m_hSession;
  /* 0x0010 */ const struct XEObject* m_object;
  /* 0x0018 */ const struct XESessionContext* m_pSessionContext;
  /* 0x0020 */ int m_isCommit;
  /* 0x0024 */ long __PADDING__[1];
}; /* size: 0x0028 */

typedef enum
{
  addressIdx = 0,
  modeIdx = 1,
  classIdx = 2,
  keep_countIdx = 3,
  shared_countIdx = 4,
  update_countIdx = 5,
  exclusive_countIdx = 6,
  destroy_countIdx = 7,
  has_waitersIdx = 8,
  is_superlatchIdx = 9,
  is_poisonedIdx = 10,
  database_idIdx = 11,
  file_idIdx = 12,
  page_idIdx = 13,
  LastField = 14,
} TAG_UNNAMED_66, *PTAG_UNNAMED_66;

typedef enum
{
  stateIdx = 0,
  durationIdx = 1,
  LastField = 2,
} TAG_UNNAMED_67, *PTAG_UNNAMED_67;

struct XE_TArray<XEDataAttribute,20>
{
  /* 0x0000 */ struct XEDataAttribute m_array[20];
}; /* size: 0x0320 */

enum IMPORTANCE
{
  IMPORTANCE_LOW = 1,
  IMPORTANCE_NORMAL = 3,
  IMPORTANCE_HIGH = 9,
};

typedef enum
{
  database_idIdx = 0,
  object_idIdx = 1,
  column_idIdx = 2,
  datatypeIdx = 3,
  collationIdx = 4,
  nullableIdx = 5,
  maxlenIdx = 6,
  LastField = 7,
} TAG_UNNAMED_68, *PTAG_UNNAMED_68;

typedef struct _IMAGE_RESOURCE_DIRECTORY
{
  /* 0x0000 */ unsigned long Characteristics;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned short MajorVersion;
  /* 0x000a */ unsigned short MinorVersion;
  /* 0x000c */ unsigned short NumberOfNamedEntries;
  /* 0x000e */ unsigned short NumberOfIdEntries;
} IMAGE_RESOURCE_DIRECTORY, *PIMAGE_RESOURCE_DIRECTORY; /* size: 0x0010 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 2,
  NVld = 0,
  VldEddOffset = 1,
  BufSize = 12,
} TAG_UNNAMED_69, *PTAG_UNNAMED_69;

typedef struct _DOCINFOA
{
  /* 0x0000 */ int cbSize;
  /* 0x0004 */ long Padding_40;
  /* 0x0008 */ const char* lpszDocName;
  /* 0x0010 */ const char* lpszOutput;
  /* 0x0018 */ const char* lpszDatatype;
  /* 0x0020 */ unsigned long fwType;
  /* 0x0024 */ long __PADDING__[1];
} DOCINFOA, *PDOCINFOA; /* size: 0x0028 */

typedef enum __MIDL_IBindStatusCallback_0006
{
  BSCF_FIRSTDATANOTIFICATION = 1,
  BSCF_INTERMEDIATEDATANOTIFICATION = 2,
  BSCF_LASTDATANOTIFICATION = 4,
  BSCF_DATAFULLYAVAILABLE = 8,
  BSCF_AVAILABLEDATASIZEUNKNOWN = 16,
  BSCF_SKIPDRAINDATAFORFILEURLS = 32,
  BSCF_64BITLENGTHDOWNLOAD = 64,
} _MIDL_IBindStatusCallback_0006, *P_MIDL_IBindStatusCallback_0006;

enum XE_FormatMessageError
{
  XEFME_NONE = 0,
  XEFME_INVALID_CODE = 1,
  XEFME_INVALID_PACKAGE = 2,
  XEFME_INSUFFICIENT_BUFFER = 3,
  XEFME_OOM = 4,
};

class XE_AutoP<ColumnTransformRule>
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 0,
  VldEddOffset = 2,
  BufSize = 12,
} TAG_UNNAMED_70, *PTAG_UNNAMED_70;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 2,
  VldEddOffset = 0,
  BufSize = 20,
} TAG_UNNAMED_71, *PTAG_UNNAMED_71;

struct IXMLDOMParseError
{
}; /* size: 0x0008 */

struct TMemoryBlockAllocator<0,8192,524288,16,1>::NodePartitionWithActive
{
}; /* size: 0x0140 */

typedef enum
{
  ListElementOffset = 0,
  NextPtrOffset = 8,
} TAG_UNNAMED_72, *PTAG_UNNAMED_72;

enum tag_WBEM_SECURITY_FLAGS
{
  WBEM_ENABLE = 1,
  WBEM_METHOD_EXECUTE = 2,
  WBEM_FULL_WRITE_REP = 4,
  WBEM_PARTIAL_WRITE_REP = 8,
  WBEM_WRITE_PROVIDER = 16,
  WBEM_REMOTE_ACCESS = 32,
  WBEM_RIGHT_SUBSCRIBE = 64,
  WBEM_RIGHT_PUBLISH = 128,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 4,
  NVld = 0,
  VldEddOffset = 3,
  BufSize = 14,
} TAG_UNNAMED_73, *PTAG_UNNAMED_73;

struct tagEMR
{
  /* 0x0000 */ unsigned long iType;
  /* 0x0004 */ unsigned long nSize;
}; /* size: 0x0008 */

typedef struct _RECTL
{
  /* 0x0000 */ long left;
  /* 0x0004 */ long top;
  /* 0x0008 */ long right;
  /* 0x000c */ long bottom;
} RECTL, *PRECTL; /* size: 0x0010 */

typedef struct _POINTL
{
  /* 0x0000 */ long x;
  /* 0x0004 */ long y;
} POINTL, *PPOINTL; /* size: 0x0008 */

struct tagEMRPOLYDRAW
{
  /* 0x0000 */ struct tagEMR emr;
  /* 0x0008 */ struct _RECTL rclBounds;
  /* 0x0018 */ unsigned long cptl;
  /* 0x001c */ struct _POINTL aptl[1];
  /* 0x0024 */ unsigned char abTypes[1];
  /* 0x0025 */ char __PADDING__[3];
}; /* size: 0x0028 */

enum tagBINDSTRING
{
  BINDSTRING_HEADERS = 1,
  BINDSTRING_ACCEPT_MIMES = 2,
  BINDSTRING_EXTRA_URL = 3,
  BINDSTRING_LANGUAGE = 4,
  BINDSTRING_USERNAME = 5,
  BINDSTRING_PASSWORD = 6,
  BINDSTRING_UA_PIXELS = 7,
  BINDSTRING_UA_COLOR = 8,
  BINDSTRING_OS = 9,
  BINDSTRING_USER_AGENT = 10,
  BINDSTRING_ACCEPT_ENCODINGS = 11,
  BINDSTRING_POST_COOKIE = 12,
  BINDSTRING_POST_DATA_MIME = 13,
  BINDSTRING_URL = 14,
  BINDSTRING_IID = 15,
  BINDSTRING_FLAG_BIND_TO_OBJECT = 16,
  BINDSTRING_PTR_BIND_CONTEXT = 17,
  BINDSTRING_XDR_ORIGIN = 18,
  BINDSTRING_DOWNLOADPATH = 19,
  BINDSTRING_ROOTDOC_URL = 20,
  BINDSTRING_INITIAL_FILENAME = 21,
};

typedef struct _LUID
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long HighPart;
} LUID, *PLUID; /* size: 0x0008 */

typedef struct _TOKEN_SOURCE
{
  /* 0x0000 */ char SourceName[8];
  /* 0x0008 */ struct _LUID SourceIdentifier;
} TOKEN_SOURCE, *PTOKEN_SOURCE; /* size: 0x0010 */

typedef struct _TOKEN_CONTROL
{
  /* 0x0000 */ struct _LUID TokenId;
  /* 0x0008 */ struct _LUID AuthenticationId;
  /* 0x0010 */ struct _LUID ModifiedId;
  /* 0x0018 */ struct _TOKEN_SOURCE TokenSource;
} TOKEN_CONTROL, *PTOKEN_CONTROL; /* size: 0x0028 */

typedef enum
{
  dliStartProcessing = 0,
  dliNoteStartProcessing = 0,
  dliNotePreLoadLibrary = 1,
  dliNotePreGetProcAddress = 2,
  dliFailLoadLib = 3,
  dliFailGetProc = 4,
  dliNoteEndProcessing = 5,
} TAG_UNNAMED_74, *PTAG_UNNAMED_74;

typedef enum
{
  database_idIdx = 0,
  LastField = 1,
} TAG_UNNAMED_75, *PTAG_UNNAMED_75;

typedef enum
{
  MAX_ENTRIES = 16,
} TAG_UNNAMED_76, *PTAG_UNNAMED_76;

class XE_AutoRg<XMLActionTransformRule>
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 3,
  NCustomizable = 0,
  NDynamic = 1,
  NVld = 0,
  VldEddOffset = 0,
  BufSize = 4,
} TAG_UNNAMED_77, *PTAG_UNNAMED_77;

class CAutoP<XEPackage0::BucketizingTarget>
{
}; /* size: 0x0008 */

enum tagLIBFLAGS
{
  LIBFLAG_FRESTRICTED = 1,
  LIBFLAG_FCONTROL = 2,
  LIBFLAG_FHIDDEN = 4,
  LIBFLAG_FHASDISKIMAGE = 8,
};

struct XE_TArray<XEDataAttribute,13>
{
  /* 0x0000 */ struct XEDataAttribute m_array[13];
}; /* size: 0x0208 */

struct XE_TEvent<4,0,13>
{
  /* 0x0000 */ struct XE_TArray<XEStaticAttribute,4> m_staticAttr;
  /* 0x00a0 */ struct XE_TArray<XECustomizableAttribute,0> m_customizableAttr;
  /* 0x00a8 */ struct XE_TArray<XEDataAttribute,13> m_dynamicAttr;
  /* 0x02b0 */ struct XEEvent m_event;
}; /* size: 0x02f8 */

class XeSqlPkg::latch_promoted
{
  union
  {
    /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
    /* 0x0000 */ struct XE_TEvent<4,0,13> sm_metadata;
    /* 0x0000 */ struct XE_SessionContextList sm_contexts;
    struct
    {
      /* 0x0000 */ const struct _GUID sm_guid;
      /* 0x0010 */ long Padding_41[140];
      /* 0x0240 */ unsigned char m_buf[45];
    }; /* size: 0x003d */
    /* 0x0000 */ const int addressOffset;
    /* 0x0000 */ const int classOffset;
    /* 0x0000 */ const int keep_countOffset;
    /* 0x0000 */ const int shared_countOffset;
    /* 0x0000 */ const int update_countOffset;
    /* 0x0000 */ const int exclusive_countOffset;
    /* 0x0000 */ const int destroy_countOffset;
    /* 0x0000 */ const int has_waitersOffset;
    /* 0x0000 */ const int is_superlatchOffset;
    /* 0x0000 */ const int is_poisonedOffset;
    /* 0x0000 */ const int database_idOffset;
    /* 0x0000 */ const int file_idOffset;
    /* 0x0000 */ const int page_idOffset;
  }; /* size: 0x02f8 */
}; /* size: 0x0270 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 0,
  VldEddOffset = 2,
  BufSize = 18,
} TAG_UNNAMED_78, *PTAG_UNNAMED_78;

typedef enum _TOKEN_INFORMATION_CLASS
{
  TokenUser = 1,
  TokenGroups = 2,
  TokenPrivileges = 3,
  TokenOwner = 4,
  TokenPrimaryGroup = 5,
  TokenDefaultDacl = 6,
  TokenSource = 7,
  TokenType = 8,
  TokenImpersonationLevel = 9,
  TokenStatistics = 10,
  TokenRestrictedSids = 11,
  TokenSessionId = 12,
  TokenGroupsAndPrivileges = 13,
  TokenSessionReference = 14,
  TokenSandBoxInert = 15,
  TokenAuditPolicy = 16,
  TokenOrigin = 17,
  TokenElevationType = 18,
  TokenLinkedToken = 19,
  TokenElevation = 20,
  TokenHasRestrictions = 21,
  TokenAccessInformation = 22,
  TokenVirtualizationAllowed = 23,
  TokenVirtualizationEnabled = 24,
  TokenIntegrityLevel = 25,
  TokenUIAccess = 26,
  TokenMandatoryPolicy = 27,
  TokenLogonSid = 28,
  TokenIsAppContainer = 29,
  TokenCapabilities = 30,
  TokenAppContainerSid = 31,
  TokenAppContainerNumber = 32,
  TokenUserClaimAttributes = 33,
  TokenDeviceClaimAttributes = 34,
  TokenRestrictedUserClaimAttributes = 35,
  TokenRestrictedDeviceClaimAttributes = 36,
  TokenDeviceGroups = 37,
  TokenRestrictedDeviceGroups = 38,
  TokenSecurityAttributes = 39,
  TokenIsRestricted = 40,
  MaxTokenInfoClass = 41,
} TOKEN_INFORMATION_CLASS, *PTOKEN_INFORMATION_CLASS;

enum DispatcherConfigPoint
{
  DCP_NONE = 0,
  DCP_ENQUEUE = 1,
  DCP_DEQUEUE = 2,
};

typedef enum
{
  database_idIdx = 0,
  start_scan_lsnIdx = 1,
  LastField = 2,
} TAG_UNNAMED_79, *PTAG_UNNAMED_79;

typedef enum _RPC_HTTP_REDIRECTOR_STAGE
{
  RPCHTTP_RS_REDIRECT = 1,
  RPCHTTP_RS_ACCESS_1 = 2,
  RPCHTTP_RS_SESSION = 3,
  RPCHTTP_RS_ACCESS_2 = 4,
  RPCHTTP_RS_INTERFACE = 5,
} RPC_HTTP_REDIRECTOR_STAGE, *PRPC_HTTP_REDIRECTOR_STAGE;

enum PartitioningType
{
  NoPartition = 0,
  PartitionedByCpu = 1,
  PartitionedByNode = 2,
};

struct tagRAWINPUTHEADER
{
  /* 0x0000 */ unsigned long dwType;
  /* 0x0004 */ unsigned long dwSize;
  /* 0x0008 */ void* hDevice;
  /* 0x0010 */ unsigned __int64 wParam;
}; /* size: 0x0018 */

typedef enum
{
  cache_max_countIdx = 0,
  current_overflow_countIdx = 1,
  LastField = 2,
} TAG_UNNAMED_80, *PTAG_UNNAMED_80;

typedef struct _ZONEATTRIBUTES
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ wchar_t szDisplayName[260];
  /* 0x020c */ wchar_t szDescription[200];
  /* 0x039c */ wchar_t szIconPath[260];
  /* 0x05a4 */ unsigned long dwTemplateMinLevel;
  /* 0x05a8 */ unsigned long dwTemplateRecommended;
  /* 0x05ac */ unsigned long dwTemplateCurrentLevel;
  /* 0x05b0 */ unsigned long dwFlags;
} ZONEATTRIBUTES, *PZONEATTRIBUTES; /* size: 0x05b4 */

enum tagMKSYS
{
  MKSYS_NONE = 0,
  MKSYS_GENERICCOMPOSITE = 1,
  MKSYS_FILEMONIKER = 2,
  MKSYS_ANTIMONIKER = 3,
  MKSYS_ITEMMONIKER = 4,
  MKSYS_POINTERMONIKER = 5,
  MKSYS_CLASSMONIKER = 7,
  MKSYS_OBJREFMONIKER = 8,
  MKSYS_SESSIONMONIKER = 9,
  MKSYS_LUAMONIKER = 10,
};

struct IDropTarget
{
}; /* size: 0x0008 */

struct QueryStorePlanCompAggSLock
{
}; /* size: 0x0004 */

struct IMAGE_LOAD_CONFIG_DIRECTORY64
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned short MajorVersion;
  /* 0x000a */ unsigned short MinorVersion;
  /* 0x000c */ unsigned long GlobalFlagsClear;
  /* 0x0010 */ unsigned long GlobalFlagsSet;
  /* 0x0014 */ unsigned long CriticalSectionDefaultTimeout;
  /* 0x0018 */ unsigned __int64 DeCommitFreeBlockThreshold;
  /* 0x0020 */ unsigned __int64 DeCommitTotalFreeThreshold;
  /* 0x0028 */ unsigned __int64 LockPrefixTable;
  /* 0x0030 */ unsigned __int64 MaximumAllocationSize;
  /* 0x0038 */ unsigned __int64 VirtualMemoryThreshold;
  /* 0x0040 */ unsigned __int64 ProcessAffinityMask;
  /* 0x0048 */ unsigned long ProcessHeapFlags;
  /* 0x004c */ unsigned short CSDVersion;
  /* 0x004e */ unsigned short Reserved1;
  /* 0x0050 */ unsigned __int64 EditList;
  /* 0x0058 */ unsigned __int64 SecurityCookie;
  /* 0x0060 */ unsigned __int64 SEHandlerTable;
  /* 0x0068 */ unsigned __int64 SEHandlerCount;
}; /* size: 0x0070 */

enum XEObjectNameIndexes
{
  XEONI_OBJECT = 0,
  XEONI_PKG = 1,
  XEONI_MODULE = 2,
  XEONI_LAST = 3,
};

typedef enum
{
  error_numberIdx = 0,
  reason_codeIdx = 1,
  server_nameIdx = 2,
  database_nameIdx = 3,
  incident_idIdx = 4,
  LastField = 5,
} TAG_UNNAMED_81, *PTAG_UNNAMED_81;

struct tagIMEMENUITEMINFOW
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ unsigned int fType;
  /* 0x0008 */ unsigned int fState;
  /* 0x000c */ unsigned int wID;
  /* 0x0010 */ struct HBITMAP__* hbmpChecked;
  /* 0x0018 */ struct HBITMAP__* hbmpUnchecked;
  /* 0x0020 */ unsigned long dwItemData;
  /* 0x0024 */ wchar_t szString[80];
  /* 0x00c4 */ long Padding_42;
  /* 0x00c8 */ struct HBITMAP__* hbmpItem;
}; /* size: 0x00d0 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 2,
  NVld = 0,
  VldEddOffset = 1,
  BufSize = 16,
} TAG_UNNAMED_82, *PTAG_UNNAMED_82;

enum SOS_EVENT_SIGNAL_OPTIONS
{
  EVENT_SIGNAL_NORMAL = 0,
  EVENT_SIGNAL_NOBOOST = 1,
};

struct std::is_error_code_enum<unsigned short const *>
{
}; /* size: 0x0001 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 2,
  NVld = 0,
  VldEddOffset = 1,
  BufSize = 10,
} TAG_UNNAMED_83, *PTAG_UNNAMED_83;

typedef struct _SID_IDENTIFIER_AUTHORITY
{
  /* 0x0000 */ unsigned char Value[6];
} SID_IDENTIFIER_AUTHORITY, *PSID_IDENTIFIER_AUTHORITY; /* size: 0x0006 */

typedef struct _SID
{
  /* 0x0000 */ unsigned char Revision;
  /* 0x0001 */ unsigned char SubAuthorityCount;
  /* 0x0002 */ struct _SID_IDENTIFIER_AUTHORITY IdentifierAuthority;
  /* 0x0008 */ unsigned long SubAuthority[1];
} SID, *PSID; /* size: 0x000c */

typedef struct _FILE_GET_QUOTA_INFORMATION
{
  /* 0x0000 */ unsigned long NextEntryOffset;
  /* 0x0004 */ unsigned long SidLength;
  /* 0x0008 */ struct _SID Sid;
} FILE_GET_QUOTA_INFORMATION, *PFILE_GET_QUOTA_INFORMATION; /* size: 0x0014 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 0,
  VldEddOffset = 2,
  BufSize = 18,
} TAG_UNNAMED_84, *PTAG_UNNAMED_84;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 1,
  VldEddOffset = 1,
  BufSize = 16,
} TAG_UNNAMED_85, *PTAG_UNNAMED_85;

typedef struct _IMAGE_ALPHA64_RUNTIME_FUNCTION_ENTRY
{
  /* 0x0000 */ unsigned __int64 BeginAddress;
  /* 0x0008 */ unsigned __int64 EndAddress;
  /* 0x0010 */ unsigned __int64 ExceptionHandler;
  /* 0x0018 */ unsigned __int64 HandlerData;
  /* 0x0020 */ unsigned __int64 PrologEndAddress;
} IMAGE_ALPHA64_RUNTIME_FUNCTION_ENTRY, *PIMAGE_ALPHA64_RUNTIME_FUNCTION_ENTRY; /* size: 0x0028 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 10,
  NVld = 2,
  VldEddOffset = 7,
  BufSize = 48,
} TAG_UNNAMED_86, *PTAG_UNNAMED_86;

enum tagMSHCTX
{
  MSHCTX_LOCAL = 0,
  MSHCTX_NOSHAREDMEM = 1,
  MSHCTX_DIFFERENTMACHINE = 2,
  MSHCTX_INPROC = 3,
  MSHCTX_CROSSCTX = 4,
};

class CAutoP<XEPackage0::CounterTarget::PackageEntry>
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 9,
  NVld = 1,
  VldEddOffset = 7,
  BufSize = 36,
} TAG_UNNAMED_87, *PTAG_UNNAMED_87;

enum tagCOINIT
{
  COINIT_APARTMENTTHREADED = 2,
  COINIT_MULTITHREADED = 0,
  COINIT_DISABLE_OLE1DDE = 4,
  COINIT_SPEED_OVER_MEMORY = 8,
};

typedef struct _SYSTEM_SYSTEM_DISK_INFORMATION
{
  /* 0x0000 */ struct _UNICODE_STRING SystemDisk;
} SYSTEM_SYSTEM_DISK_INFORMATION, *PSYSTEM_SYSTEM_DISK_INFORMATION; /* size: 0x0010 */

typedef enum
{
  task_addressIdx = 0,
  task_typeIdx = 1,
  task_eventIdx = 2,
  task_state_oldIdx = 3,
  task_descriptionIdx = 4,
  LastField = 5,
} TAG_UNNAMED_88, *PTAG_UNNAMED_88;

typedef enum
{
  database_idIdx = 0,
  object_idIdx = 1,
  LastField = 2,
} TAG_UNNAMED_89, *PTAG_UNNAMED_89;

enum SOS_Task::TASK_CALLBACK_TYPE
{
  CALLBACK_SUSPEND = 0,
  CALLBACK_RESUME = 1,
  CALLBACK_DONE = 2,
  CALLBACK_INSTANT_RESUME = 3,
  CALLBACK_LAST = 4,
};

typedef enum _DEVICE_POWER_STATE
{
  PowerDeviceUnspecified = 0,
  PowerDeviceD0 = 1,
  PowerDeviceD1 = 2,
  PowerDeviceD2 = 3,
  PowerDeviceD3 = 4,
  PowerDeviceMaximum = 5,
} DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef enum _SYSTEM_POWER_STATE
{
  PowerSystemUnspecified = 0,
  PowerSystemWorking = 1,
  PowerSystemSleeping1 = 2,
  PowerSystemSleeping2 = 3,
  PowerSystemSleeping3 = 4,
  PowerSystemHibernate = 5,
  PowerSystemShutdown = 6,
  PowerSystemMaximum = 7,
} SYSTEM_POWER_STATE, *PSYSTEM_POWER_STATE;

struct CM_Power_Data_s
{
  /* 0x0000 */ unsigned long PD_Size;
  /* 0x0004 */ enum _DEVICE_POWER_STATE PD_MostRecentPowerState;
  /* 0x0008 */ unsigned long PD_Capabilities;
  /* 0x000c */ unsigned long PD_D1Latency;
  /* 0x0010 */ unsigned long PD_D2Latency;
  /* 0x0014 */ unsigned long PD_D3Latency;
  /* 0x0018 */ enum _DEVICE_POWER_STATE PD_PowerStateMapping[7];
  /* 0x0034 */ enum _SYSTEM_POWER_STATE PD_DeepestSystemWake;
}; /* size: 0x0038 */

struct IWbemPropertyProvider
{
}; /* size: 0x0008 */

enum XEEngineNotification
{
  XEEN_PACKAGE_ADDED = 0,
  XEEN_PACKAGE_REMOVED = 1,
  XEEN_MEMORY_SHRINK = 2,
  XEEN_MEMORY_STABLE = 3,
  XEEN_MEMORY_GROW = 4,
  XEEN_SESSION_CREATED = 5,
  XEEN_SESSION_DESTROYED = 6,
  XEEN_SESSION_EVENT_ENABLE = 7,
  XEEN_SESSION_EVENT_DISABLE = 8,
  XEEN_SESSION_TARGET_ADD = 9,
  XEEN_SESSION_TARGET_REMOVE = 10,
  XEEN_SESSION_COMMIT = 11,
  XEEN_SESSION_FLUSH = 12,
};

struct tagCREATESTRUCTW
{
  /* 0x0000 */ void* lpCreateParams;
  /* 0x0008 */ struct HINSTANCE__* hInstance;
  /* 0x0010 */ struct HMENU__* hMenu;
  /* 0x0018 */ struct HWND__* hwndParent;
  /* 0x0020 */ int cy;
  /* 0x0024 */ int cx;
  /* 0x0028 */ int y;
  /* 0x002c */ int x;
  /* 0x0030 */ long style;
  /* 0x0034 */ long Padding_43;
  /* 0x0038 */ const wchar_t* lpszName;
  /* 0x0040 */ const wchar_t* lpszClass;
  /* 0x0048 */ unsigned long dwExStyle;
  /* 0x004c */ long __PADDING__[1];
}; /* size: 0x0050 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 0,
  NVld = 0,
  VldEddOffset = -1,
  BufSize = 0,
} TAG_UNNAMED_90, *PTAG_UNNAMED_90;

typedef struct _CHAR_INFO
{
  union
  {
    union
    {
      /* 0x0000 */ wchar_t UnicodeChar;
      /* 0x0000 */ char AsciiChar;
    }; /* size: 0x0002 */
  } /* size: 0x0002 */ Char;
  /* 0x0002 */ unsigned short Attributes;
} CHAR_INFO, *PCHAR_INFO; /* size: 0x0004 */

struct tagEMRARC
{
  /* 0x0000 */ struct tagEMR emr;
  /* 0x0008 */ struct _RECTL rclBox;
  /* 0x0018 */ struct _POINTL ptlStart;
  /* 0x0020 */ struct _POINTL ptlEnd;
}; /* size: 0x0028 */

struct XEPredicateValueStream
{
  /* 0x0000 */ void* m_hStream;
  /* 0x0008 */ unsigned int m_length;
  /* 0x000c */ long __PADDING__[1];
}; /* size: 0x0010 */

enum URL_SCHEME
{
  URL_SCHEME_INVALID = -1,
  URL_SCHEME_UNKNOWN = 0,
  URL_SCHEME_FTP = 1,
  URL_SCHEME_HTTP = 2,
  URL_SCHEME_GOPHER = 3,
  URL_SCHEME_MAILTO = 4,
  URL_SCHEME_NEWS = 5,
  URL_SCHEME_NNTP = 6,
  URL_SCHEME_TELNET = 7,
  URL_SCHEME_WAIS = 8,
  URL_SCHEME_FILE = 9,
  URL_SCHEME_MK = 10,
  URL_SCHEME_HTTPS = 11,
  URL_SCHEME_SHELL = 12,
  URL_SCHEME_SNEWS = 13,
  URL_SCHEME_LOCAL = 14,
  URL_SCHEME_JAVASCRIPT = 15,
  URL_SCHEME_VBSCRIPT = 16,
  URL_SCHEME_ABOUT = 17,
  URL_SCHEME_RES = 18,
  URL_SCHEME_MSSHELLROOTED = 19,
  URL_SCHEME_MSSHELLIDLIST = 20,
  URL_SCHEME_MSHELP = 21,
  URL_SCHEME_MAXVALUE = 22,
};

typedef enum
{
  NStatic = 3,
  NCustomizable = 0,
  NDynamic = 1,
  NVld = 0,
  VldEddOffset = 0,
  BufSize = 8,
} TAG_UNNAMED_91, *PTAG_UNNAMED_91;

struct IEnumVARIANT
{
}; /* size: 0x0008 */

struct CXFrontendLookupTable<2,unsigned __int64,10240>::LookupEntry
{
  /* 0x0000 */ unsigned __int64 hashKey[2];
  /* 0x0010 */ unsigned long dictionaryEntry;
  /* 0x0014 */ long __PADDING__[1];
}; /* size: 0x0018 */

class CXFrontendLookupTable<2,unsigned __int64,10240>
{
  /* 0x0000 */ struct CXFrontendLookupTable<2,unsigned __int64,10240>::LookupEntry m_lookupTable[10240];
}; /* size: 0x3c000 */

class CXLRUHashTable<2,unsigned __int64,65536>
{
  /* 0x0000 */ unsigned int m_nextIndex;
  /* 0x0004 */ unsigned int m_maxIndex;
  /* 0x0008 */ struct CXLRUHashTable<2,unsigned __int64,65536>::LookupEntry* m_lookupTable;
}; /* size: 0x0010 */

struct DictionaryStats
{
  /* 0x0000 */ unsigned __int64 storageWrites;
  /* 0x0008 */ unsigned __int64 lruSuccessLookups;
  /* 0x0010 */ unsigned __int64 frontEndCollisions;
  /* 0x0018 */ unsigned __int64 lruAdded;
  /* 0x0020 */ unsigned __int64 lruReplaced;
  /* 0x0028 */ unsigned __int64 longestLruChain;
  /* 0x0030 */ unsigned __int64 timeWaitedForWrite;
}; /* size: 0x0038 */

class XE_CXRollingDictionary<2,unsigned __int64,10240,65536,1,1>
{
  /* 0x0000 */ long Padding_44[2];
  /* 0x0008 */ class CXFrontendLookupTable<2,unsigned __int64,10240> m_frontendTable;
  /* 0x3c008 */ class CXLRUHashTable<2,unsigned __int64,65536> m_lruTable;
  /* 0x3c018 */ unsigned int m_maxLRUElements;
  /* 0x3c01c */ long Padding_45;
  /* 0x3c020 */ class XE_CXFileWriter* m_pStorage;
  /* 0x3c028 */ void* m_pStorageLock;
  /* 0x3c030 */ struct DictionaryStats m_stats;
}; /* size: 0x3c068 */

typedef enum
{
  NBitsPerWord = 32,
  NWords = 2,
  NRemainder = 0,
} TAG_UNNAMED_92, *PTAG_UNNAMED_92;

typedef enum
{
  client_sequenceIdx = 0,
  client_connection_idIdx = 1,
  client_activity_idIdx = 2,
  LastField = 3,
} TAG_UNNAMED_93, *PTAG_UNNAMED_93;

enum XEMandatoryStaticAttributes_v0
{
  XEMSA_ID_KATMAI_RTM = 0,
  XEMSA_UUID_KATMAI_RTM = 1,
  XEMSA_VERSION_KATMAI_RTM = 2,
  XEMSA_CHANNEL_KATMAI_RTM = 3,
  XEMSA_LAST_KATMAI_RTM = 4,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 1,
  NVld = 0,
  VldEddOffset = 0,
  BufSize = 4,
} TAG_UNNAMED_94, *PTAG_UNNAMED_94;

enum tagURLTEMPLATE
{
  URLTEMPLATE_CUSTOM = 0,
  URLTEMPLATE_PREDEFINED_MIN = 0x10000,
  URLTEMPLATE_LOW = 0x10000,
  URLTEMPLATE_MEDLOW = 0x10500,
  URLTEMPLATE_MEDIUM = 0x11000,
  URLTEMPLATE_MEDHIGH = 0x11500,
  URLTEMPLATE_HIGH = 0x12000,
  URLTEMPLATE_PREDEFINED_MAX = 0x20000,
};

enum XEPackage0::BucketizingTarget::Source::Type
{
  ST_EVENT_FIELD = 0,
  ST_ACTION = 1,
};

struct XEPackage0::BucketizingTarget::Source
{
  /* 0x0000 */ enum XEPackage0::BucketizingTarget::Source::Type m_type;
  /* 0x0004 */ long Padding_46;
  union
  {
    /* 0x0008 */ const struct XEAction* m_action;
    struct
    {
      /* 0x0008 */ unsigned short m_dataAttrIdx;
      /* 0x000a */ char __PADDING__[6];
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
}; /* size: 0x0010 */

class XE_AutoRg<XE_AutoP<XEPackage0::BucketizingTarget::Entry> >
{
}; /* size: 0x0008 */

class XE_Auto
{
  /* 0x0000 */ void* m_h;
}; /* size: 0x0008 */

class XEPackage0::BucketizingTarget
{
  /* 0x0000 */ long Padding_47[2];
  /* 0x0008 */ struct XERelativeObjectId m_filterEvent;
  /* 0x000c */ long Padding_48;
  /* 0x0010 */ struct XEPackage0::BucketizingTarget::Source m_source;
  /* 0x0020 */ unsigned int m_nSlots;
  /* 0x0024 */ long Padding_49;
  /* 0x0028 */ const struct XEType* m_expectedType;
  /* 0x0030 */ unsigned int m_expectedDataLength;
  /* 0x0034 */ long Padding_50;
  /* 0x0038 */ class XE_AutoRg<XE_AutoP<XEPackage0::BucketizingTarget::Entry> > m_slots;
  /* 0x0040 */ class XE_Auto m_holder;
  /* 0x0048 */ void* m_hSession;
  /* 0x0050 */ unsigned int m_avgSerializedBucketLength;
  /* 0x0000 */ const unsigned int MAX_SLOTS;
}; /* size: 0x0058 */

enum XEErrorMinorCodes
{
  XEMINOR_OOM = 1,
  XEMINOR_TARGETINIT_FAIL = 2,
  XEMINOR_TOO_MANY_SINGLETON_TARGETS = 3,
  XEMINOR_XE_ENG_NOT_INTIALIZED = 4,
  XEMINOR_TOO_MANY_PACKAGES = 5,
  XEMINOR_XE_ENG_INITIALIZATION_FAILED = 6,
  XEMINOR_XE_ENG_DISABLED = 7,
  XEMINOR_XE_ENG_NO_XLS_RECORD = 8,
  XEMINOR_XE_ENG_WRONG_MODULE = 9,
  XEMINOR_LAST_RES = 19,
  XEMINOR_BADPARAM = 20,
  XEMINOR_CHANGELIST_NOT_OPEN = 21,
  XEMINOR_CHANGELIST_ALREADY_OPEN = 22,
  XEMINOR_BADOBJECTNAME = 23,
  XEMINOR_EVENTCONSTRAINT_VIOLATION = 24,
  XEMINOR_OBJECT_ALREADY_IN_SESSION = 25,
  XEMINOR_OBJECT_ALREADY_IN_CHANGELIST = 26,
  XEMINOR_HANDLE_IS_NOT_PACKAGE_OBJECT = 27,
  XEMINOR_INVALID_SERIALIZED_DATA = 28,
  XEMINOR_INVALID_CUSTOM_ATTRIBUTES = 29,
  XEMINOR_INVALID_EVENT_PREDICATE_BINDING = 30,
  XEMINOR_SESSION_ALREADY_EXISTS = 31,
  XEMINOR_BUFFER_TOO_SMALL = 32,
  XEMINOR_BUFFER_TOO_BIG = 33,
  XEMINOR_FLUSH_TIMEOUT_TOO_SMALL = 34,
  XEMINOR_NO_BUFFER_MGR = 35,
  XEMINOR_INVALID_SOURCE_COMPARATOR_BINDING = 36,
  XEMINOR_NOT_ENOUGH_BUFFERS = 37,
  XEMINOR_PLACEHOLDER = 38,
  XEMINOR_EVENT_TOO_BIG = 39,
  XEMINOR_LBA_TOO_SMALL = 40,
  XEMINOR_TARGET_INVALID_PARAM = 41,
  XEMINOR_MISSING_CUSTOM_ATTRIBUTES = 42,
  XEMINOR_INVALID_EVENT_SESSION_BINDING = 43,
  XEMINOR_INVALID_ACTION_SESSION_BINDING = 44,
  XEMINOR_INVALID_SESSION_NAME = 46,
  XEMINOR_OBJECT_NOT_FOUND = 47,
  XEMINOR_PACKAGE_NOT_FOUND = 48,
  XEMINOR_OBJECT_STORAGE_CONFLICT = 49,
  XEMINOR_DUPLICATE_CUSTOMIZABLE_ATTR = 50,
  XEMINOR_TYPE_MISMATCH_CUSTOMIZABLE_ATTR = 51,
  XEMINOR_OBJECT_TYPE_MISMATCH = 52,
  XEMINOR_OBJECT_NOT_IN_SESSION = 53,
  XEMINOR_INSUFFICIENT_BUFFER = 54,
  XEMINOR_PLACEHOLDER2 = 55,
  XEMINOR_ACTION_VALIDATION_FAILED = 56,
  XEMINOR_PRED_COMP_VALIDATION_FAILED = 57,
  XEMINOR_AMBIGUOUS_OBJECT_NAME = 58,
  XEMINOR_LAST_USER = 59,
  XEMINOR_INVALID_MODULE = 61,
  XEMINOR_TARGET_STATUS_MORE_DATA = 62,
  XEMINOR_INVALID_MESSAGE_CODE = 63,
  XEMINOR_INVALID_PACKAGE = 64,
  XEMINOR_PACKAGE_IN_USE = 65,
  XEMINOR_LAST_PACKAGE = 79,
  XEMINOR_LAST = 99,
};

enum SOSHOST_TASK_FLAG
{
  SOSHOST_TASK_FLAG_DELAY_ABORT = 1,
  SOSHOST_TASK_FLAG_DO_NOT_DEADLOCK = 2,
  SOSHOST_TASK_SPINLOCK_ALLOWSAMERANK = 4,
  SOSHOST_TASK_FLAG_ALL = 7,
};

typedef struct _VIDEOPARAMETERS
{
  /* 0x0000 */ struct _GUID Guid;
  /* 0x0010 */ unsigned long dwOffset;
  /* 0x0014 */ unsigned long dwCommand;
  /* 0x0018 */ unsigned long dwFlags;
  /* 0x001c */ unsigned long dwMode;
  /* 0x0020 */ unsigned long dwTVStandard;
  /* 0x0024 */ unsigned long dwAvailableModes;
  /* 0x0028 */ unsigned long dwAvailableTVStandard;
  /* 0x002c */ unsigned long dwFlickerFilter;
  /* 0x0030 */ unsigned long dwOverScanX;
  /* 0x0034 */ unsigned long dwOverScanY;
  /* 0x0038 */ unsigned long dwMaxUnscaledX;
  /* 0x003c */ unsigned long dwMaxUnscaledY;
  /* 0x0040 */ unsigned long dwPositionX;
  /* 0x0044 */ unsigned long dwPositionY;
  /* 0x0048 */ unsigned long dwBrightness;
  /* 0x004c */ unsigned long dwContrast;
  /* 0x0050 */ unsigned long dwCPType;
  /* 0x0054 */ unsigned long dwCPCommand;
  /* 0x0058 */ unsigned long dwCPStandard;
  /* 0x005c */ unsigned long dwCPKey;
  /* 0x0060 */ unsigned long bCP_APSTriggerBits;
  /* 0x0064 */ unsigned char bOEMCopyProtection[256];
} VIDEOPARAMETERS, *PVIDEOPARAMETERS; /* size: 0x0164 */

typedef struct _IO_COMPLETION_BASIC_INFORMATION
{
  /* 0x0000 */ long Depth;
} IO_COMPLETION_BASIC_INFORMATION, *PIO_COMPLETION_BASIC_INFORMATION; /* size: 0x0004 */

enum XeSqlPkg::promote_tran_starting::CustomizableSlots
{
  collect_statementSlot = 0,
};

struct IWbemObjectAccess
{
}; /* size: 0x0008 */

enum XELargeSessionBufferPolicy
{
  XELSBP_DROP = 0,
  XELSBP_TRUNCATE = 1,
};

typedef struct _CLAIM_SECURITY_ATTRIBUTES_INFORMATION
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Reserved;
  /* 0x0004 */ unsigned long AttributeCount;
  union
  {
    /* 0x0008 */ struct _CLAIM_SECURITY_ATTRIBUTE_V1* pAttributeV1;
  } /* size: 0x0008 */ Attribute;
} CLAIM_SECURITY_ATTRIBUTES_INFORMATION, *PCLAIM_SECURITY_ATTRIBUTES_INFORMATION; /* size: 0x0010 */

enum XEWaitResult
{
  XEWR_OK = 0,
  XEWR_TIMEOUT = 1,
  XEWR_FAIL = 2,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 14,
  NVld = 0,
  VldEddOffset = 13,
  BufSize = 72,
} TAG_UNNAMED_95, *PTAG_UNNAMED_95;

typedef enum
{
  ListElementOffset = 56,
  NextPtrOffset = 0,
} TAG_UNNAMED_96, *PTAG_UNNAMED_96;

class XE_OneTimeInit
{
  union
  {
    /* 0x0000 */ const long INPROGRESS;
    /* 0x0000 */ volatile long m_count;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

class XE_XMLConfig
{
  /* 0x0000 */ long Padding_51[136];
  /* 0x0220 */ struct _GUID m_sessionTag;
  /* 0x0230 */ class TSinglyLinkedList<XE_ConfigCrc>* m_pCrcList;
  /* 0x0238 */ wchar_t m_sourceFile[260];
  /* 0x0440 */ class XE_OneTimeInit m_Initializer;
  /* 0x0444 */ long Padding_52;
  /* 0x0448 */ class TSinglyLinkedList<XE_LoadedLibrary>* m_loadedLibraryList;
}; /* size: 0x0450 */

typedef enum
{
  log_block_idIdx = 0,
  vlf_statusIdx = 1,
  vlf_fileidIdx = 2,
  scan_generationIdx = 3,
  vlf_physical_filenameIdx = 4,
  vlf_logical_filenameIdx = 5,
  message_log_idIdx = 6,
  log_bufferIdx = 7,
  LastField = 8,
} TAG_UNNAMED_97, *PTAG_UNNAMED_97;

typedef enum
{
  stateIdx = 0,
  durationIdx = 1,
  timeoutIdx = 2,
  kill_flagsIdx = 3,
  LastField = 4,
} TAG_UNNAMED_98, *PTAG_UNNAMED_98;

typedef enum
{
  stageIdx = 0,
  output_treeIdx = 1,
  LastField = 2,
} TAG_UNNAMED_99, *PTAG_UNNAMED_99;

typedef union _SLIST_HEADER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned __int64 Alignment;
      /* 0x0008 */ unsigned __int64 Region;
    }; /* size: 0x0010 */
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 Depth : 16; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 Sequence : 9; /* bit position: 16 */
        /* 0x0000 */ unsigned __int64 NextEntry : 39; /* bit position: 25 */
      }; /* bitfield */
      struct /* bitfield */
      {
        /* 0x0008 */ unsigned __int64 HeaderType : 1; /* bit position: 0 */
        /* 0x0008 */ unsigned __int64 Init : 1; /* bit position: 1 */
        /* 0x0008 */ unsigned __int64 Reserved : 59; /* bit position: 2 */
        /* 0x0008 */ unsigned __int64 Region : 3; /* bit position: 61 */
      }; /* bitfield */
    } /* size: 0x0010 */ Header8;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 Depth : 16; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 Sequence : 48; /* bit position: 16 */
      }; /* bitfield */
      struct /* bitfield */
      {
        /* 0x0008 */ unsigned __int64 HeaderType : 1; /* bit position: 0 */
        /* 0x0008 */ unsigned __int64 Reserved : 3; /* bit position: 1 */
        /* 0x0008 */ unsigned __int64 NextEntry : 60; /* bit position: 4 */
      }; /* bitfield */
    } /* size: 0x0010 */ HeaderX64;
  }; /* size: 0x0010 */
} SLIST_HEADER, *PSLIST_HEADER; /* size: 0x0010 */

enum UcsTrace::UCS_TRACE_FLAGS
{
  UCS_TRCFLG_TEMP_ADJACENT_ENCRYPT = 2,
  UCS_TRCFLG_TEMP_TRANSPORT_MESSAGE = 4,
  UCS_TRCFLG_TEMP_FAILURES = 8,
  UCS_TRCFLG_TEMP_TASK_10MS_WAIT = 16,
  UCS_TRCFLG_TEMP_ASSERT_CORRUPTED_MESSAGES = 32,
  UCS_TRCFLG_TEMP_LOG_EP_CONNECT = 64,
  UCS_TRCFLG_TEMP_LOG_EP_STATE = 128,
  UCS_TRCFLG_TEMP_NO_DISPATCH = 256,
  UCS_TRCFLG_TEMP_NO_ENQUEUE = 512,
  UCS_TRCFLG_TEMP_NO_ADDAPTIVE_RECV_BUFFER = 1024,
  UCS_TRCFLG_TEMP_NO_POOLING = 2048,
  UCS_TRCFLG_TEMP_ALTER_ENDPOINT = 4096,
  UCS_TRCFLG_TEMP_LOG_SSPI = 8192,
  UCS_TRCFLG_TEMP_SPEW_SSPI = 16384,
  UCS_TRCFLG_TEMP_TASK_ACTIVITY = 0xffff8000,
  UCS_TRCFLG_TEMP_SINGLE_TASKHANDLER_MODE = 0x10000,
  UCS_TRCFLG_TEMP_TRANSMITTER = 0x20000,
  UCS_TRCFLG_DEBUG_SPEW_MESSAGES = 0x40000,
  UCS_TRCFLG_RETAIL_DBMIRRORING_TRANSPORT_CRC = 0x80000,
  UCS_TRCFLG_DEBUG_IDLE_CONNECTION_TIMEOUT = 0x100000,
  UCS_TRCFLG_DEBUG_FORCE_SHA1_OUTGOING = 0x200000,
  UCS_TRCFLG_DEBUG_FORCE_SHA1_INCOMING = 0x400000,
  UCS_TRCFLG_DEBUG_FORCE_AES_OUTGOING = 0x800000,
  UCS_TRCFLG_DEBUG_FORCE_AES_INCOMING = 0x1000000,
  UCS_TRCFLG_RETAIL_INCREASE_MAX_TASK_HANDLERS_32 = 0x2000000,
};

typedef enum _JOBOBJECTINFOCLASS
{
  JobObjectBasicAccountingInformation = 1,
  JobObjectBasicLimitInformation = 2,
  JobObjectBasicProcessIdList = 3,
  JobObjectBasicUIRestrictions = 4,
  JobObjectSecurityLimitInformation = 5,
  JobObjectEndOfJobTimeInformation = 6,
  JobObjectAssociateCompletionPortInformation = 7,
  JobObjectBasicAndIoAccountingInformation = 8,
  JobObjectExtendedLimitInformation = 9,
  JobObjectJobSetInformation = 10,
  JobObjectGroupInformation = 11,
  JobObjectNotificationLimitInformation = 12,
  JobObjectLimitViolationInformation = 13,
  JobObjectGroupInformationEx = 14,
  JobObjectCpuRateControlInformation = 15,
  JobObjectCompletionFilter = 16,
  JobObjectCompletionCounter = 17,
  JobObjectReserved1Information = 18,
  JobObjectReserved2Information = 19,
  JobObjectReserved3Information = 20,
  JobObjectReserved4Information = 21,
  JobObjectReserved5Information = 22,
  JobObjectReserved6Information = 23,
  JobObjectReserved7Information = 24,
  MaxJobObjectInfoClass = 25,
} JOBOBJECTINFOCLASS, *PJOBOBJECTINFOCLASS;

class XE_AutoRg<XMLEventTransformRule>
{
}; /* size: 0x0008 */

struct XE_CXHistoryTargetConfig
{
  /* 0x0000 */ unsigned int m_actionCountToColumnize;
  /* 0x0004 */ unsigned int m_actionCount;
  /* 0x0008 */ class XE_AutoRg<XMLActionTransformRule> m_actionRules;
  /* 0x0010 */ unsigned int m_eventCount;
  /* 0x0014 */ long Padding_53;
  /* 0x0018 */ class XE_AutoRg<XMLEventTransformRule> m_eventRules;
  /* 0x0020 */ int m_trackCasuality;
  /* 0x0024 */ long __PADDING__[1];
}; /* size: 0x0028 */

struct tagFORMATETC
{
  /* 0x0000 */ unsigned short cfFormat;
  /* 0x0002 */ char Padding_54[6];
  /* 0x0008 */ struct tagDVTARGETDEVICE* ptd;
  /* 0x0010 */ unsigned long dwAspect;
  /* 0x0014 */ long lindex;
  /* 0x0018 */ unsigned long tymed;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

struct tagSTATDATA
{
  /* 0x0000 */ struct tagFORMATETC formatetc;
  /* 0x0020 */ unsigned long advf;
  /* 0x0024 */ long Padding_55;
  /* 0x0028 */ struct IAdviseSink* pAdvSink;
  /* 0x0030 */ unsigned long dwConnection;
  /* 0x0034 */ long __PADDING__[1];
}; /* size: 0x0038 */

typedef struct _SOSKSYSTEM_TIME
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long High1Time;
  /* 0x0008 */ long High2Time;
} SOSKSYSTEM_TIME, *PSOSKSYSTEM_TIME; /* size: 0x000c */

enum XeSqlPkg::sp_cache_hit::CustomizableSlots
{
  collect_cached_textSlot = 0,
  collect_object_nameSlot = 1,
  collect_database_nameSlot = 2,
  collect_plan_handleSlot = 3,
};

typedef enum _COMPUTER_NAME_FORMAT
{
  ComputerNameNetBIOS = 0,
  ComputerNameDnsHostname = 1,
  ComputerNameDnsDomain = 2,
  ComputerNameDnsFullyQualified = 3,
  ComputerNamePhysicalNetBIOS = 4,
  ComputerNamePhysicalDnsHostname = 5,
  ComputerNamePhysicalDnsDomain = 6,
  ComputerNamePhysicalDnsFullyQualified = 7,
  ComputerNameMax = 8,
} COMPUTER_NAME_FORMAT, *PCOMPUTER_NAME_FORMAT;

enum DescriptorAllocator<SOS_TopLevelBlockDescriptor,0>::PageDesc::PageDescState
{
  Active = 0,
  Full = 1,
  Partial = 2,
  Empty = 3,
};

typedef struct _PROCESSOR_GROUP_INFO
{
  /* 0x0000 */ unsigned char MaximumProcessorCount;
  /* 0x0001 */ unsigned char ActiveProcessorCount;
  /* 0x0002 */ unsigned char Reserved[38];
  /* 0x0028 */ unsigned __int64 ActiveProcessorMask;
} PROCESSOR_GROUP_INFO, *PPROCESSOR_GROUP_INFO; /* size: 0x0030 */

typedef enum
{
  query_operation_node_idIdx = 0,
  LastField = 1,
} TAG_UNNAMED_100, *PTAG_UNNAMED_100;

struct SessionSLock
{
}; /* size: 0x0004 */

struct ICreateTypeLib2
{
}; /* size: 0x0008 */

enum tagPROPBAG2_TYPE
{
  PROPBAG2_TYPE_UNDEFINED = 0,
  PROPBAG2_TYPE_DATA = 1,
  PROPBAG2_TYPE_URL = 2,
  PROPBAG2_TYPE_OBJECT = 3,
  PROPBAG2_TYPE_STREAM = 4,
  PROPBAG2_TYPE_STORAGE = 5,
  PROPBAG2_TYPE_MONIKER = 6,
};

class SpinlockHolder<26,19,1>;

struct _TP_POOL;

enum ASSOCSTR
{
  ASSOCSTR_COMMAND = 1,
  ASSOCSTR_EXECUTABLE = 2,
  ASSOCSTR_FRIENDLYDOCNAME = 3,
  ASSOCSTR_FRIENDLYAPPNAME = 4,
  ASSOCSTR_NOOPEN = 5,
  ASSOCSTR_SHELLNEWVALUE = 6,
  ASSOCSTR_DDECOMMAND = 7,
  ASSOCSTR_DDEIFEXEC = 8,
  ASSOCSTR_DDEAPPLICATION = 9,
  ASSOCSTR_DDETOPIC = 10,
  ASSOCSTR_INFOTIP = 11,
  ASSOCSTR_QUICKTIP = 12,
  ASSOCSTR_TILEINFO = 13,
  ASSOCSTR_CONTENTTYPE = 14,
  ASSOCSTR_DEFAULTICON = 15,
  ASSOCSTR_SHELLEXTENSION = 16,
  ASSOCSTR_MAX = 17,
};

typedef struct _API_SET_NAMESPACE_ENTRY
{
  /* 0x0000 */ unsigned long NameOffset;
  /* 0x0004 */ unsigned long NameLength;
  /* 0x0008 */ unsigned long DataOffset;
} API_SET_NAMESPACE_ENTRY, *PAPI_SET_NAMESPACE_ENTRY; /* size: 0x000c */

class Spinlock<69,16,1>
{
}; /* size: 0x0004 */

typedef enum
{
  log_operationIdx = 0,
  rowset_idIdx = 1,
  text_pointer_timestampIdx = 2,
  text_pointer_file_idIdx = 3,
  text_pointer_page_idIdx = 4,
  text_pointer_slot_idIdx = 5,
  coloffsetIdx = 6,
  text_info_flagsIdx = 7,
  text_sizeIdx = 8,
  offsetIdx = 9,
  old_sizeIdx = 10,
  new_sizeIdx = 11,
  current_lsnIdx = 12,
  LastField = 13,
} TAG_UNNAMED_101, *PTAG_UNNAMED_101;

typedef enum
{
  database_idIdx = 0,
  table_idIdx = 1,
  fragment_idIdx = 2,
  LastField = 3,
} TAG_UNNAMED_102, *PTAG_UNNAMED_102;

class CXBaseColumn
{
  /* 0x0000 */ long Padding_56[2];
  /* 0x0008 */ unsigned int m_currentElem;
  /* 0x000c */ unsigned int m_elementCount;
  /* 0x0010 */ unsigned int m_elementSize;
}; /* size: 0x0018 */

enum TaskEnqueueOptions
{
  UseHotWorker = 1,
  PermanentTask = 2,
  UseWorkerPoolOnly = 4,
  UseColdWorker = 8,
  PreemptiveTask = 16,
  GuaranteeWorker = 32,
  EnqueueExclusive = 64,
  WaitableTask = 128,
  SystemTimerTask = 256,
  OnDemandTask = 512,
  AllowFailureOnLowMem = 1024,
  SpreadAcrossNodes = 2048,
  PrimaryTask = 4096,
};

typedef struct _nlsversioninfoex
{
  /* 0x0000 */ unsigned long dwNLSVersionInfoSize;
  /* 0x0004 */ unsigned long dwNLSVersion;
  /* 0x0008 */ unsigned long dwDefinedVersion;
  /* 0x000c */ unsigned long dwEffectiveId;
  /* 0x0010 */ struct _GUID guidCustomVersion;
} nlsversioninfoex, *Pnlsversioninfoex; /* size: 0x0020 */

enum WORKER_CTRL_FLAGS
{
  WORKER_CTRL_ACQUIRETHREAD = 1,
  WORKER_CTRL_THREADREQUIRED = 2,
};

struct IViewRowset
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 0,
  VldEddOffset = 2,
  BufSize = 12,
} TAG_UNNAMED_103, *PTAG_UNNAMED_103;

enum XeSqlPkg::BrokerAckType
{
  BAT_MESSAGE_ACK_SENT = 1,
  BAT_ACK_SENT = 2,
  BAT_MESSAGE_ACK_RECEIVED = 3,
  BAT_ACK_RECEIVED = 4,
};

class SEListElem
{
  /* 0x0000 */ class SEListElem* m_prev;
  /* 0x0008 */ class SEListElem* m_next;
}; /* size: 0x0010 */

class ListBase
{
  /* 0x0000 */ class SEListElem m_anchor;
}; /* size: 0x0010 */

class SEList<SOS_RingBuffer,0>
{
  /* 0x0000 */ class ListBase m_list;
}; /* size: 0x0010 */

typedef enum
{
  elapsed_since_start_msIdx = 0,
  LastField = 1,
} TAG_UNNAMED_104, *PTAG_UNNAMED_104;

class XE_AutoP<XE_CXHistoryTargetConfig>
{
}; /* size: 0x0008 */

enum tagVARFLAGS
{
  VARFLAG_FREADONLY = 1,
  VARFLAG_FSOURCE = 2,
  VARFLAG_FBINDABLE = 4,
  VARFLAG_FREQUESTEDIT = 8,
  VARFLAG_FDISPLAYBIND = 16,
  VARFLAG_FDEFAULTBIND = 32,
  VARFLAG_FHIDDEN = 64,
  VARFLAG_FRESTRICTED = 128,
  VARFLAG_FDEFAULTCOLLELEM = 256,
  VARFLAG_FUIDEFAULT = 512,
  VARFLAG_FNONBROWSABLE = 1024,
  VARFLAG_FREPLACEABLE = 2048,
  VARFLAG_FIMMEDIATEBIND = 4096,
};

typedef struct _LONG_SIZEDARR
{
  /* 0x0000 */ unsigned long clSize;
  /* 0x0004 */ long Padding_57;
  /* 0x0008 */ unsigned long* pData;
} LONG_SIZEDARR, *PLONG_SIZEDARR; /* size: 0x0010 */

typedef enum
{
  LinkOffset = 32,
} TAG_UNNAMED_105, *PTAG_UNNAMED_105;

struct SESList<XE_CompressionCache::MemBlock,0>
{
  /* 0x0000 */ struct SListBase m_list;
}; /* size: 0x0008 */

class XE_AutoResource<void *,136>
{
}; /* size: 0x0008 */

class XE_CompressionCache
{
  /* 0x0000 */ unsigned int m_memUsed;
  /* 0x0004 */ long Padding_58;
  /* 0x0008 */ unsigned __int64 m_maxMem;
  /* 0x0010 */ unsigned int m_minAlloc;
  /* 0x0014 */ long Padding_59;
  /* 0x0018 */ struct SESList<XE_CompressionCache::MemBlock,0> m_freeList;
  /* 0x0020 */ class XE_AutoResource<void *,136> m_lock;
}; /* size: 0x0028 */

enum XEPackageCapabilities
{
  XEPC_UTILITY = 1,
  XEPC_DYNAMIC = 2,
  XEPC_NONXACT = 4,
  XEPC_DEFAULT = 0,
};

struct IPersistFile
{
}; /* size: 0x0008 */

typedef enum
{
  ArgCount = 0,
} TAG_UNNAMED_106, *PTAG_UNNAMED_106;

typedef enum
{
  xdesid_lowIdx = 0,
  xdesid_highIdx = 1,
  database_idIdx = 2,
  originator_db_versionIdx = 3,
  originator_pubidIdx = 4,
  originatorIdx = 5,
  originator_dbIdx = 6,
  originator_lsnIdx = 7,
  current_lsnIdx = 8,
  LastField = 9,
} TAG_UNNAMED_107, *PTAG_UNNAMED_107;

class SpinlockHolder<242,1,1>
{
  /* 0x0000 */ class Spinlock<242,1,1>* m_pSpinlock;
  /* 0x0008 */ int m_isLocked;
}; /* size: 0x0010 */

enum tag_WBEM_LOGIN_TYPE
{
  WBEM_FLAG_INPROC_LOGIN = 0,
  WBEM_FLAG_LOCAL_LOGIN = 1,
  WBEM_FLAG_REMOTE_LOGIN = 2,
  WBEM_AUTHENTICATION_METHOD_MASK = 15,
  WBEM_FLAG_USE_MULTIPLE_CHALLENGES = 16,
};

struct TListSLock
{
}; /* size: 0x0004 */

class TList<SchedulerManagerList,SOS_Scheduler,8,TListSLock>
{
  /* 0x0000 */ long Padding_60[4];
  /* 0x0010 */ struct TListSLock m_lock;
  /* 0x0014 */ unsigned int m_entryCount;
}; /* size: 0x0018 */

struct XE_TArray<XEDataAttribute,3>
{
  /* 0x0000 */ struct XEDataAttribute m_array[3];
}; /* size: 0x0078 */

struct XE_TEvent<4,0,3>
{
  /* 0x0000 */ struct XE_TArray<XEStaticAttribute,4> m_staticAttr;
  /* 0x00a0 */ struct XE_TArray<XECustomizableAttribute,0> m_customizableAttr;
  /* 0x00a8 */ struct XE_TArray<XEDataAttribute,3> m_dynamicAttr;
  /* 0x0120 */ struct XEEvent m_event;
}; /* size: 0x0168 */

class XeCloudMinPkg::ping_send_complete
{
  union
  {
    /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
    /* 0x0000 */ struct XE_TEvent<4,0,3> sm_metadata;
    /* 0x0000 */ struct XE_SessionContextList sm_contexts;
    struct
    {
      /* 0x0000 */ const struct _GUID sm_guid;
      /* 0x0010 */ long Padding_61[140];
      /* 0x0240 */ unsigned char m_buf[17];
    }; /* size: 0x0021 */
    /* 0x0000 */ const int sent_or_notOffset;
    /* 0x0000 */ const int message_idOffset;
    /* 0x0000 */ const int function_nameOffset;
  }; /* size: 0x0168 */
}; /* size: 0x0258 */

enum XeSqlPkg::database_suspect_data_page::CustomizableSlots
{
  collect_database_nameSlot = 0,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 0,
  VldEddOffset = 2,
  BufSize = 14,
} TAG_UNNAMED_108, *PTAG_UNNAMED_108;

typedef enum
{
  NStatic = 4,
  NCustomizable = 1,
  NDynamic = 1,
  NVld = 1,
  VldEddOffset = -1,
  BufSize = 8,
} TAG_UNNAMED_109, *PTAG_UNNAMED_109;

struct tagRemFORMATETC
{
  /* 0x0000 */ unsigned long cfFormat;
  /* 0x0004 */ unsigned long ptd;
  /* 0x0008 */ unsigned long dwAspect;
  /* 0x000c */ long lindex;
  /* 0x0010 */ unsigned long tymed;
}; /* size: 0x0014 */

class SpinlockHolder<332,0,0>;

typedef enum __MIDL_IBindStatusCallback_0002
{
  BINDINFOF_URLENCODESTGMEDDATA = 1,
  BINDINFOF_URLENCODEDEXTRAINFO = 2,
} _MIDL_IBindStatusCallback_0002, *P_MIDL_IBindStatusCallback_0002;

class Spinlock<249,1,1>
{
}; /* size: 0x0004 */

typedef struct _ACTRL_ACCESS_INFOA
{
  /* 0x0000 */ unsigned long fAccessPermission;
  /* 0x0004 */ long Padding_62;
  /* 0x0008 */ char* lpAccessPermissionName;
} ACTRL_ACCESS_INFOA, *PACTRL_ACCESS_INFOA; /* size: 0x0010 */

typedef enum
{
  versionIdx = 0,
  destination_type_groupIdx = 1,
  message_handleIdx = 2,
  message_typeIdx = 3,
  message_flagsIdx = 4,
  sequence_numberIdx = 5,
  ack_sequence_numberIdx = 6,
  message_countIdx = 7,
  destination_idIdx = 8,
  stream_idIdx = 9,
  LastField = 10,
} TAG_UNNAMED_110, *PTAG_UNNAMED_110;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 4,
  NVld = 0,
  VldEddOffset = 3,
  BufSize = 16,
} TAG_UNNAMED_111, *PTAG_UNNAMED_111;

typedef enum
{
  PageSize = 8192,
  BlockSize = 64,
  TotalBlocksPerPage = 128,
  PhantomsPerPage = 1,
  RealBlocksPerPage = 127,
} TAG_UNNAMED_112, *PTAG_UNNAMED_112;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 5,
  NVld = 0,
  VldEddOffset = 4,
  BufSize = 11,
} TAG_UNNAMED_113, *PTAG_UNNAMED_113;

typedef struct _tagStartParam
{
  /* 0x0000 */ struct _GUID iid;
  /* 0x0010 */ struct IBindCtx* pIBindCtx;
  /* 0x0018 */ struct IUnknown* pItf;
} tagStartParam, *PtagStartParam; /* size: 0x0020 */

typedef enum
{
  ClassId = 0x151800,
  IsTemplate = 0,
  SerializableVirtual = 0,
} TAG_UNNAMED_114, *PTAG_UNNAMED_114;

struct tagNEWTEXTMETRICA
{
  /* 0x0000 */ long tmHeight;
  /* 0x0004 */ long tmAscent;
  /* 0x0008 */ long tmDescent;
  /* 0x000c */ long tmInternalLeading;
  /* 0x0010 */ long tmExternalLeading;
  /* 0x0014 */ long tmAveCharWidth;
  /* 0x0018 */ long tmMaxCharWidth;
  /* 0x001c */ long tmWeight;
  /* 0x0020 */ long tmOverhang;
  /* 0x0024 */ long tmDigitizedAspectX;
  /* 0x0028 */ long tmDigitizedAspectY;
  /* 0x002c */ unsigned char tmFirstChar;
  /* 0x002d */ unsigned char tmLastChar;
  /* 0x002e */ unsigned char tmDefaultChar;
  /* 0x002f */ unsigned char tmBreakChar;
  /* 0x0030 */ unsigned char tmItalic;
  /* 0x0031 */ unsigned char tmUnderlined;
  /* 0x0032 */ unsigned char tmStruckOut;
  /* 0x0033 */ unsigned char tmPitchAndFamily;
  /* 0x0034 */ unsigned char tmCharSet;
  /* 0x0035 */ char Padding_63[3];
  /* 0x0038 */ unsigned long ntmFlags;
  /* 0x003c */ unsigned int ntmSizeEM;
  /* 0x0040 */ unsigned int ntmCellHeight;
  /* 0x0044 */ unsigned int ntmAvgWidth;
}; /* size: 0x0048 */

struct tagFONTSIGNATURE
{
  /* 0x0000 */ unsigned long fsUsb[4];
  /* 0x0010 */ unsigned long fsCsb[2];
}; /* size: 0x0018 */

struct tagNEWTEXTMETRICEXA
{
  /* 0x0000 */ struct tagNEWTEXTMETRICA ntmTm;
  /* 0x0048 */ struct tagFONTSIGNATURE ntmFontSig;
}; /* size: 0x0060 */

typedef enum
{
  cma_addressIdx = 0,
  LastField = 1,
} TAG_UNNAMED_115, *PTAG_UNNAMED_115;

enum tag_WMI_OBJ_TEXT
{
  WMI_OBJ_TEXT_CIM_DTD_2_0 = 1,
  WMI_OBJ_TEXT_WMI_DTD_2_0 = 2,
  WMI_OBJ_TEXT_WMI_EXT1 = 3,
  WMI_OBJ_TEXT_WMI_EXT2 = 4,
  WMI_OBJ_TEXT_WMI_EXT3 = 5,
  WMI_OBJ_TEXT_WMI_EXT4 = 6,
  WMI_OBJ_TEXT_WMI_EXT5 = 7,
  WMI_OBJ_TEXT_WMI_EXT6 = 8,
  WMI_OBJ_TEXT_WMI_EXT7 = 9,
  WMI_OBJ_TEXT_WMI_EXT8 = 10,
  WMI_OBJ_TEXT_WMI_EXT9 = 11,
  WMI_OBJ_TEXT_WMI_EXT10 = 12,
  WMI_OBJ_TEXT_LAST = 13,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 17,
  NVld = 0,
  VldEddOffset = 16,
  BufSize = 132,
} TAG_UNNAMED_116, *PTAG_UNNAMED_116;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 1,
  VldEddOffset = 1,
  BufSize = 18,
} TAG_UNNAMED_117, *PTAG_UNNAMED_117;

typedef enum
{
  generation_idIdx = 0,
  sequence_idIdx = 1,
  progressIdx = 2,
  LastField = 3,
} TAG_UNNAMED_118, *PTAG_UNNAMED_118;

struct XcbSLock
{
}; /* size: 0x0004 */

typedef enum _SC_STATUS_TYPE
{
  SC_STATUS_PROCESS_INFO = 0,
} SC_STATUS_TYPE, *PSC_STATUS_TYPE;

enum tagQACONTAINERFLAGS
{
  QACONTAINER_SHOWHATCHING = 1,
  QACONTAINER_SHOWGRABHANDLES = 2,
  QACONTAINER_USERMODE = 4,
  QACONTAINER_DISPLAYASDEFAULT = 8,
  QACONTAINER_UIDEAD = 16,
  QACONTAINER_AUTOCLIP = 32,
  QACONTAINER_MESSAGEREFLECT = 64,
  QACONTAINER_SUPPORTSMNEMONICS = 128,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 8,
  NVld = 1,
  VldEddOffset = 6,
  BufSize = 33,
} TAG_UNNAMED_119, *PTAG_UNNAMED_119;

typedef enum
{
  NStatic = 4,
  NCustomizable = 2,
  NDynamic = 10,
  NVld = 2,
  VldEddOffset = 7,
  BufSize = 60,
} TAG_UNNAMED_120, *PTAG_UNNAMED_120;

typedef enum _CM_SERVICE_NODE_TYPE
{
  DriverType = 1,
  FileSystemType = 2,
  Win32ServiceOwnProcess = 16,
  Win32ServiceShareProcess = 32,
  AdapterType = 4,
  RecognizerType = 8,
} CM_SERVICE_NODE_TYPE, *PCM_SERVICE_NODE_TYPE;

typedef struct _heapinfo
{
  /* 0x0000 */ int* _pentry;
  /* 0x0008 */ unsigned __int64 _size;
  /* 0x0010 */ int _useflag;
  /* 0x0014 */ long __PADDING__[1];
} heapinfo, *Pheapinfo; /* size: 0x0018 */

typedef enum
{
  timestampIdx = 0,
  range_generatorIdx = 1,
  node_idIdx = 2,
  total_pages_readIdx = 3,
  total_pages_processedIdx = 4,
  total_ranges_processedIdx = 5,
  total_ranges_generated_for_localIdx = 6,
  total_ranges_generated_for_remoteIdx = 7,
  total_ranges_local_rebalanced_to_thisIdx = 8,
  total_ranges_remote_rebalanced_to_thisIdx = 9,
  total_pages_local_rebalanced_to_thisIdx = 10,
  total_pages_remote_rebalanced_to_thisIdx = 11,
  total_ranges_local_rebalanced_from_thisIdx = 12,
  total_ranges_remote_rebalanced_from_thisIdx = 13,
  total_pages_local_rebalanced_from_thisIdx = 14,
  total_pages_remote_rebalanced_from_thisIdx = 15,
  total_time_msIdx = 16,
  LastField = 17,
} TAG_UNNAMED_121, *PTAG_UNNAMED_121;

struct tagWNDCLASSEXA
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ unsigned int style;
  /* 0x0008 */ void* lpfnWndProc /* function */;
  /* 0x0010 */ int cbClsExtra;
  /* 0x0014 */ int cbWndExtra;
  /* 0x0018 */ struct HINSTANCE__* hInstance;
  /* 0x0020 */ struct HICON__* hIcon;
  /* 0x0028 */ struct HICON__* hCursor;
  /* 0x0030 */ struct HBRUSH__* hbrBackground;
  /* 0x0038 */ const char* lpszMenuName;
  /* 0x0040 */ const char* lpszClassName;
  /* 0x0048 */ struct HICON__* hIconSm;
}; /* size: 0x0050 */

struct SEReplCheckpointQueuesSLock
{
}; /* size: 0x0004 */

enum WbemAuthenticationLevelEnum
{
  wbemAuthenticationLevelDefault = 0,
  wbemAuthenticationLevelNone = 1,
  wbemAuthenticationLevelConnect = 2,
  wbemAuthenticationLevelCall = 3,
  wbemAuthenticationLevelPkt = 4,
  wbemAuthenticationLevelPktIntegrity = 5,
  wbemAuthenticationLevelPktPrivacy = 6,
};

typedef enum
{
  lob_actionIdx = 0,
  column_idIdx = 1,
  offsetIdx = 2,
  lengthIdx = 3,
  sizeIdx = 4,
  LastField = 5,
} TAG_UNNAMED_122, *PTAG_UNNAMED_122;

typedef enum
{
  brick_idIdx = 0,
  message_typeIdx = 1,
  LastField = 2,
} TAG_UNNAMED_123, *PTAG_UNNAMED_123;

typedef enum _APTTYPE
{
  APTTYPE_CURRENT = -1,
  APTTYPE_STA = 0,
  APTTYPE_MTA = 1,
  APTTYPE_NA = 2,
  APTTYPE_MAINSTA = 3,
} APTTYPE, *PAPTTYPE;

typedef enum _CM_SERVICE_LOAD_TYPE
{
  BootLoad = 0,
  SystemLoad = 1,
  AutoLoad = 2,
  DemandLoad = 3,
  DisableLoad = 4,
} CM_SERVICE_LOAD_TYPE, *PCM_SERVICE_LOAD_TYPE;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 5,
  NVld = 1,
  VldEddOffset = 3,
  BufSize = 29,
} TAG_UNNAMED_124, *PTAG_UNNAMED_124;

struct tagXFORM
{
  /* 0x0000 */ float eM11;
  /* 0x0004 */ float eM12;
  /* 0x0008 */ float eM21;
  /* 0x000c */ float eM22;
  /* 0x0010 */ float eDx;
  /* 0x0014 */ float eDy;
}; /* size: 0x0018 */

class XeSqlPkg::distribution_db_policy_change
{
  union
  {
    struct
    {
      /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
      /* 0x0004 */ long Padding_64[143];
      /* 0x0240 */ unsigned char m_buf[12];
    }; /* size: 0x0010 */
    /* 0x0000 */ const int database_idOffset;
    /* 0x0000 */ const int policy_typeOffset;
    /* 0x0000 */ const int leading_cols_numOffset;
  }; /* size: 0x0010 */
}; /* size: 0x0250 */

enum WbemChangeFlagEnum
{
  wbemChangeFlagCreateOrUpdate = 0,
  wbemChangeFlagUpdateOnly = 1,
  wbemChangeFlagCreateOnly = 2,
  wbemChangeFlagUpdateCompatible = 0,
  wbemChangeFlagUpdateSafeMode = 32,
  wbemChangeFlagUpdateForceMode = 64,
  wbemChangeFlagStrongValidation = 128,
  wbemChangeFlagAdvisory = 0x10000,
};

typedef struct _SECTION_IMAGE_INFORMATION32
{
  /* 0x0000 */ unsigned long TransferAddress;
  /* 0x0004 */ unsigned long ZeroBits;
  /* 0x0008 */ unsigned long MaximumStackSize;
  /* 0x000c */ unsigned long CommittedStackSize;
  /* 0x0010 */ unsigned long SubSystemType;
  union
  {
    struct
    {
      /* 0x0014 */ unsigned short SubSystemMinorVersion;
      /* 0x0016 */ unsigned short SubSystemMajorVersion;
    }; /* size: 0x0004 */
    /* 0x0014 */ unsigned long SubSystemVersion;
  }; /* size: 0x0004 */
  /* 0x0018 */ unsigned long GpValue;
  /* 0x001c */ unsigned short ImageCharacteristics;
  /* 0x001e */ unsigned short DllCharacteristics;
  /* 0x0020 */ unsigned short Machine;
  /* 0x0022 */ unsigned char ImageContainsCode;
  union
  {
    /* 0x0023 */ unsigned char ImageFlags;
    struct /* bitfield */
    {
      /* 0x0023 */ unsigned char ComPlus : 1; /* bit position: 0 */
      /* 0x0023 */ unsigned char ImageDynamicallyRelocated : 1; /* bit position: 1 */
      /* 0x0023 */ unsigned char Reserved : 6; /* bit position: 2 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x0024 */ unsigned long LoaderFlags;
  /* 0x0028 */ unsigned long ImageFileSize;
  /* 0x002c */ unsigned long CheckSum;
} SECTION_IMAGE_INFORMATION32, *PSECTION_IMAGE_INFORMATION32; /* size: 0x0030 */

typedef enum
{
  database_idIdx = 0,
  object_typeIdx = 1,
  object_nameIdx = 2,
  LastField = 3,
} TAG_UNNAMED_125, *PTAG_UNNAMED_125;

typedef enum _THREAD_INFORMATION_CLASS
{
  ThreadMemoryPriority = 0,
  ThreadInformationClassMax = 1,
} THREAD_INFORMATION_CLASS, *PTHREAD_INFORMATION_CLASS;

class CAutoBase<ColumnTransformRule>
{
  /* 0x0000 */ struct ColumnTransformRule* m_pt;
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 7,
  NVld = 2,
  VldEddOffset = 4,
  BufSize = 33,
} TAG_UNNAMED_126, *PTAG_UNNAMED_126;

typedef enum
{
  componentIdx = 0,
  stateIdx = 1,
  dataIdx = 2,
  LastField = 3,
} TAG_UNNAMED_127, *PTAG_UNNAMED_127;

struct TMemoryBlockAllocator<0,4194304,16777216,4,0>::NodePartitionWithActive
{
}; /* size: 0x0080 */

class PerCPUDataMulti<SOS_MemoryBlockAllocator::ActivePartition>::Reservation<TMemoryBlockAllocator<0,4194304,16777216,4,0> >
{
  /* 0x0000 */ unsigned __int64 s_reservationOffset;
}; /* size: 0x0001 */

class TMemoryBlockAllocator<0,4194304,16777216,4,0>
{
  /* 0x0000 */ class TMemoryBlockAllocator<0,4194304,16777216,4,0> sm_memoryBlockAllocator;
  /* 0x00c0 */ struct TMemoryBlockAllocator<0,4194304,16777216,4,0>::NodePartitionWithActive m_nodePart[64];
  /* 0x20c0 */ class PerCPUDataMulti<SOS_MemoryBlockAllocator::ActivePartition>::Reservation<TMemoryBlockAllocator<0,4194304,16777216,4,0> > m_reservationForActiveParts;
}; /* size: 0x2100 */

typedef enum _SID_NAME_USE
{
  SidTypeUser = 1,
  SidTypeGroup = 2,
  SidTypeDomain = 3,
  SidTypeAlias = 4,
  SidTypeWellKnownGroup = 5,
  SidTypeDeletedAccount = 6,
  SidTypeInvalid = 7,
  SidTypeUnknown = 8,
  SidTypeComputer = 9,
  SidTypeLabel = 10,
} SID_NAME_USE, *PSID_NAME_USE;

typedef struct _SHARE_INFO_1501
{
  /* 0x0000 */ unsigned long shi1501_reserved;
  /* 0x0004 */ long Padding_65;
  /* 0x0008 */ void* shi1501_security_descriptor;
} SHARE_INFO_1501, *PSHARE_INFO_1501; /* size: 0x0010 */

typedef enum
{
  lwfg_sequence_idIdx = 0,
  LastField = 1,
} TAG_UNNAMED_128, *PTAG_UNNAMED_128;

enum tag_CIMTYPE_ENUMERATION
{
  CIM_ILLEGAL = 4095,
  CIM_EMPTY = 0,
  CIM_SINT8 = 16,
  CIM_UINT8 = 17,
  CIM_SINT16 = 2,
  CIM_UINT16 = 18,
  CIM_SINT32 = 3,
  CIM_UINT32 = 19,
  CIM_SINT64 = 20,
  CIM_UINT64 = 21,
  CIM_REAL32 = 4,
  CIM_REAL64 = 5,
  CIM_BOOLEAN = 11,
  CIM_STRING = 8,
  CIM_DATETIME = 101,
  CIM_REFERENCE = 102,
  CIM_CHAR16 = 103,
  CIM_OBJECT = 13,
  CIM_FLAG_ARRAY = 8192,
};

struct IInternetThreadSwitch
{
}; /* size: 0x0008 */

struct ITransaction2
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 1,
  NVld = 0,
  VldEddOffset = 0,
  BufSize = 8,
} TAG_UNNAMED_129, *PTAG_UNNAMED_129;

typedef enum
{
  NStatic = 4,
  NCustomizable = 2,
  NDynamic = 10,
  NVld = 2,
  VldEddOffset = 7,
  BufSize = 41,
} TAG_UNNAMED_130, *PTAG_UNNAMED_130;

struct IExternalConnection
{
}; /* size: 0x0008 */

enum tagFUNCFLAGS
{
  FUNCFLAG_FRESTRICTED = 1,
  FUNCFLAG_FSOURCE = 2,
  FUNCFLAG_FBINDABLE = 4,
  FUNCFLAG_FREQUESTEDIT = 8,
  FUNCFLAG_FDISPLAYBIND = 16,
  FUNCFLAG_FDEFAULTBIND = 32,
  FUNCFLAG_FHIDDEN = 64,
  FUNCFLAG_FUSESGETLASTERROR = 128,
  FUNCFLAG_FDEFAULTCOLLELEM = 256,
  FUNCFLAG_FUIDEFAULT = 512,
  FUNCFLAG_FNONBROWSABLE = 1024,
  FUNCFLAG_FREPLACEABLE = 2048,
  FUNCFLAG_FIMMEDIATEBIND = 4096,
};

typedef enum
{
  ElementOffset = 8,
  NextPtrOffset = 8,
  AnchorOffset = 8,
} TAG_UNNAMED_131, *PTAG_UNNAMED_131;

typedef struct __vc_attributes::importAttribute
{
  /* 0x0000 */ const char* idl_file;
} _vc_attributes::importAttribute, *P_vc_attributes::importAttribute; /* size: 0x0008 */

struct std::pair<XEPackage0::BucketizingTarget::Entry * *,XEPackage0::BucketizingTarget::Entry * *>
{
}; /* size: 0x0010 */

enum tagOLEMISC
{
  OLEMISC_RECOMPOSEONRESIZE = 1,
  OLEMISC_ONLYICONIC = 2,
  OLEMISC_INSERTNOTREPLACE = 4,
  OLEMISC_STATIC = 8,
  OLEMISC_CANTLINKINSIDE = 16,
  OLEMISC_CANLINKBYOLE1 = 32,
  OLEMISC_ISLINKOBJECT = 64,
  OLEMISC_INSIDEOUT = 128,
  OLEMISC_ACTIVATEWHENVISIBLE = 256,
  OLEMISC_RENDERINGISDEVICEINDEPENDENT = 512,
  OLEMISC_INVISIBLEATRUNTIME = 1024,
  OLEMISC_ALWAYSRUN = 2048,
  OLEMISC_ACTSLIKEBUTTON = 4096,
  OLEMISC_ACTSLIKELABEL = 8192,
  OLEMISC_NOUIACTIVATE = 16384,
  OLEMISC_ALIGNABLE = 0xffff8000,
  OLEMISC_SIMPLEFRAME = 0x10000,
  OLEMISC_SETCLIENTSITEFIRST = 0x20000,
  OLEMISC_IMEMODE = 0x40000,
  OLEMISC_IGNOREACTIVATEWHENVISIBLE = 0x80000,
  OLEMISC_WANTSTOMENUMERGE = 0x100000,
  OLEMISC_SUPPORTSMULTILEVELUNDO = 0x200000,
};

enum tag_WBEM_COMPILER_OPTIONS
{
  WBEM_FLAG_CHECK_ONLY = 1,
  WBEM_FLAG_AUTORECOVER = 2,
  WBEM_FLAG_WMI_CHECK = 4,
  WBEM_FLAG_CONSOLE_PRINT = 8,
  WBEM_FLAG_DONT_ADD_TO_LIST = 16,
  WBEM_FLAG_SPLIT_FILES = 32,
  WBEM_FLAG_STORE_FILE = 256,
};

typedef enum
{
  asb_idIdx = 0,
  database_idIdx = 1,
  initiator_flagIdx = 2,
  unique_idIdx = 3,
  timerIdx = 4,
  dialog_idIdx = 5,
  LastField = 6,
} TAG_UNNAMED_132, *PTAG_UNNAMED_132;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 0,
  NVld = 0,
  VldEddOffset = -1,
  BufSize = 0,
} TAG_UNNAMED_133, *PTAG_UNNAMED_133;

typedef enum
{
  NStatic = 4,
  NCustomizable = 1,
  NDynamic = 6,
  NVld = 2,
  VldEddOffset = 3,
  BufSize = 27,
} TAG_UNNAMED_134, *PTAG_UNNAMED_134;

enum URL_PART
{
  URL_PART_NONE = 0,
  URL_PART_SCHEME = 1,
  URL_PART_HOSTNAME = 2,
  URL_PART_USERNAME = 3,
  URL_PART_PASSWORD = 4,
  URL_PART_PORT = 5,
  URL_PART_QUERY = 6,
};

struct tagRemHENHMETAFILE
{
  /* 0x0000 */ unsigned long cbData;
  /* 0x0004 */ unsigned char data[1];
  /* 0x0005 */ char __PADDING__[3];
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 5,
  NVld = 1,
  VldEddOffset = 3,
  BufSize = 32,
} TAG_UNNAMED_135, *PTAG_UNNAMED_135;

enum tagGLOBALOPT_EH_VALUES
{
  COMGLB_EXCEPTION_HANDLE = 0,
  COMGLB_EXCEPTION_DONOT_HANDLE_FATAL = 1,
  COMGLB_EXCEPTION_DONOT_HANDLE = 1,
  COMGLB_EXCEPTION_DONOT_HANDLE_ANY = 2,
};

typedef enum
{
  database_idIdx = 0,
  database_segment_idIdx = 1,
  brick_idIdx = 2,
  LastField = 3,
} TAG_UNNAMED_136, *PTAG_UNNAMED_136;

typedef enum
{
  federated_xact_idIdx = 0,
  federated_xact_node_idIdx = 1,
  federated_xact_node_local_idIdx = 2,
  is_committedIdx = 3,
  age_valueIdx = 4,
  LastField = 5,
} TAG_UNNAMED_137, *PTAG_UNNAMED_137;

typedef struct __vc_attributes::bindableAttribute
{
} _vc_attributes::bindableAttribute, *P_vc_attributes::bindableAttribute; /* size: 0x0001 */

typedef enum
{
  pmo_addressIdx = 0,
  pmo_utilizationIdx = 1,
  vertex_pool_sizeIdx = 2,
  edge_pool_sizeIdx = 3,
  LastField = 4,
} TAG_UNNAMED_138, *PTAG_UNNAMED_138;

enum ASSERTLEVEL
{
  ASSERTLEVEL_UNKNOWN = -1,
  ASSERTLEVEL_MINIMAL = 0,
  ASSERTLEVEL_DEFAULT = 1,
  ASSERTLEVEL_HIGH = 2,
  ASSERTLEVEL_TEST = 3,
};

enum tagSHCOLSTATE
{
  SHCOLSTATE_DEFAULT = 0,
  SHCOLSTATE_TYPE_STR = 1,
  SHCOLSTATE_TYPE_INT = 2,
  SHCOLSTATE_TYPE_DATE = 3,
  SHCOLSTATE_TYPEMASK = 15,
  SHCOLSTATE_ONBYDEFAULT = 16,
  SHCOLSTATE_SLOW = 32,
  SHCOLSTATE_EXTENDED = 64,
  SHCOLSTATE_SECONDARYUI = 128,
  SHCOLSTATE_HIDDEN = 256,
  SHCOLSTATE_PREFER_VARCMP = 512,
  SHCOLSTATE_PREFER_FMTCMP = 1024,
  SHCOLSTATE_NOSORTBYFOLDERNESS = 2048,
  SHCOLSTATE_VIEWONLY = 0x10000,
  SHCOLSTATE_BATCHREAD = 0x20000,
  SHCOLSTATE_NO_GROUPBY = 0x40000,
  SHCOLSTATE_FIXED_WIDTH = 4096,
  SHCOLSTATE_NODPISCALE = 8192,
  SHCOLSTATE_FIXED_RATIO = 16384,
  SHCOLSTATE_DISPLAYMASK = 0xfffff000,
};

struct IRecordInfo
{
}; /* size: 0x0008 */

typedef enum
{
  recompile_causeIdx = 0,
  source_database_idIdx = 1,
  object_idIdx = 2,
  object_typeIdx = 3,
  nest_levelIdx = 4,
  line_numberIdx = 5,
  offsetIdx = 6,
  offset_endIdx = 7,
  object_nameIdx = 8,
  statementIdx = 9,
  LastField = 10,
} TAG_UNNAMED_139, *PTAG_UNNAMED_139;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 0,
  VldEddOffset = 2,
  BufSize = 9,
} TAG_UNNAMED_140, *PTAG_UNNAMED_140;

struct IRpcChannelBuffer3
{
}; /* size: 0x0008 */

enum tag_WBEM_UNSECAPP_FLAG_TYPE
{
  WBEM_FLAG_UNSECAPP_DEFAULT_CHECK_ACCESS = 0,
  WBEM_FLAG_UNSECAPP_CHECK_ACCESS = 1,
  WBEM_FLAG_UNSECAPP_DONT_CHECK_ACCESS = 2,
};

struct tagSIZE
{
  /* 0x0000 */ long cx;
  /* 0x0004 */ long cy;
}; /* size: 0x0008 */

struct tagEMRFRAMERGN
{
  /* 0x0000 */ struct tagEMR emr;
  /* 0x0008 */ struct _RECTL rclBounds;
  /* 0x0018 */ unsigned long cbRgnData;
  /* 0x001c */ unsigned long ihBrush;
  /* 0x0020 */ struct tagSIZE szlStroke;
  /* 0x0028 */ unsigned char RgnData[1];
  /* 0x0029 */ char __PADDING__[3];
}; /* size: 0x002c */

enum tagXMLEMEM_TYPE
{
  XMLELEMTYPE_ELEMENT = 0,
  XMLELEMTYPE_TEXT = 1,
  XMLELEMTYPE_COMMENT = 2,
  XMLELEMTYPE_DOCUMENT = 3,
  XMLELEMTYPE_DTD = 4,
  XMLELEMTYPE_PI = 5,
  XMLELEMTYPE_OTHER = 6,
};

typedef struct _EISA_IRQ_DESCRIPTOR
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char Interrupt : 4; /* bit position: 0 */
    /* 0x0000 */ unsigned char Reserved : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char LevelTriggered : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char Shared : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char MoreEntries : 1; /* bit position: 7 */
  }; /* bitfield */
} EISA_IRQ_DESCRIPTOR, *PEISA_IRQ_DESCRIPTOR; /* size: 0x0001 */

typedef enum
{
  accessorIdx = 0,
  accessor_bindingsIdx = 1,
  accessor_buffer_sizeIdx = 2,
  use_local_rowsetIdx = 3,
  LastField = 4,
} TAG_UNNAMED_141, *PTAG_UNNAMED_141;

enum tagDVASPECT2
{
  DVASPECT_OPAQUE = 16,
  DVASPECT_TRANSPARENT = 32,
};

typedef enum
{
  preconnect_typeIdx = 0,
  database_idIdx = 1,
  object_idIdx = 2,
  object_typeIdx = 3,
  object_nameIdx = 4,
  database_nameIdx = 5,
  LastField = 6,
} TAG_UNNAMED_142, *PTAG_UNNAMED_142;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 0,
  NVld = 0,
  VldEddOffset = -1,
  BufSize = 0,
} TAG_UNNAMED_143, *PTAG_UNNAMED_143;

struct IPropertyNotifySink
{
}; /* size: 0x0008 */

enum tag_WBEM_GENERIC_FLAG_TYPE
{
  WBEM_FLAG_RETURN_IMMEDIATELY = 16,
  WBEM_FLAG_RETURN_WBEM_COMPLETE = 0,
  WBEM_FLAG_BIDIRECTIONAL = 0,
  WBEM_FLAG_FORWARD_ONLY = 32,
  WBEM_FLAG_NO_ERROR_OBJECT = 64,
  WBEM_FLAG_RETURN_ERROR_OBJECT = 0,
  WBEM_FLAG_SEND_STATUS = 128,
  WBEM_FLAG_DONT_SEND_STATUS = 0,
  WBEM_FLAG_ENSURE_LOCATABLE = 256,
  WBEM_FLAG_DIRECT_READ = 512,
  WBEM_FLAG_SEND_ONLY_SELECTED = 0,
  WBEM_RETURN_WHEN_COMPLETE = 0,
  WBEM_RETURN_IMMEDIATELY = 16,
  WBEM_MASK_RESERVED_FLAGS = 0x1f000,
  WBEM_FLAG_USE_AMENDED_QUALIFIERS = 0x20000,
  WBEM_FLAG_STRONG_VALIDATION = 0x100000,
};

struct tagMULTIKEYHELPW
{
  /* 0x0000 */ unsigned long mkSize;
  /* 0x0004 */ wchar_t mkKeylist;
  /* 0x0006 */ wchar_t szKeyphrase[1];
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 1,
  NDynamic = 7,
  NVld = 1,
  VldEddOffset = 5,
  BufSize = 44,
} TAG_UNNAMED_144, *PTAG_UNNAMED_144;

typedef struct __vc_attributes::vi_progidAttribute
{
  /* 0x0000 */ const char* value;
} _vc_attributes::vi_progidAttribute, *P_vc_attributes::vi_progidAttribute; /* size: 0x0008 */

class SEList<SOS_ParentBlockDescriptor,0>
{
  /* 0x0000 */ class ListBase m_list;
}; /* size: 0x0010 */

typedef enum _tagPI_FLAGS
{
  PI_PARSE_URL = 1,
  PI_FILTER_MODE = 2,
  PI_FORCE_ASYNC = 4,
  PI_USE_WORKERTHREAD = 8,
  PI_MIMEVERIFICATION = 16,
  PI_CLSIDLOOKUP = 32,
  PI_DATAPROGRESS = 64,
  PI_SYNCHRONOUS = 128,
  PI_APARTMENTTHREADED = 256,
  PI_CLASSINSTALL = 512,
  PI_PASSONBINDCTX = 8192,
  PI_NOMIMEHANDLER = 0xffff8000,
  PI_LOADAPPDIRECT = 16384,
  PD_FORCE_SWITCH = 0x10000,
  PI_PREFERDEFAULTHANDLER = 0x20000,
} tagPI_FLAGS, *PtagPI_FLAGS;

enum IMPORT_OBJECT_NAME_TYPE
{
  IMPORT_OBJECT_ORDINAL = 0,
  IMPORT_OBJECT_NAME = 1,
  IMPORT_OBJECT_NAME_NO_PREFIX = 2,
  IMPORT_OBJECT_NAME_UNDECORATE = 3,
};

class CAutoBase<ActionTransformRule>
{
  /* 0x0000 */ struct ActionTransformRule* m_pt;
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 10,
  NVld = 5,
  VldEddOffset = 4,
  BufSize = 58,
} TAG_UNNAMED_145, *PTAG_UNNAMED_145;

struct POWER_ACTION_POLICY
{
  /* 0x0000 */ enum POWER_ACTION Action;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long EventCode;
}; /* size: 0x000c */

struct SYSTEM_POWER_LEVEL
{
  /* 0x0000 */ unsigned char Enable;
  /* 0x0001 */ unsigned char Spare[3];
  /* 0x0004 */ unsigned long BatteryLevel;
  /* 0x0008 */ struct POWER_ACTION_POLICY PowerPolicy;
  /* 0x0014 */ enum _SYSTEM_POWER_STATE MinSystemState;
}; /* size: 0x0018 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 2,
  NVld = 0,
  VldEddOffset = 1,
  BufSize = 12,
} TAG_UNNAMED_146, *PTAG_UNNAMED_146;

typedef enum
{
  NStatic = 4,
  NCustomizable = 1,
  NDynamic = 3,
  NVld = 1,
  VldEddOffset = 1,
  BufSize = 16,
} TAG_UNNAMED_147, *PTAG_UNNAMED_147;

class XeSqlPkg::filegroup_name_change
{
  union
  {
    struct
    {
      /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
      /* 0x0004 */ long Padding_66[143];
      /* 0x0240 */ unsigned char m_buf[20];
    }; /* size: 0x0018 */
    /* 0x0000 */ const int database_idOffset;
    /* 0x0000 */ const int database_segment_idOffset;
    /* 0x0000 */ const int filegroup_idOffset;
    /* 0x0000 */ const int new_nameOffset;
  }; /* size: 0x0018 */
}; /* size: 0x0258 */

enum XLAT_SIDE
{
  XLAT_SERVER = 1,
  XLAT_CLIENT = 2,
};

typedef enum
{
  stateIdx = 0,
  durationIdx = 1,
  is_safe_recopyIdx = 2,
  remote_versionIdx = 3,
  remote_portIdx = 4,
  hint_stream_idIdx = 5,
  remote_clusterIdx = 6,
  remote_serverIdx = 7,
  remote_databaseIdx = 8,
  remote_app_nameIdx = 9,
  remote_table_groupIdx = 10,
  remote_low_keyIdx = 11,
  remote_high_keyIdx = 12,
  LastField = 13,
} TAG_UNNAMED_148, *PTAG_UNNAMED_148;

enum std::_Iosb<int>::_Fmtflags
{
  _Fmtmask = 0xffffffff,
  _Fmtzero = 0,
};

enum std::_Iosb<int>::_Iostate
{
  _Statmask = 23,
};

enum std::_Iosb<int>::_Openmode
{
  _Openmask = 255,
};

enum std::_Iosb<int>::_Seekdir
{
  _Seekmask = 3,
};

class std::_Iosb<int>
{
  union
  {
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags skipws;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags unitbuf;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags uppercase;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags showbase;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags showpoint;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags showpos;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags left;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags right;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags internal;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags dec;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags oct;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags hex;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags scientific;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags fixed;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags hexfloat;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags boolalpha;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags _Stdio;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags adjustfield;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags basefield;
    /* 0x0000 */ enum std::_Iosb<int>::_Fmtflags floatfield;
    /* 0x0000 */ enum std::_Iosb<int>::_Iostate goodbit;
    /* 0x0000 */ enum std::_Iosb<int>::_Iostate eofbit;
    /* 0x0000 */ enum std::_Iosb<int>::_Iostate failbit;
    /* 0x0000 */ enum std::_Iosb<int>::_Iostate badbit;
    /* 0x0000 */ enum std::_Iosb<int>::_Iostate _Hardfail;
    /* 0x0000 */ enum std::_Iosb<int>::_Openmode in;
    /* 0x0000 */ enum std::_Iosb<int>::_Openmode out;
    /* 0x0000 */ enum std::_Iosb<int>::_Openmode ate;
    /* 0x0000 */ enum std::_Iosb<int>::_Openmode app;
    /* 0x0000 */ enum std::_Iosb<int>::_Openmode trunc;
    /* 0x0000 */ enum std::_Iosb<int>::_Openmode _Nocreate;
    /* 0x0000 */ enum std::_Iosb<int>::_Openmode _Noreplace;
    /* 0x0000 */ enum std::_Iosb<int>::_Openmode binary;
    /* 0x0000 */ enum std::_Iosb<int>::_Seekdir beg;
    /* 0x0000 */ enum std::_Iosb<int>::_Seekdir cur;
    /* 0x0000 */ enum std::_Iosb<int>::_Seekdir end;
  }; /* size: 0x0004 */
}; /* size: 0x0001 */

typedef enum
{
  database_idIdx = 0,
  table_idIdx = 1,
  lock_modeIdx = 2,
  timeoutIdx = 3,
  lock_policyIdx = 4,
  request_sourceIdx = 5,
  error_numberIdx = 6,
  severityIdx = 7,
  stateIdx = 8,
  LastField = 9,
} TAG_UNNAMED_149, *PTAG_UNNAMED_149;

struct XEStorageId
{
  /* 0x0000 */ struct XERelativeObjectId m_rid;
  /* 0x0004 */ unsigned int m_instanceId;
}; /* size: 0x0008 */

typedef enum
{
  MaxPresenceCacheId = 7,
} TAG_UNNAMED_150, *PTAG_UNNAMED_150;

typedef struct _UNLOAD_DLL_DEBUG_INFO
{
  /* 0x0000 */ void* lpBaseOfDll;
} UNLOAD_DLL_DEBUG_INFO, *PUNLOAD_DLL_DEBUG_INFO; /* size: 0x0008 */

typedef enum
{
  generation_idIdx = 0,
  sequence_idIdx = 1,
  map_entry_countIdx = 2,
  encoded_dataIdx = 3,
  LastField = 4,
} TAG_UNNAMED_151, *PTAG_UNNAMED_151;

typedef struct _IMAGE_FUNCTION_ENTRY
{
  /* 0x0000 */ unsigned long StartingAddress;
  /* 0x0004 */ unsigned long EndingAddress;
  /* 0x0008 */ unsigned long EndOfPrologue;
} IMAGE_FUNCTION_ENTRY, *PIMAGE_FUNCTION_ENTRY; /* size: 0x000c */

enum XEHandleType
{
  XEH_PACKAGE = 0,
  XEH_SESSION = 1,
  XEH_TARGET = 2,
  XEH_PREDICATE = 3,
  XEH_PACKAGES_HOLDER = 4,
  XEH_EVENT = 5,
  XEH_LAST = 6,
  XEH_MASK = 7,
  XEH_ALIGN = 8,
};

typedef struct _SMALL_RECT
{
  /* 0x0000 */ short Left;
  /* 0x0002 */ short Top;
  /* 0x0004 */ short Right;
  /* 0x0006 */ short Bottom;
} SMALL_RECT, *PSMALL_RECT; /* size: 0x0008 */

typedef enum
{
  database_idIdx = 0,
  flushed_logIdx = 1,
  end_of_logIdx = 2,
  log_truncation_blockIdx = 3,
  hadr_truncation_blockIdx = 4,
  recovery_pointIdx = 5,
  undo_scanIdx = 6,
  undo_safe_blockIdx = 7,
  undo_pageidIdx = 8,
  undo_phaseIdx = 9,
  group_idIdx = 10,
  replica_idIdx = 11,
  ag_database_idIdx = 12,
  LastField = 13,
} TAG_UNNAMED_152, *PTAG_UNNAMED_152;

typedef struct __vc_attributes::helpstringdllAttribute
{
  /* 0x0000 */ const char* dllname;
} _vc_attributes::helpstringdllAttribute, *P_vc_attributes::helpstringdllAttribute; /* size: 0x0008 */

class Spinlock<333,0,1>
{
}; /* size: 0x0004 */

class CXFileReaderInterfaceFactory
{
}; /* size: 0x0008 */

enum SchedulerManager::SCHEDTYPE
{
  SCHED_NORMAL = 0,
  SCHED_HIDDEN = 1,
};

class BaseSafeCallbackTraits<TBaseSafeCallbackWithParam<void,TListSLock,SOSCallbackEvent,void *,SystemAffinity,SystemAffinity,NullType>,TListSLock,SOSCallbackEvent>::List
{
}; /* size: 0x0030 */

typedef struct _SYSTEMTIME
{
  /* 0x0000 */ unsigned short wYear;
  /* 0x0002 */ unsigned short wMonth;
  /* 0x0004 */ unsigned short wDayOfWeek;
  /* 0x0006 */ unsigned short wDay;
  /* 0x0008 */ unsigned short wHour;
  /* 0x000a */ unsigned short wMinute;
  /* 0x000c */ unsigned short wSecond;
  /* 0x000e */ unsigned short wMilliseconds;
} SYSTEMTIME, *PSYSTEMTIME; /* size: 0x0010 */

typedef struct _TIME_ZONE_INFORMATION
{
  /* 0x0000 */ long Bias;
  /* 0x0004 */ wchar_t StandardName[32];
  /* 0x0044 */ struct _SYSTEMTIME StandardDate;
  /* 0x0054 */ long StandardBias;
  /* 0x0058 */ wchar_t DaylightName[32];
  /* 0x0098 */ struct _SYSTEMTIME DaylightDate;
  /* 0x00a8 */ long DaylightBias;
} TIME_ZONE_INFORMATION, *PTIME_ZONE_INFORMATION; /* size: 0x00ac */

typedef struct _TRACE_LOGFILE_HEADER
{
  /* 0x0000 */ unsigned long BufferSize;
  union
  {
    /* 0x0004 */ unsigned long Version;
    struct
    {
      /* 0x0004 */ unsigned char MajorVersion;
      /* 0x0005 */ unsigned char MinorVersion;
      /* 0x0006 */ unsigned char SubVersion;
      /* 0x0007 */ unsigned char SubMinorVersion;
    } /* size: 0x0004 */ VersionDetail;
  }; /* size: 0x0004 */
  /* 0x0008 */ unsigned long ProviderVersion;
  /* 0x000c */ unsigned long NumberOfProcessors;
  /* 0x0010 */ union _LARGE_INTEGER EndTime;
  /* 0x0018 */ unsigned long TimerResolution;
  /* 0x001c */ unsigned long MaximumFileSize;
  /* 0x0020 */ unsigned long LogFileMode;
  /* 0x0024 */ unsigned long BuffersWritten;
  union
  {
    /* 0x0028 */ struct _GUID LogInstanceGuid;
    struct
    {
      /* 0x0028 */ unsigned long StartBuffers;
      /* 0x002c */ unsigned long PointerSize;
      /* 0x0030 */ unsigned long EventsLost;
      /* 0x0034 */ unsigned long CpuSpeedInMHz;
    }; /* size: 0x0010 */
  }; /* size: 0x0010 */
  /* 0x0038 */ wchar_t* LoggerName;
  /* 0x0040 */ wchar_t* LogFileName;
  /* 0x0048 */ struct _TIME_ZONE_INFORMATION TimeZone;
  /* 0x00f4 */ long Padding_67;
  /* 0x00f8 */ union _LARGE_INTEGER BootTime;
  /* 0x0100 */ union _LARGE_INTEGER PerfFreq;
  /* 0x0108 */ union _LARGE_INTEGER StartTime;
  /* 0x0110 */ unsigned long ReservedFlags;
  /* 0x0114 */ unsigned long BuffersLost;
} TRACE_LOGFILE_HEADER, *PTRACE_LOGFILE_HEADER; /* size: 0x0118 */

typedef enum
{
  VersionEventBufferHeader = 0,
} TAG_UNNAMED_153, *PTAG_UNNAMED_153;

typedef enum _TRANSACTIONMANAGER_INFORMATION_CLASS
{
  TransactionManagerBasicInformation = 0,
  TransactionManagerLogInformation = 1,
  TransactionManagerLogPathInformation = 2,
  TransactionManagerRecoveryInformation = 4,
  TransactionManagerOnlineProbeInformation = 3,
  TransactionManagerOldestTransactionInformation = 5,
} TRANSACTIONMANAGER_INFORMATION_CLASS, *PTRANSACTIONMANAGER_INFORMATION_CLASS;

struct IOleContainer
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 7,
  NVld = 1,
  VldEddOffset = 5,
  BufSize = 32,
} TAG_UNNAMED_154, *PTAG_UNNAMED_154;

typedef enum __MIDL_IBindStatusCallback_0003
{
  BINDF_ASYNCHRONOUS = 1,
  BINDF_ASYNCSTORAGE = 2,
  BINDF_NOPROGRESSIVERENDERING = 4,
  BINDF_OFFLINEOPERATION = 8,
  BINDF_GETNEWESTVERSION = 16,
  BINDF_NOWRITECACHE = 32,
  BINDF_NEEDFILE = 64,
  BINDF_PULLDATA = 128,
  BINDF_IGNORESECURITYPROBLEM = 256,
  BINDF_RESYNCHRONIZE = 512,
  BINDF_HYPERLINK = 1024,
  BINDF_NO_UI = 2048,
  BINDF_SILENTOPERATION = 4096,
  BINDF_PRAGMA_NO_CACHE = 8192,
  BINDF_GETCLASSOBJECT = 16384,
  BINDF_RESERVED_1 = 0xffff8000,
  BINDF_FREE_THREADED = 0x10000,
  BINDF_DIRECT_READ = 0x20000,
  BINDF_FORMS_SUBMIT = 0x40000,
  BINDF_GETFROMCACHE_IF_NET_FAIL = 0x80000,
  BINDF_FROMURLMON = 0x100000,
  BINDF_FWD_BACK = 0x200000,
  BINDF_PREFERDEFAULTHANDLER = 0x400000,
  BINDF_ENFORCERESTRICTED = 0x800000,
} _MIDL_IBindStatusCallback_0003, *P_MIDL_IBindStatusCallback_0003;

struct tagEXTLOGPEN32
{
  /* 0x0000 */ unsigned long elpPenStyle;
  /* 0x0004 */ unsigned long elpWidth;
  /* 0x0008 */ unsigned int elpBrushStyle;
  /* 0x000c */ unsigned long elpColor;
  /* 0x0010 */ unsigned long elpHatch;
  /* 0x0014 */ unsigned long elpNumEntries;
  /* 0x0018 */ unsigned long elpStyleEntry[1];
}; /* size: 0x001c */

typedef enum __enative_startup_state
{
  __uninitialized = 0,
  __initializing = 1,
  __initialized = 2,
} _enative_startup_state, *P_enative_startup_state;

typedef enum
{
  count_cyclesIdx = 0,
  checkpointIdx = 1,
  pmo_markIdx = 2,
  pmo_pages_allocIdx = 3,
  ringbuffer_pmo_pages_allocIdx = 4,
  xml_deadlock_report_pmo_pages_allocIdx = 5,
  LastField = 6,
} TAG_UNNAMED_155, *PTAG_UNNAMED_155;

typedef enum
{
  message_typeIdx = 0,
  message_sub_typeIdx = 1,
  message_log_idIdx = 2,
  LastField = 3,
} TAG_UNNAMED_156, *PTAG_UNNAMED_156;

enum tagCOWAIT_FLAGS
{
  COWAIT_WAITALL = 1,
  COWAIT_ALERTABLE = 2,
  COWAIT_INPUTAVAILABLE = 4,
  COWAIT_DISPATCH_CALLS = 8,
  COWAIT_DISPATCH_WINDOW_MESSAGES = 16,
  REAL_COWAIT_ENABLECALLREENTRANCY = 8,
  COWAIT_ENABLEWINDOWMESSAGES = 16,
  COWAIT_ENABLECALLREENTRANCY = 24,
};

typedef enum _AUDIT_EVENT_TYPE
{
  AuditEventObjectAccess = 0,
  AuditEventDirectoryServiceAccess = 1,
} AUDIT_EVENT_TYPE, *PAUDIT_EVENT_TYPE;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 5,
  NVld = 0,
  VldEddOffset = 4,
  BufSize = 21,
} TAG_UNNAMED_157, *PTAG_UNNAMED_157;

class XE_ILogRWMessageHandler
{
}; /* size: 0x0008 */

enum EVENT_STATE
{
  EVENT_NOTSIGNALED = 0,
  EVENT_SIGNALED = 1,
};

typedef enum
{
  worker_addressIdx = 0,
  number_pagesIdx = 1,
  page_sizeIdx = 2,
  page_locationIdx = 3,
  numa_node_idIdx = 4,
  steal_optionsIdx = 5,
  LastField = 6,
} TAG_UNNAMED_158, *PTAG_UNNAMED_158;

struct _NDR_ASYNC_MESSAGE;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 10,
  NVld = 2,
  VldEddOffset = 7,
  BufSize = 50,
} TAG_UNNAMED_159, *PTAG_UNNAMED_159;

typedef struct _TRIVERTEX
{
  /* 0x0000 */ long x;
  /* 0x0004 */ long y;
  /* 0x0008 */ unsigned short Red;
  /* 0x000a */ unsigned short Green;
  /* 0x000c */ unsigned short Blue;
  /* 0x000e */ unsigned short Alpha;
} TRIVERTEX, *PTRIVERTEX; /* size: 0x0010 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 2,
  NVld = 0,
  VldEddOffset = 1,
  BufSize = 8,
} TAG_UNNAMED_160, *PTAG_UNNAMED_160;

enum tagDOMNodeType
{
  NODE_INVALID = 0,
  NODE_ELEMENT = 1,
  NODE_ATTRIBUTE = 2,
  NODE_TEXT = 3,
  NODE_CDATA_SECTION = 4,
  NODE_ENTITY_REFERENCE = 5,
  NODE_ENTITY = 6,
  NODE_PROCESSING_INSTRUCTION = 7,
  NODE_COMMENT = 8,
  NODE_DOCUMENT = 9,
  NODE_DOCUMENT_TYPE = 10,
  NODE_DOCUMENT_FRAGMENT = 11,
  NODE_NOTATION = 12,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 9,
  NVld = 0,
  VldEddOffset = 8,
  BufSize = 68,
} TAG_UNNAMED_161, *PTAG_UNNAMED_161;

typedef enum
{
  generation_idIdx = 0,
  sequence_idIdx = 1,
  LastField = 2,
} TAG_UNNAMED_162, *PTAG_UNNAMED_162;

typedef enum _TRANSACTION_INFORMATION_CLASS
{
  TransactionBasicInformation = 0,
  TransactionPropertiesInformation = 1,
  TransactionEnlistmentInformation = 2,
  TransactionSuperiorEnlistmentInformation = 3,
  TransactionBindInformation = 4,
  TransactionDTCPrivateInformation = 5,
} TRANSACTION_INFORMATION_CLASS, *PTRANSACTION_INFORMATION_CLASS;

enum std::_Iosb<int>::_Dummy_enum
{
  _Dummy_enum_val = 1,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 1,
  NDynamic = 5,
  NVld = 1,
  VldEddOffset = 3,
  BufSize = 28,
} TAG_UNNAMED_163, *PTAG_UNNAMED_163;

class CAutoRefc<IXMLDOMParseError>
{
  /* 0x0000 */ struct IXMLDOMParseError* m_pt;
}; /* size: 0x0008 */

struct TMemoryBlockAllocator<0,65536,524288,8,1>::NodePartitionWithoutActive
{
}; /* size: 0x00c0 */

enum tagCALLCONV
{
  CC_FASTCALL = 0,
  CC_CDECL = 1,
  CC_MSCPASCAL = 2,
  CC_PASCAL = 2,
  CC_MACPASCAL = 3,
  CC_STDCALL = 4,
  CC_FPFASTCALL = 5,
  CC_SYSCALL = 6,
  CC_MPWCDECL = 7,
  CC_MPWPASCAL = 8,
  CC_MAX = 9,
};

struct TMemoryBlockAllocator<0,131072,524288,8,1>::NodePartitionWithoutActive
{
}; /* size: 0x00c0 */

enum tagSTATFLAG
{
  STATFLAG_DEFAULT = 0,
  STATFLAG_NONAME = 1,
  STATFLAG_NOOPEN = 2,
};

struct XE_TArray<XEStaticAttribute,3>
{
  /* 0x0000 */ struct XEStaticAttribute m_array[3];
}; /* size: 0x0078 */

struct XE_TArray<XEDataAttribute,4>
{
  /* 0x0000 */ struct XEDataAttribute m_array[4];
}; /* size: 0x00a0 */

struct XE_TEvent<3,0,4>
{
  /* 0x0000 */ struct XE_TArray<XEStaticAttribute,3> m_staticAttr;
  /* 0x0078 */ struct XE_TArray<XECustomizableAttribute,0> m_customizableAttr;
  /* 0x0080 */ struct XE_TArray<XEDataAttribute,4> m_dynamicAttr;
  /* 0x0120 */ struct XEEvent m_event;
}; /* size: 0x0168 */

class XeCloudMinPkg::serepl_background_exception
{
  union
  {
    /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
    /* 0x0000 */ struct XE_TEvent<3,0,4> sm_metadata;
    /* 0x0000 */ struct XE_SessionContextList sm_contexts;
    struct
    {
      /* 0x0000 */ const struct _GUID sm_guid;
      /* 0x0010 */ long Padding_68[140];
      /* 0x0240 */ unsigned char m_buf[18];
    }; /* size: 0x0022 */
    /* 0x0000 */ const int error_numberOffset;
    /* 0x0000 */ const int error_severityOffset;
    /* 0x0000 */ const int error_stateOffset;
    /* 0x0000 */ const int error_messageOffset;
  }; /* size: 0x0168 */
}; /* size: 0x0258 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 8,
  NVld = 0,
  VldEddOffset = 7,
  BufSize = 43,
} TAG_UNNAMED_164, *PTAG_UNNAMED_164;

typedef enum
{
  peer_addressIdx = 0,
  LastField = 1,
} TAG_UNNAMED_165, *PTAG_UNNAMED_165;

enum std::errc::errc
{
  address_family_not_supported = 102,
  address_in_use = 100,
  address_not_available = 101,
  already_connected = 113,
  argument_list_too_long = 7,
  argument_out_of_domain = 33,
  bad_address = 14,
  bad_file_descriptor = 9,
  bad_message = 104,
  broken_pipe = 32,
  connection_aborted = 106,
  connection_already_in_progress = 103,
  connection_refused = 107,
  connection_reset = 108,
  cross_device_link = 18,
  destination_address_required = 109,
  device_or_resource_busy = 16,
  directory_not_empty = 41,
  executable_format_error = 8,
  file_exists = 17,
  file_too_large = 27,
  filename_too_long = 38,
  function_not_supported = 40,
  host_unreachable = 110,
  identifier_removed = 111,
  illegal_byte_sequence = 42,
  inappropriate_io_control_operation = 25,
  interrupted = 4,
  invalid_argument = 22,
  invalid_seek = 29,
  io_error = 5,
  is_a_directory = 21,
  message_size = 115,
  network_down = 116,
  network_reset = 117,
  network_unreachable = 118,
  no_buffer_space = 119,
  no_child_process = 10,
  no_link = 121,
  no_lock_available = 39,
  no_message_available = 120,
  no_message = 122,
  no_protocol_option = 123,
  no_space_on_device = 28,
  no_stream_resources = 124,
  no_such_device_or_address = 6,
  no_such_device = 19,
  no_such_file_or_directory = 2,
  no_such_process = 3,
  not_a_directory = 20,
  not_a_socket = 128,
  not_a_stream = 125,
  not_connected = 126,
  not_enough_memory = 12,
  not_supported = 129,
  operation_canceled = 105,
  operation_in_progress = 112,
  operation_not_permitted = 1,
  operation_not_supported = 130,
  operation_would_block = 140,
  owner_dead = 133,
  permission_denied = 13,
  protocol_error = 134,
  protocol_not_supported = 135,
  read_only_file_system = 30,
  resource_deadlock_would_occur = 36,
  resource_unavailable_try_again = 11,
  result_out_of_range = 34,
  state_not_recoverable = 127,
  stream_timeout = 137,
  text_file_busy = 139,
  timed_out = 138,
  too_many_files_open_in_system = 23,
  too_many_files_open = 24,
  too_many_links = 31,
  too_many_synbolic_link_levels = 114,
  value_too_large = 132,
  wrong_protocol_type = 136,
};

typedef enum _SC_ACTION_TYPE
{
  SC_ACTION_NONE = 0,
  SC_ACTION_RESTART = 1,
  SC_ACTION_REBOOT = 2,
  SC_ACTION_RUN_COMMAND = 3,
} SC_ACTION_TYPE, *PSC_ACTION_TYPE;

typedef struct _SC_ACTION
{
  /* 0x0000 */ enum _SC_ACTION_TYPE Type;
  /* 0x0004 */ unsigned long Delay;
} SC_ACTION, *PSC_ACTION; /* size: 0x0008 */

typedef enum
{
  ArgCount = 1,
} TAG_UNNAMED_166, *PTAG_UNNAMED_166;

struct XE_TArray<XEDataAttribute,9>
{
  /* 0x0000 */ struct XEDataAttribute m_array[9];
}; /* size: 0x0168 */

struct XE_TEvent<4,1,9>
{
  /* 0x0000 */ struct XE_TArray<XEStaticAttribute,4> m_staticAttr;
  /* 0x00a0 */ struct XE_TArray<XECustomizableAttribute,1> m_customizableAttr;
  /* 0x00d8 */ struct XE_TArray<XEDataAttribute,9> m_dynamicAttr;
  /* 0x0240 */ struct XEEvent m_event;
}; /* size: 0x0288 */

class XeSqlPkg::file_read_throttled
{
  union
  {
    /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
    /* 0x0000 */ struct XE_TEvent<4,1,9> sm_metadata;
    /* 0x0000 */ struct XE_SessionContextList sm_contexts;
    struct
    {
      /* 0x0000 */ const struct _GUID sm_guid;
      /* 0x0010 */ long Padding_69[140];
      /* 0x0240 */ unsigned char m_buf[45];
    }; /* size: 0x003d */
    /* 0x0000 */ const int modeOffset;
    /* 0x0000 */ const int file_handleOffset;
    /* 0x0000 */ const int offsetOffset;
    /* 0x0000 */ const int database_idOffset;
    /* 0x0000 */ const int file_idOffset;
    /* 0x0000 */ const int filegroup_idOffset;
    /* 0x0000 */ const int sizeOffset;
    /* 0x0000 */ const int is_volume_limit_hitOffset;
    /* 0x0000 */ const int pathOffset;
  }; /* size: 0x0288 */
}; /* size: 0x0270 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 5,
  NVld = 0,
  VldEddOffset = 4,
  BufSize = 29,
} TAG_UNNAMED_167, *PTAG_UNNAMED_167;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 13,
  NVld = 5,
  VldEddOffset = 7,
  BufSize = 93,
} TAG_UNNAMED_168, *PTAG_UNNAMED_168;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 2,
  NVld = 1,
  VldEddOffset = 0,
  BufSize = 12,
} TAG_UNNAMED_169, *PTAG_UNNAMED_169;

class XE_Metadata
{
  /* 0x0000 */ void* m_holder;
}; /* size: 0x0008 */

typedef enum _TAPE_DRIVE_PROBLEM_TYPE
{
  TapeDriveProblemNone = 0,
  TapeDriveReadWriteWarning = 1,
  TapeDriveReadWriteError = 2,
  TapeDriveReadWarning = 3,
  TapeDriveWriteWarning = 4,
  TapeDriveReadError = 5,
  TapeDriveWriteError = 6,
  TapeDriveHardwareError = 7,
  TapeDriveUnsupportedMedia = 8,
  TapeDriveScsiConnectionError = 9,
  TapeDriveTimetoClean = 10,
  TapeDriveCleanDriveNow = 11,
  TapeDriveMediaLifeExpired = 12,
  TapeDriveSnappedTape = 13,
} TAPE_DRIVE_PROBLEM_TYPE, *PTAPE_DRIVE_PROBLEM_TYPE;

struct IClientSecurity
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 7,
  NVld = 2,
  VldEddOffset = 4,
  BufSize = 39,
} TAG_UNNAMED_170, *PTAG_UNNAMED_170;

class SEList<PageHeapPageInfo,40>
{
  /* 0x0000 */ class ListBase m_list;
}; /* size: 0x0010 */

typedef enum _ACTIVATION_CONTEXT_INFO_CLASS
{
  ActivationContextBasicInformation = 1,
  ActivationContextDetailedInformation = 2,
  AssemblyDetailedInformationInActivationContext = 3,
  FileInformationInAssemblyOfAssemblyInActivationContext = 4,
  RunlevelInformationInActivationContext = 5,
  CompatibilityInformationInActivationContext = 6,
  ActivationContextManifestResourceName = 7,
  MaxActivationContextInfoClass = 8,
  AssemblyDetailedInformationInActivationContxt = 3,
  FileInformationInAssemblyOfAssemblyInActivationContxt = 4,
} ACTIVATION_CONTEXT_INFO_CLASS, *PACTIVATION_CONTEXT_INFO_CLASS;

typedef enum
{
  request_typeIdx = 0,
  file_byte_offsetIdx = 1,
  file_byte_countIdx = 2,
  http_errorcodeIdx = 3,
  request_idIdx = 4,
  file_pathIdx = 5,
  LastField = 6,
} TAG_UNNAMED_171, *PTAG_UNNAMED_171;

typedef struct _SYSTEM_POOL_ENTRY
{
  /* 0x0000 */ unsigned char Allocated;
  /* 0x0001 */ unsigned char Spare0;
  /* 0x0002 */ unsigned short AllocatorBackTraceIndex;
  /* 0x0004 */ unsigned long Size;
  union
  {
    /* 0x0008 */ unsigned char Tag[4];
    /* 0x0008 */ unsigned long TagUlong;
    /* 0x0008 */ void* ProcessChargedQuota;
  }; /* size: 0x0008 */
} SYSTEM_POOL_ENTRY, *PSYSTEM_POOL_ENTRY; /* size: 0x0010 */

typedef enum
{
  database_idIdx = 0,
  object_idIdx = 1,
  rows_changed_countIdx = 2,
  process_stageIdx = 3,
  LastField = 4,
} TAG_UNNAMED_172, *PTAG_UNNAMED_172;

struct BlockAllocPartialListSLock
{
}; /* size: 0x0004 */

struct TMemoryBlockAllocator<0,524288,4194304,4,0>::NodePartitionBase
{
  /* 0x0000 */ struct BlockAllocPartialListSLock m_lock;
  /* 0x0004 */ long Padding_70;
  /* 0x0008 */ class SEList<SOS_ParentBlockDescriptor,0> m_partiallyFilledParentBlocks[4];
}; /* size: 0x0048 */

typedef enum __MIDL_ICodeInstall_0001
{
  CIP_DISK_FULL = 0,
  CIP_ACCESS_DENIED = 1,
  CIP_NEWER_VERSION_EXISTS = 2,
  CIP_OLDER_VERSION_EXISTS = 3,
  CIP_NAME_CONFLICT = 4,
  CIP_TRUST_VERIFICATION_COMPONENT_MISSING = 5,
  CIP_EXE_SELF_REGISTERATION_TIMEOUT = 6,
  CIP_UNSAFE_TO_ABORT = 7,
  CIP_NEED_REBOOT = 8,
  CIP_NEED_REBOOT_UI_PERMISSION = 9,
} _MIDL_ICodeInstall_0001, *P_MIDL_ICodeInstall_0001;

typedef enum __MIDL_IBindStatusCallback_0005
{
  BINDINFO_OPTIONS_WININETFLAG = 0x10000,
  BINDINFO_OPTIONS_ENABLE_UTF8 = 0x20000,
  BINDINFO_OPTIONS_DISABLE_UTF8 = 0x40000,
  BINDINFO_OPTIONS_USE_IE_ENCODING = 0x80000,
  BINDINFO_OPTIONS_BINDTOOBJECT = 0x100000,
  BINDINFO_OPTIONS_SECURITYOPTOUT = 0x200000,
  BINDINFO_OPTIONS_IGNOREMIMETEXTPLAIN = 0x400000,
  BINDINFO_OPTIONS_USEBINDSTRINGCREDS = 0x800000,
  BINDINFO_OPTIONS_IGNOREHTTPHTTPSREDIRECTS = 0x1000000,
  BINDINFO_OPTIONS_IGNORE_SSLERRORS_ONCE = 0x2000000,
  BINDINFO_WPC_DOWNLOADBLOCKED = 0x8000000,
  BINDINFO_WPC_LOGGING_ENABLED = 0x10000000,
  BINDINFO_OPTIONS_ALLOWCONNECTDATA = 0x20000000,
  BINDINFO_OPTIONS_DISABLEAUTOREDIRECTS = 0x40000000,
  BINDINFO_OPTIONS_SHDOCVW_NAVIGATE = -2147483648,
} _MIDL_IBindStatusCallback_0005, *P_MIDL_IBindStatusCallback_0005;

typedef struct _WNF_STATE_NAME
{
  /* 0x0000 */ unsigned long Data[2];
} WNF_STATE_NAME, *PWNF_STATE_NAME; /* size: 0x0008 */

typedef struct _WNF_TYPE_ID
{
  /* 0x0000 */ struct _GUID TypeId;
} WNF_TYPE_ID, *PWNF_TYPE_ID; /* size: 0x0010 */

typedef struct _WNF_DELIVERY_DESCRIPTOR
{
  /* 0x0000 */ struct _WNF_STATE_NAME StateName;
  /* 0x0008 */ unsigned long ChangeStamp;
  /* 0x000c */ unsigned long DeliveryFlag;
  /* 0x0010 */ unsigned long DeliveryState;
  /* 0x0014 */ unsigned long ReliableRetryDelay;
  /* 0x0018 */ unsigned long BatchRetry;
  /* 0x001c */ unsigned long StateDataSize;
  /* 0x0020 */ unsigned long EventMask;
  /* 0x0024 */ struct _WNF_TYPE_ID TypeId;
  /* 0x0034 */ unsigned long StateDataOffset;
} WNF_DELIVERY_DESCRIPTOR, *PWNF_DELIVERY_DESCRIPTOR; /* size: 0x0038 */

typedef enum
{
  database_idIdx = 0,
  table_idIdx = 1,
  object_idIdx = 2,
  recompile_reasonIdx = 3,
  LastField = 4,
} TAG_UNNAMED_173, *PTAG_UNNAMED_173;

class DmpPointer<SOS_Scheduler>
{
  /* 0x0000 */ class SOS_Scheduler* m_pRaw;
}; /* size: 0x0008 */

typedef enum
{
  stateIdx = 0,
  durationIdx = 1,
  lock_modeIdx = 2,
  LastField = 3,
} TAG_UNNAMED_174, *PTAG_UNNAMED_174;

struct XE_TArray<XEDataAttribute,2>
{
  /* 0x0000 */ struct XEDataAttribute m_array[2];
}; /* size: 0x0050 */

struct XE_TEvent<4,0,2>
{
  /* 0x0000 */ struct XE_TArray<XEStaticAttribute,4> m_staticAttr;
  /* 0x00a0 */ struct XE_TArray<XECustomizableAttribute,0> m_customizableAttr;
  /* 0x00a8 */ struct XE_TArray<XEDataAttribute,2> m_dynamicAttr;
  /* 0x00f8 */ struct XEEvent m_event;
}; /* size: 0x0140 */

class XeSqlPkg::log_buffer_freed
{
  union
  {
    /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
    /* 0x0000 */ struct XE_TEvent<4,0,2> sm_metadata;
    /* 0x0000 */ struct XE_SessionContextList sm_contexts;
    struct
    {
      /* 0x0000 */ const struct _GUID sm_guid;
      /* 0x0010 */ long Padding_71[140];
      /* 0x0240 */ unsigned char m_buf[12];
    }; /* size: 0x001c */
    /* 0x0000 */ const int addressOffset;
    /* 0x0000 */ const int current_countOffset;
  }; /* size: 0x0140 */
}; /* size: 0x0250 */

typedef enum
{
  _BUF_SIZE = 16,
} TAG_UNNAMED_175, *PTAG_UNNAMED_175;

class Spinlock<269,1,1>
{
}; /* size: 0x0004 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 6,
  NVld = 2,
  VldEddOffset = 3,
  BufSize = 34,
} TAG_UNNAMED_176, *PTAG_UNNAMED_176;

typedef enum
{
  Result = 10000,
} TAG_UNNAMED_177, *PTAG_UNNAMED_177;

class TCallbackBase<UnsafeCallbackTraits<TCallback<void,SOS_DispatcherBase const * const,NullType,NullType,NullType> >,void,SOS_DispatcherBase const * const,NullType,NullType,NullType>
{
  /* 0x0000 */ long Padding_72[4];
  /* 0x0010 */ void* m_pfn /* function */;
}; /* size: 0x0018 */

enum tagPERCEIVED
{
  PERCEIVED_TYPE_FIRST = -3,
  PERCEIVED_TYPE_CUSTOM = -3,
  PERCEIVED_TYPE_UNSPECIFIED = -2,
  PERCEIVED_TYPE_FOLDER = -1,
  PERCEIVED_TYPE_UNKNOWN = 0,
  PERCEIVED_TYPE_TEXT = 1,
  PERCEIVED_TYPE_IMAGE = 2,
  PERCEIVED_TYPE_AUDIO = 3,
  PERCEIVED_TYPE_VIDEO = 4,
  PERCEIVED_TYPE_COMPRESSED = 5,
  PERCEIVED_TYPE_DOCUMENT = 6,
  PERCEIVED_TYPE_SYSTEM = 7,
  PERCEIVED_TYPE_APPLICATION = 8,
  PERCEIVED_TYPE_GAMEMEDIA = 9,
  PERCEIVED_TYPE_CONTACTS = 10,
  PERCEIVED_TYPE_LAST = 10,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 1,
  NDynamic = 3,
  NVld = 1,
  VldEddOffset = 1,
  BufSize = 13,
} TAG_UNNAMED_178, *PTAG_UNNAMED_178;

typedef enum _PROCESS_MITIGATION_POLICY
{
  ProcessDEPPolicy = 0,
  ProcessASLRPolicy = 1,
  ProcessStackCheckPolicy = 2,
  ProcessStrictHandleCheckPolicy = 3,
  ProcessSystemCallDisablePolicy = 4,
  MaxProcessMitigationPolicy = 5,
} PROCESS_MITIGATION_POLICY, *PPROCESS_MITIGATION_POLICY;

enum XESessionBufferPolicy
{
  XESBP_DROP_EVENT = 0,
  XESBP_BLOCK = 1,
  XESBP_ALLOC = 2,
  XESBP_DROP_BUFFER = 3,
};

struct XEConfigMapping<enum XESessionBufferPolicy>
{
  /* 0x0000 */ wchar_t m_optionName[255];
  /* 0x01fe */ char Padding_73[2];
  /* 0x0200 */ enum XESessionBufferPolicy m_policy;
}; /* size: 0x0204 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 4,
  NVld = 0,
  VldEddOffset = 3,
  BufSize = 12,
} TAG_UNNAMED_179, *PTAG_UNNAMED_179;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 4,
  NVld = 0,
  VldEddOffset = 3,
  BufSize = 20,
} TAG_UNNAMED_180, *PTAG_UNNAMED_180;

class EventAutoInternal<SuspendQueueSLock>
{
}; /* size: 0x0028 */

class SOS_UnfairMutexPair
{
  union
  {
    struct
    {
      /* 0x0000 */ class EventAutoInternal<SuspendQueueSLock> m_eventPair;
      /* 0x0028 */ class EventAutoInternal<SuspendQueueSLock> m_eventSingle;
      /* 0x0050 */ volatile unsigned long m_lockCount;
      /* 0x0054 */ long Padding_74;
      /* 0x0058 */ class SOS_Scheduler* m_pOwnerSchedulerPair;
      /* 0x0060 */ class SOS_Scheduler* m_pOwnerSchedulerSingle;
      /* 0x0068 */ class SOS_Task* m_pOwningTaskNoRefPair;
      /* 0x0070 */ class SOS_Task* m_pOwningTaskNoRefSingle;
    }; /* size: 0x0074 */
    /* 0x0000 */ const long Bit_PairWaiter;
    /* 0x0000 */ const long Bit_PairOwnerNoWaiter;
    /* 0x0000 */ const long Bit_PairOwner;
    /* 0x0000 */ const long Bit_MinusPairOwner;
    /* 0x0000 */ const long Mask_PairOwner;
    /* 0x0000 */ const long Bit_SingleWaiter;
    /* 0x0000 */ const long Bit_SingleOwnerNoWaiter;
    /* 0x0000 */ const long Bit_SingleOwner;
    /* 0x0000 */ const long Bit_MinusSingleOwner;
    /* 0x0000 */ const long Mask_SingleOwner;
    /* 0x0000 */ const long Bit_PairOwnerCheck;
  }; /* size: 0x0074 */
}; /* size: 0x0078 */

class SOS_WaitInfo
{
  /* 0x0000 */ unsigned int m_WaitType;
  /* 0x0004 */ long Padding_75;
  /* 0x0008 */ void* m_pResWait;
  /* 0x0010 */ void* m_pSpinlockOper /* function */;
  /* 0x0018 */ class SpinlockBase* m_pSpinlock;
  /* 0x0020 */ class SOS_BlockersEnumeratorCreator* m_creator;
}; /* size: 0x0028 */

class CMemThread<PageHeapMemObj>
{
  /* 0x0000 */ long Padding_76[26];
  /* 0x0068 */ class SOS_UnfairMutexPair m_mutexPair;
  /* 0x00e0 */ class SOS_WaitInfo m_waitInfoObj;
}; /* size: 0x0108 */

typedef struct _DEVICE_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Failed : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long ReadOnly : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long Removable : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned long ConsoleIn : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned long ConsoleOut : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned long Input : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned long Output : 1; /* bit position: 6 */
  }; /* bitfield */
} DEVICE_FLAGS, *PDEVICE_FLAGS; /* size: 0x0004 */

typedef struct _CM_COMPONENT_INFORMATION
{
  /* 0x0000 */ struct _DEVICE_FLAGS Flags;
  /* 0x0004 */ unsigned long Version;
  /* 0x0008 */ unsigned long Key;
  /* 0x000c */ long Padding_77;
  /* 0x0010 */ unsigned __int64 AffinityMask;
} CM_COMPONENT_INFORMATION, *PCM_COMPONENT_INFORMATION; /* size: 0x0018 */

typedef enum
{
  database_idIdx = 0,
  flushed_logIdx = 1,
  end_of_logIdx = 2,
  clean_shutdownIdx = 3,
  group_idIdx = 4,
  replica_idIdx = 5,
  ag_database_idIdx = 6,
  LastField = 7,
} TAG_UNNAMED_181, *PTAG_UNNAMED_181;

enum tagXFORMCOORDS
{
  XFORMCOORDS_POSITION = 1,
  XFORMCOORDS_SIZE = 2,
  XFORMCOORDS_HIMETRICTOCONTAINER = 4,
  XFORMCOORDS_CONTAINERTOHIMETRIC = 8,
  XFORMCOORDS_EVENTCOMPAT = 16,
};

typedef enum
{
  cpu_ticksIdx = 0,
  thread_idIdx = 1,
  LastField = 2,
} TAG_UNNAMED_182, *PTAG_UNNAMED_182;

typedef union _userHENHMETAFILE::__MIDL_IWinTypes_0006
{
  union
  {
    /* 0x0000 */ long hInproc;
    /* 0x0000 */ struct _BYTE_BLOB* hRemote;
    /* 0x0000 */ __int64 hInproc64;
  }; /* size: 0x0008 */
} userHENHMETAFILE::__MIDL_IWinTypes_0006, *PuserHENHMETAFILE::__MIDL_IWinTypes_0006; /* size: 0x0008 */

typedef struct _userHENHMETAFILE
{
  /* 0x0000 */ long fContext;
  /* 0x0004 */ long Padding_78;
  /* 0x0008 */ union _userHENHMETAFILE::__MIDL_IWinTypes_0006 u;
} userHENHMETAFILE, *PuserHENHMETAFILE; /* size: 0x0010 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 5,
  NVld = 0,
  VldEddOffset = 4,
  BufSize = 16,
} TAG_UNNAMED_183, *PTAG_UNNAMED_183;

typedef enum
{
  Value = 1,
} TAG_UNNAMED_184, *PTAG_UNNAMED_184;

class SEList<XE_IMetadata,32>
{
  /* 0x0000 */ class ListBase m_list;
}; /* size: 0x0010 */

class XE_MetadataStore
{
  /* 0x0000 */ class SEList<XE_IMetadata,32> m_mdList;
  /* 0x0010 */ class XE_ILogReadMessageHandler* m_pMsgHandler;
  /* 0x0018 */ struct _GUID m_lastSignature;
  /* 0x0028 */ unsigned short m_lastGeneration;
  /* 0x002a */ char Padding_79[6];
  /* 0x0030 */ class XE_IMetadata* m_pLastMetadata;
}; /* size: 0x0038 */

typedef struct _OLESTREAM
{
  /* 0x0000 */ struct _OLESTREAMVTBL* lpstbl;
} OLESTREAM, *POLESTREAM; /* size: 0x0008 */

struct IOleUndoManager
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 4,
  NVld = 1,
  VldEddOffset = 2,
  BufSize = 20,
} TAG_UNNAMED_185, *PTAG_UNNAMED_185;

typedef struct _ACL_SIZE_INFORMATION
{
  /* 0x0000 */ unsigned long AceCount;
  /* 0x0004 */ unsigned long AclBytesInUse;
  /* 0x0008 */ unsigned long AclBytesFree;
} ACL_SIZE_INFORMATION, *PACL_SIZE_INFORMATION; /* size: 0x000c */

class CAutoBase<XE_XMLObjectString>
{
  /* 0x0000 */ class XE_XMLObjectString* m_pt;
}; /* size: 0x0008 */

typedef enum _DEP_SYSTEM_POLICY_TYPE
{
  DEPPolicyAlwaysOff = 0,
  DEPPolicyAlwaysOn = 1,
  DEPPolicyOptIn = 2,
  DEPPolicyOptOut = 3,
  DEPTotalPolicyCount = 4,
} DEP_SYSTEM_POLICY_TYPE, *PDEP_SYSTEM_POLICY_TYPE;

typedef struct __vc_attributes::atl::aggregatesAttribute
{
  /* 0x0000 */ const char* clsid;
} _vc_attributes::atl::aggregatesAttribute, *P_vc_attributes::atl::aggregatesAttribute; /* size: 0x0008 */

enum TimeUnit
{
  Second = 0,
  Millisec = -3,
  Microsec = -6,
  HundredNanosec = -7,
};

typedef struct _M128A
{
  /* 0x0000 */ unsigned __int64 Low;
  /* 0x0008 */ __int64 High;
} M128A, *PM128A; /* size: 0x0010 */

typedef enum
{
  _ALLOC_MASK = 7,
} TAG_UNNAMED_186, *PTAG_UNNAMED_186;

enum XEDataAttributeCapabilities
{
  XDAC_STREAM = 1,
  XDAC_OPTIONAL = 2,
  XDAC_DEFAULT = 0,
};

struct tagEMRPOLYPOLYLINE
{
  /* 0x0000 */ struct tagEMR emr;
  /* 0x0008 */ struct _RECTL rclBounds;
  /* 0x0018 */ unsigned long nPolys;
  /* 0x001c */ unsigned long cptl;
  /* 0x0020 */ unsigned long aPolyCounts[1];
  /* 0x0024 */ struct _POINTL aptl[1];
}; /* size: 0x002c */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 0,
  VldEddOffset = 2,
  BufSize = 12,
} TAG_UNNAMED_187, *PTAG_UNNAMED_187;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 5,
  NVld = 0,
  VldEddOffset = 4,
  BufSize = 24,
} TAG_UNNAMED_188, *PTAG_UNNAMED_188;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 0,
  VldEddOffset = 2,
  BufSize = 12,
} TAG_UNNAMED_189, *PTAG_UNNAMED_189;

struct IEnumSTATDATA
{
}; /* size: 0x0008 */

enum XEMandatoryStaticAttributes
{
  XEMSA_UUID = 0,
  XEMSA_VERSION = 1,
  XEMSA_CHANNEL = 2,
  XEMSA_LAST = 3,
};

struct IXMLDOMDocumentFragment
{
}; /* size: 0x0008 */

typedef enum
{
  stateIdx = 0,
  durationIdx = 1,
  epochIdx = 2,
  csnIdx = 3,
  replica_typeIdx = 4,
  optionsIdx = 5,
  LastField = 6,
} TAG_UNNAMED_190, *PTAG_UNNAMED_190;

enum IExecSql::EParamInitAttributes
{
  NoParamInitAttr = 0,
  Recompile = 1,
  NoMetaData = 2,
  Assign = 3,
  PrepExec = 4,
  PrepQuery = 5,
  ConstProcName = 6,
  ConstParams = 7,
  Rpc = 8,
  Extracted = 9,
  PossibleRawColl = 10,
  ValReturned = 11,
  CursorOutParam = 12,
  NoNamedParam = 13,
  DontCache = 14,
  OutParam = 15,
  ParamIniAttrLastValue = 16,
};

struct XEMap
{
  /* 0x0000 */ struct XEObject m_object;
  /* 0x0020 */ unsigned char m_size;
  /* 0x0021 */ char Padding_80;
  /* 0x0022 */ unsigned short m_entryCount;
  /* 0x0024 */ long Padding_81;
  /* 0x0028 */ struct XEMapEntry* m_entries;
}; /* size: 0x0030 */

struct XE_TMap<9>
{
  union
  {
    /* 0x0000 */ const unsigned int NEntries;
    /* 0x0000 */ struct XEMapEntry m_maps[9];
  }; /* size: 0x0090 */
  /* 0x0090 */ struct XEMap m_map;
}; /* size: 0x00c0 */

typedef enum
{
  ArgCount = 2,
} TAG_UNNAMED_191, *PTAG_UNNAMED_191;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 2,
  NVld = 0,
  VldEddOffset = 1,
  BufSize = 16,
} TAG_UNNAMED_192, *PTAG_UNNAMED_192;

enum tagEOLE_AUTHENTICATION_CAPABILITIES
{
  EOAC_NONE = 0,
  EOAC_MUTUAL_AUTH = 1,
  EOAC_STATIC_CLOAKING = 32,
  EOAC_DYNAMIC_CLOAKING = 64,
  EOAC_ANY_AUTHORITY = 128,
  EOAC_MAKE_FULLSIC = 256,
  EOAC_DEFAULT = 2048,
  EOAC_SECURE_REFS = 2,
  EOAC_ACCESS_CONTROL = 4,
  EOAC_APPID = 8,
  EOAC_DYNAMIC = 16,
  EOAC_REQUIRE_FULLSIC = 512,
  EOAC_AUTO_IMPERSONATE = 1024,
  EOAC_NO_CUSTOM_MARSHAL = 8192,
  EOAC_DISABLE_AAA = 4096,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 5,
  NVld = 1,
  VldEddOffset = 3,
  BufSize = 29,
} TAG_UNNAMED_193, *PTAG_UNNAMED_193;

typedef enum
{
  addressIdx = 0,
  classIdx = 1,
  keep_countIdx = 2,
  shared_countIdx = 3,
  update_countIdx = 4,
  exclusive_countIdx = 5,
  destroy_countIdx = 6,
  has_waitersIdx = 7,
  is_superlatchIdx = 8,
  is_poisonedIdx = 9,
  database_idIdx = 10,
  file_idIdx = 11,
  page_idIdx = 12,
  LastField = 13,
} TAG_UNNAMED_194, *PTAG_UNNAMED_194;

typedef struct __vc_attributes::entryAttribute
{
  /* 0x0000 */ const char* entry_id;
} _vc_attributes::entryAttribute, *P_vc_attributes::entryAttribute; /* size: 0x0008 */

typedef enum
{
  generation_idIdx = 0,
  sequence_idIdx = 1,
  gdm_addressIdx = 2,
  gdm_task_addressIdx = 3,
  LastField = 4,
} TAG_UNNAMED_195, *PTAG_UNNAMED_195;

enum tagPROPPAGESTATUS
{
  PROPPAGESTATUS_DIRTY = 1,
  PROPPAGESTATUS_VALIDATE = 2,
  PROPPAGESTATUS_CLEAN = 4,
};

typedef enum
{
  ArgCount = 3,
} TAG_UNNAMED_196, *PTAG_UNNAMED_196;

typedef struct _SID_AND_ATTRIBUTES
{
  /* 0x0000 */ void* Sid;
  /* 0x0008 */ unsigned long Attributes;
  /* 0x000c */ long __PADDING__[1];
} SID_AND_ATTRIBUTES, *PSID_AND_ATTRIBUTES; /* size: 0x0010 */

typedef struct _TOKEN_MANDATORY_LABEL
{
  /* 0x0000 */ struct _SID_AND_ATTRIBUTES Label;
} TOKEN_MANDATORY_LABEL, *PTOKEN_MANDATORY_LABEL; /* size: 0x0010 */

typedef enum __MIDL_IBindStatusCallbackEx_0001
{
  BINDF2_DISABLEBASICOVERHTTP = 1,
  BINDF2_DISABLEAUTOCOOKIEHANDLING = 2,
  BINDF2_READ_DATA_GREATER_THAN_4GB = 4,
  BINDF2_DISABLE_HTTP_REDIRECT_XSECURITYID = 8,
  BINDF2_SETDOWNLOADMODE = 32,
  BINDF2_DISABLE_HTTP_REDIRECT_CACHING = 64,
  BINDF2_RESERVED_E = 0x40000,
  BINDF2_RESERVED_D = 0x80000,
  BINDF2_RESERVED_C = 0x100000,
  BINDF2_RESERVED_B = 0x200000,
  BINDF2_RESERVED_A = 0x400000,
  BINDF2_RESERVED_9 = 0x800000,
  BINDF2_RESERVED_8 = 0x1000000,
  BINDF2_RESERVED_7 = 0x2000000,
  BINDF2_RESERVED_6 = 0x4000000,
  BINDF2_RESERVED_5 = 0x8000000,
  BINDF2_RESERVED_4 = 0x10000000,
  BINDF2_RESERVED_3 = 0x20000000,
  BINDF2_RESERVED_2 = 0x40000000,
  BINDF2_RESERVED_1 = -2147483648,
} _MIDL_IBindStatusCallbackEx_0001, *P_MIDL_IBindStatusCallbackEx_0001;

class XeSqlPkg::security_authentication_perf_find_login
{
  union
  {
    /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
    /* 0x0000 */ struct XE_TEvent<4,0,2> sm_metadata;
    /* 0x0000 */ struct XE_SessionContextList sm_contexts;
    struct
    {
      /* 0x0000 */ const struct _GUID sm_guid;
      /* 0x0010 */ long Padding_82[140];
      /* 0x0240 */ unsigned char m_buf[9];
    }; /* size: 0x0019 */
    /* 0x0000 */ const int find_login_durationOffset;
    /* 0x0000 */ const int is_sql_authenticationOffset;
  }; /* size: 0x0140 */
}; /* size: 0x0250 */

typedef enum
{
  NStatic = 3,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 2,
  VldEddOffset = 0,
  BufSize = 20,
} TAG_UNNAMED_197, *PTAG_UNNAMED_197;

enum XeSqlPkg::sp_cache_remove::CustomizableSlots
{
  collect_cached_textSlot = 0,
  collect_database_nameSlot = 1,
  collect_plan_handleSlot = 2,
};

struct PPM_IDLE_STATE_ACCOUNTING
{
  /* 0x0000 */ unsigned long IdleTransitions;
  /* 0x0004 */ unsigned long FailedTransitions;
  /* 0x0008 */ unsigned long InvalidBucketIndex;
  /* 0x000c */ long Padding_83;
  /* 0x0010 */ unsigned __int64 TotalTime;
  /* 0x0018 */ unsigned long IdleTimeBuckets[6];
}; /* size: 0x0030 */

typedef enum _KTMOBJECT_TYPE
{
  KTMOBJECT_TRANSACTION = 0,
  KTMOBJECT_TRANSACTION_MANAGER = 1,
  KTMOBJECT_RESOURCE_MANAGER = 2,
  KTMOBJECT_ENLISTMENT = 3,
  KTMOBJECT_INVALID = 4,
} KTMOBJECT_TYPE, *PKTMOBJECT_TYPE;

typedef enum
{
  alnum = 263,
  alpha = 259,
  cntrl = 32,
  digit = 4,
  graph = 279,
  lower = 2,
  print = 471,
  punct = 16,
  space = 72,
  upper = 1,
  xdigit = 128,
} TAG_UNNAMED_198, *PTAG_UNNAMED_198;

typedef struct _LOCALGROUP_INFO_0
{
  /* 0x0000 */ wchar_t* lgrpi0_name;
} LOCALGROUP_INFO_0, *PLOCALGROUP_INFO_0; /* size: 0x0008 */

typedef enum
{
  endpoint_typeIdx = 0,
  proxied_endpoint_typeIdx = 1,
  hop_countIdx = 2,
  addressIdx = 3,
  correlator_idIdx = 4,
  connection_idIdx = 5,
  LastField = 6,
} TAG_UNNAMED_199, *PTAG_UNNAMED_199;

typedef enum
{
  query_operation_node_idIdx = 0,
  thread_idIdx = 1,
  connect_brick_idIdx = 2,
  query_idIdx = 3,
  rows_affectedIdx = 4,
  LastField = 5,
} TAG_UNNAMED_200, *PTAG_UNNAMED_200;

typedef enum
{
  NStatic = 3,
  NCustomizable = 0,
  NDynamic = 2,
  NVld = 0,
  VldEddOffset = 1,
  BufSize = 8,
} TAG_UNNAMED_201, *PTAG_UNNAMED_201;

typedef enum
{
  cache_addressIdx = 0,
  descriptor_addressIdx = 1,
  user_data_addressIdx = 2,
  is_insertionIdx = 3,
  decisionIdx = 4,
  stateIdx = 5,
  size_in_pagesIdx = 6,
  time_to_generateIdx = 7,
  use_countIdx = 8,
  average_intervalIdx = 9,
  probability_of_reuseIdx = 10,
  valueIdx = 11,
  value_of_memoryIdx = 12,
  LastField = 13,
} TAG_UNNAMED_202, *PTAG_UNNAMED_202;

typedef enum _RTL_UMS_SCHEDULER_REASON
{
  UmsSchedulerStartup = 0,
  UmsSchedulerThreadBlocked = 1,
  UmsSchedulerThreadYield = 2,
} RTL_UMS_SCHEDULER_REASON, *PRTL_UMS_SCHEDULER_REASON;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 2,
  NVld = 0,
  VldEddOffset = 1,
  BufSize = 2,
} TAG_UNNAMED_203, *PTAG_UNNAMED_203;

enum XE_XmlOptions
{
  XEXML_NONE = 0,
  XEXML_USE_CDATA = 1,
  XEXML_PACKAGE_AS_GUID = 2,
  XEXML_INCLUDE_MODULE_NAMES = 4,
  XEXML_INCLUDE_EVENT_GUIDS = 8,
  XEXML_INCLUDE_FIELD_TYPES = 16,
  XEXML_INCLUDE_FIELD_TEXT = 32,
  XEXML_NO_PACKAGE_INFO = 64,
  XEXML_USE_CACHING = 128,
  XEXML_USE_LOCALTIME = 256,
};

struct XE_StandardFormatter::MapEntry
{
  /* 0x0000 */ void* m_valToStr /* function */;
  /* 0x0008 */ void* m_valExToStr /* function */;
}; /* size: 0x0010 */

class XE_StandardFormatter
{
  /* 0x0000 */ struct XE_StandardFormatter::MapEntry m_mapping[28];
}; /* size: 0x01c0 */

class XE_SerializedEvent<XE_LiveSessionMetadata,XE_VersionConfig>
{
  /* 0x0000 */ long Padding_84[2];
  /* 0x0008 */ const class XE_LiveSessionMetadata* m_metadata;
  /* 0x0010 */ const struct XEEventBufferHeader* m_pSerializedEvent;
  /* 0x0018 */ const struct XEEvent* m_event;
  /* 0x0020 */ unsigned short m_index;
  /* 0x0022 */ char Padding_85[6];
  /* 0x0028 */ const unsigned char* m_pBuf;
}; /* size: 0x0030 */

class XE_ParserFactory<XE_SerializedEvent<XE_LiveSessionMetadata,XE_VersionConfig> >
{
  /* 0x0000 */ class XE_SerializedEvent<XE_LiveSessionMetadata,XE_VersionConfig> m_parser;
}; /* size: 0x0030 */

class XE_AutoP<SEHashTable<XE_XMLObjectString,XE_XMLObjectString,0,0,XE_BaseAllocator> >
{
}; /* size: 0x0008 */

class XE_Xml<XE_Metadata,XE_StandardFormatter,XE_SerializedEvent<XE_LiveSessionMetadata,XE_VersionConfig> >
{
  union
  {
    /* 0x0000 */ const unsigned int STACK_STREAM_BUFFER;
    /* 0x0000 */ const unsigned int MIN_CDATA_INVALID_STRING;
    /* 0x0000 */ const class XE_Metadata* m_metadata;
  }; /* size: 0x0008 */
  /* 0x0008 */ enum XE_XmlOptions m_opts;
  /* 0x000c */ long Padding_86;
  /* 0x0010 */ const class XE_StandardFormatter m_formatter;
  /* 0x01d0 */ class XE_ParserFactory<XE_SerializedEvent<XE_LiveSessionMetadata,XE_VersionConfig> > m_parserFactory;
  /* 0x0200 */ void* m_pfnSymbolizeCallstack /* function */;
  /* 0x0208 */ struct _TIME_ZONE_INFORMATION* m_timeZoneInfo;
  /* 0x0210 */ class XE_AutoP<SEHashTable<XE_XMLObjectString,XE_XMLObjectString,0,0,XE_BaseAllocator> > m_objectCache;
}; /* size: 0x0218 */

enum SHREGENUM_FLAGS
{
  SHREGENUM_DEFAULT = 0,
  SHREGENUM_HKCU = 1,
  SHREGENUM_HKLM = 16,
  SHREGENUM_BOTH = 17,
};

class XeSqlPkg::remote_dmv_stream_open_client
{
  union
  {
    struct
    {
      /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
      /* 0x0004 */ long Padding_87[143];
      /* 0x0240 */ unsigned char m_buf[20];
    }; /* size: 0x0018 */
    /* 0x0000 */ const int internal_stvf_idOffset;
    /* 0x0000 */ const int client_brick_idOffset;
    /* 0x0000 */ const int client_stream_idOffset;
    /* 0x0000 */ const int server_brick_idOffset;
    /* 0x0000 */ const int server_session_idOffset;
  }; /* size: 0x0018 */
}; /* size: 0x0258 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 4,
  NVld = 0,
  VldEddOffset = 3,
  BufSize = 32,
} TAG_UNNAMED_204, *PTAG_UNNAMED_204;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 1,
  NVld = 0,
  VldEddOffset = 0,
  BufSize = 4,
} TAG_UNNAMED_205, *PTAG_UNNAMED_205;

struct tagBIND_OPTS3
{
  /* 0x0000 */ long Padding_88[10];
  /* 0x0028 */ struct HWND__* hwnd;
}; /* size: 0x0030 */

enum tagFUNCKIND
{
  FUNC_VIRTUAL = 0,
  FUNC_PUREVIRTUAL = 1,
  FUNC_NONVIRTUAL = 2,
  FUNC_STATIC = 3,
  FUNC_DISPATCH = 4,
};

enum tagINVOKEKIND
{
  INVOKE_FUNC = 1,
  INVOKE_PROPERTYGET = 2,
  INVOKE_PROPERTYPUT = 4,
  INVOKE_PROPERTYPUTREF = 8,
};

struct tagFUNCDESC
{
  /* 0x0000 */ long memid;
  /* 0x0004 */ long Padding_89;
  /* 0x0008 */ long* lprgscode;
  /* 0x0010 */ struct tagELEMDESC* lprgelemdescParam;
  /* 0x0018 */ enum tagFUNCKIND funckind;
  /* 0x001c */ enum tagINVOKEKIND invkind;
  /* 0x0020 */ enum tagCALLCONV callconv;
  /* 0x0024 */ short cParams;
  /* 0x0026 */ short cParamsOpt;
  /* 0x0028 */ short oVft;
  /* 0x002a */ short cScodes;
  /* 0x002c */ long Padding_90;
  /* 0x0030 */ struct tagELEMDESC elemdescFunc;
  /* 0x0050 */ unsigned short wFuncFlags;
  /* 0x0052 */ char __PADDING__[6];
}; /* size: 0x0058 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 5,
  NVld = 0,
  VldEddOffset = 4,
  BufSize = 17,
} TAG_UNNAMED_206, *PTAG_UNNAMED_206;

struct IInternetSecurityMgrSite
{
}; /* size: 0x0008 */

typedef enum _SE_LEARNING_MODE_DATA_TYPE
{
  SeLearningModeInvalidType = 0,
  SeLearningModeSettings = 1,
  SeLearningModeMax = 2,
} SE_LEARNING_MODE_DATA_TYPE, *PSE_LEARNING_MODE_DATA_TYPE;

typedef struct _BYTE_BLOB
{
  /* 0x0000 */ unsigned long clSize;
  /* 0x0004 */ unsigned char abData[1];
  /* 0x0005 */ char __PADDING__[3];
} BYTE_BLOB, *PBYTE_BLOB; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 4,
  NVld = 3,
  VldEddOffset = 0,
  BufSize = 28,
} TAG_UNNAMED_207, *PTAG_UNNAMED_207;

typedef struct __vc_attributes::caseAttribute
{
  /* 0x0000 */ int value;
} _vc_attributes::caseAttribute, *P_vc_attributes::caseAttribute; /* size: 0x0004 */

enum tagSTRRET_TYPE
{
  STRRET_WSTR = 0,
  STRRET_OFFSET = 1,
  STRRET_CSTR = 2,
};

typedef enum
{
  MaxPossibleCpus = 1024,
} TAG_UNNAMED_208, *PTAG_UNNAMED_208;

class CAutoP<XE_LoadedLibrary>
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 5,
  NVld = 0,
  VldEddOffset = 4,
  BufSize = 36,
} TAG_UNNAMED_209, *PTAG_UNNAMED_209;

typedef struct _OLESTREAMVTBL
{
  /* 0x0000 */ void* Get /* function */;
  /* 0x0008 */ void* Put /* function */;
} OLESTREAMVTBL, *POLESTREAMVTBL; /* size: 0x0010 */

typedef enum
{
  VersionEventBufferHeader = 10,
} TAG_UNNAMED_210, *PTAG_UNNAMED_210;

typedef enum
{
  database_idIdx = 0,
  LastField = 1,
} TAG_UNNAMED_211, *PTAG_UNNAMED_211;

enum tagUASFLAGS
{
  UAS_NORMAL = 0,
  UAS_BLOCKED = 1,
  UAS_NOPARENTENABLE = 2,
  UAS_MASK = 3,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 6,
  NVld = 2,
  VldEddOffset = 3,
  BufSize = 33,
} TAG_UNNAMED_212, *PTAG_UNNAMED_212;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 4,
  NVld = 3,
  VldEddOffset = 0,
  BufSize = 32,
} TAG_UNNAMED_213, *PTAG_UNNAMED_213;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 10,
  NVld = 0,
  VldEddOffset = 9,
  BufSize = 68,
} TAG_UNNAMED_214, *PTAG_UNNAMED_214;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 8,
  NVld = 0,
  VldEddOffset = 7,
  BufSize = 40,
} TAG_UNNAMED_215, *PTAG_UNNAMED_215;

struct tagRemSNB
{
  /* 0x0000 */ unsigned long ulCntStr;
  /* 0x0004 */ unsigned long ulCntChar;
  /* 0x0008 */ wchar_t rgString[1];
  /* 0x000a */ char __PADDING__[2];
}; /* size: 0x000c */

enum RESOBJECT_ACTION
{
  RESOBJECT_DELETED = 0,
  RESOBJECT_ADDED = 1,
  RESOBJECT_RESETSTATS = 2,
};

typedef enum
{
  NStatic = 3,
  NCustomizable = 0,
  NDynamic = 1,
  NVld = 0,
  VldEddOffset = 0,
  BufSize = 8,
} TAG_UNNAMED_216, *PTAG_UNNAMED_216;

class TCallbackBase<UnsafeCallbackTraits<TCallback<void,unsigned long *,SOS_Scheduler * const,NullType,NullType> >,void,unsigned long *,SOS_Scheduler * const,NullType,NullType>::ArgCountDiscriminator<0>
{
}; /* size: 0x0001 */

struct ICodeInstall
{
}; /* size: 0x0008 */

enum tagCLSCTX
{
  CLSCTX_INPROC_SERVER = 1,
  CLSCTX_INPROC_HANDLER = 2,
  CLSCTX_LOCAL_SERVER = 4,
  CLSCTX_INPROC_SERVER16 = 8,
  CLSCTX_REMOTE_SERVER = 16,
  CLSCTX_INPROC_HANDLER16 = 32,
  CLSCTX_RESERVED1 = 64,
  CLSCTX_RESERVED2 = 128,
  CLSCTX_RESERVED3 = 256,
  CLSCTX_RESERVED4 = 512,
  CLSCTX_NO_CODE_DOWNLOAD = 1024,
  CLSCTX_RESERVED5 = 2048,
  CLSCTX_NO_CUSTOM_MARSHAL = 4096,
  CLSCTX_ENABLE_CODE_DOWNLOAD = 8192,
  CLSCTX_NO_FAILURE_LOG = 16384,
  CLSCTX_DISABLE_AAA = 0xffff8000,
  CLSCTX_ENABLE_AAA = 0x10000,
  CLSCTX_FROM_DEFAULT_CONTEXT = 0x20000,
  CLSCTX_ACTIVATE_32_BIT_SERVER = 0x40000,
  CLSCTX_ACTIVATE_64_BIT_SERVER = 0x80000,
  CLSCTX_ENABLE_CLOAKING = 0x100000,
  CLSCTX_APPCONTAINER = 0x400000,
  CLSCTX_PS_DLL = -2147483648,
};

struct tagEXTLOGFONTW
{
  /* 0x0000 */ struct tagLOGFONTW elfLogFont;
  /* 0x005c */ wchar_t elfFullName[64];
  /* 0x00dc */ wchar_t elfStyle[32];
  /* 0x011c */ unsigned long elfVersion;
  /* 0x0120 */ unsigned long elfStyleSize;
  /* 0x0124 */ unsigned long elfMatch;
  /* 0x0128 */ unsigned long elfReserved;
  /* 0x012c */ unsigned char elfVendorId[4];
  /* 0x0130 */ unsigned long elfCulture;
  /* 0x0134 */ struct tagPANOSE elfPanose;
  /* 0x013e */ char __PADDING__[2];
}; /* size: 0x0140 */

typedef struct __vc_attributes::emitidlAttribute
{
  union
  {
    /* 0x0000 */ const int restricted;
    /* 0x0000 */ const int forced;
    /* 0x0000 */ const int push;
    /* 0x0000 */ const int pop;
    /* 0x0000 */ int value;
  }; /* size: 0x0004 */
  /* 0x0004 */ BOOL defaultimports;
  /* 0x0005 */ char __PADDING__[3];
} _vc_attributes::emitidlAttribute, *P_vc_attributes::emitidlAttribute; /* size: 0x0008 */

class SEHashTableGrow<XEPackage0::OrphanEntry,XEPackage0::OrphanKey,0,16,XE_BaseAllocator>
{
  /* 0x0000 */ long Padding_91[8];
  /* 0x0020 */ int m_fillFactor;
  /* 0x0024 */ unsigned int m_entryGrowthCount;
  /* 0x0028 */ unsigned int m_bucketMaxCount;
}; /* size: 0x0030 */

typedef enum
{
  source_database_idIdx = 0,
  object_idIdx = 1,
  object_typeIdx = 2,
  durationIdx = 3,
  cpu_timeIdx = 4,
  physical_readsIdx = 5,
  logical_readsIdx = 6,
  writesIdx = 7,
  row_countIdx = 8,
  last_row_countIdx = 9,
  nest_levelIdx = 10,
  line_numberIdx = 11,
  offsetIdx = 12,
  offset_endIdx = 13,
  object_nameIdx = 14,
  statementIdx = 15,
  LastField = 16,
} TAG_UNNAMED_217, *PTAG_UNNAMED_217;

class AutoSpinlockHolder<249,1,1>
{
}; /* size: 0x0010 */

enum tagOLECLOSE
{
  OLECLOSE_SAVEIFDIRTY = 0,
  OLECLOSE_NOSAVE = 1,
  OLECLOSE_PROMPTSAVE = 2,
};

enum cache_type
{
  CLOCK = 0,
  PROBABILISTIC = 1,
};

class XeSqlPkg::exchange_spill
{
  union
  {
    /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
    /* 0x0000 */ struct XE_TEvent<4,0,2> sm_metadata;
    /* 0x0000 */ struct XE_SessionContextList sm_contexts;
    struct
    {
      /* 0x0000 */ const struct _GUID sm_guid;
      /* 0x0010 */ long Padding_92[140];
      /* 0x0240 */ unsigned char m_buf[8];
    }; /* size: 0x0018 */
    /* 0x0000 */ const int query_operation_node_idOffset;
    /* 0x0000 */ const int opcodeOffset;
  }; /* size: 0x0140 */
}; /* size: 0x0248 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 1,
  NVld = 0,
  VldEddOffset = 0,
  BufSize = 4,
} TAG_UNNAMED_218, *PTAG_UNNAMED_218;

class SQLFatalHandlers
{
}; /* size: 0x0001 */

typedef enum
{
  database_idIdx = 0,
  owner_rowsetIdx = 1,
  tracking_table_rowsetIdx = 2,
  secondary_rowsetIdx = 3,
  cleanup_resultIdx = 4,
  LastField = 5,
} TAG_UNNAMED_219, *PTAG_UNNAMED_219;

enum tagExtendedErrorParamTypes
{
  eeptAnsiString = 1,
  eeptUnicodeString = 2,
  eeptLongVal = 3,
  eeptShortVal = 4,
  eeptPointerVal = 5,
  eeptNone = 6,
  eeptBinary = 7,
};

struct tagSTGMEDIUM
{
  /* 0x0000 */ unsigned long tymed;
  /* 0x0004 */ long Padding_93;
  union
  {
    /* 0x0008 */ struct HBITMAP__* hBitmap;
    /* 0x0008 */ void* hMetaFilePict;
    /* 0x0008 */ struct HENHMETAFILE__* hEnhMetaFile;
    /* 0x0008 */ void* hGlobal;
    /* 0x0008 */ wchar_t* lpszFileName;
    /* 0x0008 */ struct IStream* pstm;
    /* 0x0008 */ struct IStorage* pstg;
  }; /* size: 0x0008 */
  /* 0x0010 */ struct IUnknown* pUnkForRelease;
}; /* size: 0x0018 */

typedef enum __MIDL_IInternetZoneManager_0002
{
  ZAFLAGS_CUSTOM_EDIT = 1,
  ZAFLAGS_ADD_SITES = 2,
  ZAFLAGS_REQUIRE_VERIFICATION = 4,
  ZAFLAGS_INCLUDE_PROXY_OVERRIDE = 8,
  ZAFLAGS_INCLUDE_INTRANET_SITES = 16,
  ZAFLAGS_NO_UI = 32,
  ZAFLAGS_SUPPORTS_VERIFICATION = 64,
  ZAFLAGS_UNC_AS_INTRANET = 128,
  ZAFLAGS_DETECT_INTRANET = 256,
  ZAFLAGS_USE_LOCKED_ZONES = 0x10000,
  ZAFLAGS_VERIFY_TEMPLATE_SETTINGS = 0x20000,
  ZAFLAGS_NO_CACHE = 0x40000,
} _MIDL_IInternetZoneManager_0002, *P_MIDL_IInternetZoneManager_0002;

struct IOleItemContainer
{
}; /* size: 0x0008 */

typedef enum
{
  _Allocated = 1,
  _Constant = 2,
  _Dynamic = 4,
  _Frozen = 8,
} TAG_UNNAMED_220, *PTAG_UNNAMED_220;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 0,
  VldEddOffset = 2,
  BufSize = 12,
} TAG_UNNAMED_221, *PTAG_UNNAMED_221;

class XeCloudMinPkg::warmup_partition
{
  union
  {
    /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
    /* 0x0000 */ struct XE_TEvent<4,0,2> sm_metadata;
    /* 0x0000 */ struct XE_SessionContextList sm_contexts;
    struct
    {
      /* 0x0000 */ const struct _GUID sm_guid;
      /* 0x0010 */ long Padding_94[140];
      /* 0x0240 */ unsigned char m_buf[9];
    }; /* size: 0x0019 */
    /* 0x0000 */ const int stateOffset;
    /* 0x0000 */ const int durationOffset;
  }; /* size: 0x0140 */
}; /* size: 0x0250 */

typedef enum
{
  log_block_idIdx = 0,
  log_block_sizeIdx = 1,
  log_buffer_sizeIdx = 2,
  fc_sequenceIdx = 3,
  scan_generationIdx = 4,
  message_log_idIdx = 5,
  log_bufferIdx = 6,
  LastField = 7,
} TAG_UNNAMED_222, *PTAG_UNNAMED_222;

struct TMemoryBlockAllocator<0,16384,524288,8,1>::NodePartitionWithoutActive
{
}; /* size: 0x00c0 */

class PerCPUDataMulti<SOS_MemoryBlockAllocator::ActivePartition>::Reservation<TMemoryBlockAllocator<0,16384,524288,8,1> >
{
  /* 0x0000 */ unsigned __int64 s_reservationOffset;
}; /* size: 0x0001 */

class TMemoryBlockAllocator<0,16384,524288,8,1>
{
  /* 0x0000 */ class TMemoryBlockAllocator<0,16384,524288,8,1> sm_memoryBlockAllocator;
  /* 0x00c0 */ struct TMemoryBlockAllocator<0,16384,524288,8,1>::NodePartitionWithoutActive m_nodePart[64];
  /* 0x30c0 */ class PerCPUDataMulti<SOS_MemoryBlockAllocator::ActivePartition>::Reservation<TMemoryBlockAllocator<0,16384,524288,8,1> > m_reservationForActiveParts;
}; /* size: 0x3100 */

typedef enum _FINDEX_SEARCH_OPS
{
  FindExSearchNameMatch = 0,
  FindExSearchLimitToDirectories = 1,
  FindExSearchLimitToDevices = 2,
  FindExSearchMaxSearchOp = 3,
} FINDEX_SEARCH_OPS, *PFINDEX_SEARCH_OPS;

class AutoSpinlockHolder<236,1,1>
{
}; /* size: 0x0010 */

enum tagOLEDCFLAGS
{
  OLEDC_NODRAW = 1,
  OLEDC_PAINTBKGND = 2,
  OLEDC_OFFSCREEN = 4,
};

class XeCloudMinPkg::ping_dispatch_received
{
  union
  {
    /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
    /* 0x0000 */ struct XE_TEvent<4,0,3> sm_metadata;
    /* 0x0000 */ struct XE_SessionContextList sm_contexts;
    struct
    {
      /* 0x0000 */ const struct _GUID sm_guid;
      /* 0x0010 */ long Padding_95[140];
      /* 0x0240 */ unsigned char m_buf[24];
    }; /* size: 0x0028 */
    /* 0x0000 */ const int message_idOffset;
    /* 0x0000 */ const int destination_idOffset;
    /* 0x0000 */ const int function_nameOffset;
  }; /* size: 0x0168 */
}; /* size: 0x0258 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 4,
  NVld = 0,
  VldEddOffset = 3,
  BufSize = 16,
} TAG_UNNAMED_223, *PTAG_UNNAMED_223;

class AutoSpinlockHolder<178,3,1>;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 5,
  NVld = 0,
  VldEddOffset = 4,
  BufSize = 36,
} TAG_UNNAMED_224, *PTAG_UNNAMED_224;

enum SQLDUMPER_ERRORS
{
  SQLDUMPER_APP_ERROR_FLAG = 0x20000000,
  SQLDUMPER_INCOMPLETE = 0,
  SQLDUMPER_NO_ERROR = 0x20000001,
  SQLDUMPER_CREATE_DUMP = 0x20000002,
  SQLDUMPER_CREATE_MFST = 0x20000004,
  SQLDUMPER_OPEN_PROCESS = 0x20000008,
  SQLDUMPER_MINI_DUMP = 0x20000010,
  SQLDUMPER_REG_READ = 0x20000020,
  SQLDUMPER_START_DW = 0x20000040,
  SQLDUMPER_WRITE_MFST = 0x20000080,
  SQLDUMPER_VERSION = 0x20000100,
  SQLDUMPER_REMOTE_READ = 0x20000200,
  SQLDUMPER_REMOTE_CHECKSUM = 0x20000400,
  SQLDUMPER_REMOTE_SANITY = 0x20000800,
  SQLDUMPER_USAGE = 0x20001000,
  SQLDUMPER_SENT_DUMP = 0x20002000,
  SQLDUMPER_IMAGE_CORRUPTION = 0x20004000,
  SQLDUMPER_CHILD_FAILED = 0x20008000,
};

enum TCacheStore<CacheProbabilisticAlgorithm>::InsertOptions
{
  SkipNoHashTable = 0,
  SkipMainHashTable = 1,
  SkipTokenHashTable = 2,
};

class Spinlock<318,1,1>
{
}; /* size: 0x0004 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 0,
  VldEddOffset = 2,
  BufSize = 12,
} TAG_UNNAMED_225, *PTAG_UNNAMED_225;

typedef enum
{
  database_idIdx = 0,
  rowset_idIdx = 1,
  delta_store_idIdx = 2,
  LastField = 3,
} TAG_UNNAMED_226, *PTAG_UNNAMED_226;

struct HRSRC__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

typedef enum
{
  NStatic = 3,
  NCustomizable = 0,
  NDynamic = 2,
  NVld = 0,
  VldEddOffset = 1,
  BufSize = 8,
} TAG_UNNAMED_227, *PTAG_UNNAMED_227;

enum tagSYSKIND
{
  SYS_WIN16 = 0,
  SYS_WIN32 = 1,
  SYS_MAC = 2,
  SYS_WIN64 = 3,
};

typedef struct _KAFFINITY_EX
{
  /* 0x0000 */ unsigned short Count;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ unsigned __int64 Bitmap[8];
} KAFFINITY_EX, *PKAFFINITY_EX; /* size: 0x0048 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 2,
  NVld = 1,
  VldEddOffset = 0,
  BufSize = 12,
} TAG_UNNAMED_228, *PTAG_UNNAMED_228;

class AutoSpinlockHolder<274,4,1>;

typedef enum _PROCESS_INFORMATION_CLASS
{
  ProcessMemoryPriority = 0,
  ProcessInformationClassMax = 1,
} PROCESS_INFORMATION_CLASS, *PPROCESS_INFORMATION_CLASS;

typedef enum
{
  NStatic = 4,
  NCustomizable = 2,
  NDynamic = 4,
  NVld = 3,
  VldEddOffset = 0,
  BufSize = 25,
} TAG_UNNAMED_229, *PTAG_UNNAMED_229;

class SEList<TCallback<void,SOS_Task *,SchedulerMonitor::Track const *,NullType,NullType>,0>
{
  /* 0x0000 */ class ListBase m_list;
}; /* size: 0x0010 */

class XE_AutoP<TSinglyLinkedList<XE_ConfigCrc> >
{
}; /* size: 0x0008 */

enum tagApplicationType
{
  ServerApplication = 0,
  LibraryApplication = 1,
};

struct IXMLDOMNodeList
{
}; /* size: 0x0008 */

typedef enum __MIDL_IAuthenticateEx_0001
{
  AUTHENTICATEF_PROXY = 1,
  AUTHENTICATEF_BASIC = 2,
  AUTHENTICATEF_HTTP = 4,
} _MIDL_IAuthenticateEx_0001, *P_MIDL_IAuthenticateEx_0001;

typedef enum
{
  database_idIdx = 0,
  database_segment_idIdx = 1,
  file_idIdx = 2,
  LastField = 3,
} TAG_UNNAMED_230, *PTAG_UNNAMED_230;

typedef enum
{
  countIdx = 0,
  node_idIdx = 1,
  LastField = 2,
} TAG_UNNAMED_231, *PTAG_UNNAMED_231;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 4,
  NVld = 1,
  VldEddOffset = 2,
  BufSize = 21,
} TAG_UNNAMED_232, *PTAG_UNNAMED_232;

class CAutoBase<XE_ConfigCrc>
{
  /* 0x0000 */ struct XE_ConfigCrc* m_pt;
}; /* size: 0x0008 */

enum tag_WBEM_TIMEOUT_TYPE
{
  WBEM_NO_WAIT = 0,
  WBEM_INFINITE = -1,
};

struct IWbemQualifierSet
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 1,
  NVld = 0,
  VldEddOffset = 0,
  BufSize = 1,
} TAG_UNNAMED_233, *PTAG_UNNAMED_233;

typedef struct _ldiv_t
{
  /* 0x0000 */ long quot;
  /* 0x0004 */ long rem;
} ldiv_t, *Pldiv_t; /* size: 0x0008 */

enum tagDESCKIND
{
  DESCKIND_NONE = 0,
  DESCKIND_FUNCDESC = 1,
  DESCKIND_VARDESC = 2,
  DESCKIND_TYPECOMP = 3,
  DESCKIND_IMPLICITAPPOBJ = 4,
  DESCKIND_MAX = 5,
};

class SpinlockHolder<143,4,1>;

struct XPRESS9_DECODER_T;

enum tag_WBEM_REFRESHER_FLAGS
{
  WBEM_FLAG_REFRESH_AUTO_RECONNECT = 0,
  WBEM_FLAG_REFRESH_NO_AUTO_RECONNECT = 1,
};

struct XEAPI
{
  /* 0x0000 */ unsigned short m_version;
  /* 0x0002 */ char Padding_96[6];
  /* 0x0008 */ const wchar_t* m_name;
}; /* size: 0x0010 */

struct XEEngineClientAPI
{
  /* 0x0000 */ struct XEAPI m_header;
  /* 0x0010 */ void* LockEngineForSearch /* function */;
  /* 0x0018 */ void* UnlockEngineForSearch /* function */;
  /* 0x0020 */ void* Initialize /* function */;
  /* 0x0028 */ void* IsInitialized /* function */;
  /* 0x0030 */ void* Finalize /* function */;
  /* 0x0038 */ void* EnumBegin /* function */;
  /* 0x0040 */ void* EnumSessionBegin /* function */;
  /* 0x0048 */ void* EnumNext /* function */;
  /* 0x0050 */ void* EnumEnd /* function */;
  /* 0x0058 */ void* GetPackageById /* function */;
  /* 0x0060 */ void* GetPackageMetadata /* function */;
  /* 0x0068 */ void* ResolveNameByType /* function */;
  /* 0x0070 */ void* ResolveHandle /* function */;
  /* 0x0078 */ void* ResolveObject /* function */;
  /* 0x0080 */ void* ResolvePackage /* function */;
  /* 0x0088 */ void* ResolveEvent /* function */;
  /* 0x0090 */ void* ResolvePredicate /* function */;
  /* 0x0098 */ void* GetObjectAttributes /* function */;
  /* 0x00a0 */ void* CreatePackageHolder /* function */;
  /* 0x00a8 */ void* CreateSession /* function */;
  /* 0x00b0 */ void* GetSessionProperties /* function */;
  /* 0x00b8 */ void* GetSessionStats /* function */;
  /* 0x00c0 */ void* FlushSession /* function */;
  /* 0x00c8 */ void* OpenChangelist /* function */;
  /* 0x00d0 */ void* CommitChangelist /* function */;
  /* 0x00d8 */ void* DiscardChangelist /* function */;
  /* 0x00e0 */ void* AddTarget /* function */;
  /* 0x00e8 */ void* RemoveTarget /* function */;
  /* 0x00f0 */ void* EnableEvent /* function */;
  /* 0x00f8 */ void* DisableEvent /* function */;
  /* 0x0100 */ void* CreateEventFieldPredicateLeaf /* function */;
  /* 0x0108 */ void* CreateGlobalPredicateLeaf /* function */;
  /* 0x0110 */ void* CreatePredicateNode /* function */;
  /* 0x0118 */ void* IsEventEnabled /* function */;
  /* 0x0120 */ void* GetTargetState /* function */;
  /* 0x0128 */ void* AcquireObjectReference /* function */;
  /* 0x0130 */ void* ReleaseObjectReference /* function */;
  /* 0x0138 */ void* RegisterNotification /* function */;
  /* 0x0140 */ void* UnregisterNotification /* function */;
  /* 0x0148 */ void* SetLocalStorage /* function */;
  /* 0x0150 */ void* GetLocalStorage /* function */;
  /* 0x0158 */ void* SetDiagnosticLevel /* function */;
  /* 0x0160 */ void* SetCustomizationFlags /* function */;
  /* 0x0168 */ void* GetTransferActivityId /* function */;
  /* 0x0170 */ void* SetTransferActivityId /* function */;
  /* 0x0178 */ void* ChangeActivityId /* function */;
  /* 0x0180 */ void* GetLastErrorContext /* function */;
  /* 0x0188 */ void* SetPendingInitialize /* function */;
  /* 0x0190 */ void* IsPendingInitialize /* function */;
  /* 0x0198 */ void* GetTargetPrivateAPI /* function */;
  /* 0x01a0 */ void* GetLocalizedString /* function */;
  /* 0x01a8 */ void* SetSessionFlushTimeout /* function */;
  /* 0x01b0 */ void* CloseSession /* function */;
}; /* size: 0x01b8 */

typedef struct _USER_MODALS_INFO_1005
{
  /* 0x0000 */ unsigned long usrmod1005_password_hist_len;
} USER_MODALS_INFO_1005, *PUSER_MODALS_INFO_1005; /* size: 0x0004 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 10,
  NVld = 0,
  VldEddOffset = 9,
  BufSize = 40,
} TAG_UNNAMED_234, *PTAG_UNNAMED_234;

class ThreadScheduler
{
}; /* size: 0xf0a0 */

enum tagPENDINGTYPE
{
  PENDINGTYPE_TOPLEVEL = 1,
  PENDINGTYPE_NESTED = 2,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 2,
  NDynamic = 16,
  NVld = 2,
  VldEddOffset = 13,
  BufSize = 88,
} TAG_UNNAMED_235, *PTAG_UNNAMED_235;

struct tagHARDWAREINPUT
{
  /* 0x0000 */ unsigned long uMsg;
  /* 0x0004 */ unsigned short wParamL;
  /* 0x0006 */ unsigned short wParamH;
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 3,
  NCustomizable = 0,
  NDynamic = 1,
  NVld = 0,
  VldEddOffset = 0,
  BufSize = 4,
} TAG_UNNAMED_236, *PTAG_UNNAMED_236;

typedef enum _MANDATORY_LEVEL
{
  MandatoryLevelUntrusted = 0,
  MandatoryLevelLow = 1,
  MandatoryLevelMedium = 2,
  MandatoryLevelHigh = 3,
  MandatoryLevelSystem = 4,
  MandatoryLevelSecureProcess = 5,
  MandatoryLevelCount = 6,
} MANDATORY_LEVEL, *PMANDATORY_LEVEL;

enum tagCOINITBASE
{
  COINITBASE_MULTITHREADED = 0,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 7,
  NVld = 1,
  VldEddOffset = 5,
  BufSize = 36,
} TAG_UNNAMED_237, *PTAG_UNNAMED_237;

typedef enum
{
  countIdx = 0,
  database_idIdx = 1,
  LastField = 2,
} TAG_UNNAMED_238, *PTAG_UNNAMED_238;

typedef struct _HEAP_SUMMARY
{
  /* 0x0000 */ unsigned long cb;
  /* 0x0004 */ long Padding_97;
  /* 0x0008 */ unsigned __int64 cbAllocated;
  /* 0x0010 */ unsigned __int64 cbCommitted;
  /* 0x0018 */ unsigned __int64 cbReserved;
  /* 0x0020 */ unsigned __int64 cbMaxReserve;
} HEAP_SUMMARY, *PHEAP_SUMMARY; /* size: 0x0028 */

enum tag_WBEM_FLAVOR_TYPE
{
  WBEM_FLAVOR_DONT_PROPAGATE = 0,
  WBEM_FLAVOR_FLAG_PROPAGATE_TO_INSTANCE = 1,
  WBEM_FLAVOR_FLAG_PROPAGATE_TO_DERIVED_CLASS = 2,
  WBEM_FLAVOR_MASK_PROPAGATION = 15,
  WBEM_FLAVOR_OVERRIDABLE = 0,
  WBEM_FLAVOR_NOT_OVERRIDABLE = 16,
  WBEM_FLAVOR_MASK_PERMISSIONS = 16,
  WBEM_FLAVOR_ORIGIN_LOCAL = 0,
  WBEM_FLAVOR_ORIGIN_PROPAGATED = 32,
  WBEM_FLAVOR_ORIGIN_SYSTEM = 64,
  WBEM_FLAVOR_MASK_ORIGIN = 96,
  WBEM_FLAVOR_NOT_AMENDED = 0,
  WBEM_FLAVOR_AMENDED = 128,
  WBEM_FLAVOR_MASK_AMENDED = 128,
};

typedef enum
{
  modeIdx = 0,
  durationIdx = 1,
  file_handleIdx = 2,
  offsetIdx = 3,
  database_idIdx = 4,
  file_idIdx = 5,
  filegroup_idIdx = 6,
  sizeIdx = 7,
  pathIdx = 8,
  LastField = 9,
} TAG_UNNAMED_239, *PTAG_UNNAMED_239;

struct XE_LogDefaultMetadataHeader
{
  /* 0x0000 */ struct _GUID m_metadataSignature;
  /* 0x0010 */ unsigned short m_metadataGeneration;
  /* 0x0012 */ unsigned short m_padding;
}; /* size: 0x0014 */

struct _HREGREADBATCHREPLY;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 0,
  NVld = 0,
  VldEddOffset = -1,
  BufSize = 0,
} TAG_UNNAMED_240, *PTAG_UNNAMED_240;

enum XESessionFlags
{
  XESF_NONE = 0,
  XESF_FLUSH_BUFFERS_ON_CLOSE = 1,
  XESF_DEDICATED_DISPATCHER = 2,
  XESF_ALLOW_RECURSIVE_EVENTS = 4,
  XESF_TRACK_CAUSALITY = 8,
  XESF_HIDDEN = 16,
  XESF_ZEROBUFFERS = 32,
  XESF_VERIFY = 64,
  XESF_CLOSING = 128,
  XESF_DEFAULT = 1,
};

typedef struct _SHITEMID
{
  /* 0x0000 */ unsigned short cb;
  /* 0x0002 */ unsigned char abID[1];
} SHITEMID, *PSHITEMID; /* size: 0x0003 */

typedef struct _ITEMIDLIST
{
  /* 0x0000 */ struct _SHITEMID mkid;
} ITEMIDLIST, *PITEMIDLIST; /* size: 0x0003 */

class DmpPointer<_FIBER>
{
  /* 0x0000 */ struct _FIBER* m_pRaw;
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 18,
  NVld = 7,
  VldEddOffset = 10,
  BufSize = 131,
} TAG_UNNAMED_241, *PTAG_UNNAMED_241;

class XeSqlPkg::oledb_call
{
  union
  {
    /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
    /* 0x0000 */ struct XE_TEvent<4,0,7> sm_metadata;
    /* 0x0000 */ struct XE_SessionContextList sm_contexts;
    struct
    {
      /* 0x0000 */ const struct _GUID sm_guid;
      /* 0x0010 */ long Padding_98[140];
      /* 0x0240 */ unsigned char m_buf[48];
    }; /* size: 0x0040 */
    /* 0x0000 */ const int opcodeOffset;
    /* 0x0000 */ const int hresultOffset;
    /* 0x0000 */ const int durationOffset;
    /* 0x0000 */ const int linked_server_nameOffset;
    /* 0x0000 */ const int provider_nameOffset;
    /* 0x0000 */ const int method_nameOffset;
    /* 0x0000 */ const int parametersOffset;
  }; /* size: 0x0208 */
}; /* size: 0x0270 */

enum tagPictureAttributes
{
  PICTURE_SCALABLE = 1,
  PICTURE_TRANSPARENT = 2,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 5,
  NVld = 0,
  VldEddOffset = 4,
  BufSize = 24,
} TAG_UNNAMED_242, *PTAG_UNNAMED_242;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 5,
  NVld = 0,
  VldEddOffset = 4,
  BufSize = 29,
} TAG_UNNAMED_243, *PTAG_UNNAMED_243;

enum tag_WBEM_QUERY_FLAG_TYPE
{
  WBEM_FLAG_DEEP = 0,
  WBEM_FLAG_SHALLOW = 1,
  WBEM_FLAG_PROTOTYPE = 2,
};

enum tagGLOBALOPT_PROPERTIES
{
  COMGLB_EXCEPTION_HANDLING = 1,
  COMGLB_APPID = 2,
  COMGLB_RPC_THREADPOOL_SETTING = 3,
  COMGLB_RO_SETTINGS = 4,
};

struct tagCOLORCORRECTPALETTE
{
  /* 0x0000 */ struct tagEMR emr;
  /* 0x0008 */ unsigned long ihPalette;
  /* 0x000c */ unsigned long nFirstEntry;
  /* 0x0010 */ unsigned long nPalEntries;
  /* 0x0014 */ unsigned long nReserved;
}; /* size: 0x0018 */

enum ESqlGlobalSKU
{
  x_dwUnknownSKU = 0,
  x_dwSqlWIDSKU = 1,
  x_dwSqlMSOSKU = 2,
};

enum LATENCY_TIME
{
  LT_DONT_CARE = 0,
  LT_LOWEST_LATENCY = 1,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 0,
  VldEddOffset = 2,
  BufSize = 12,
} TAG_UNNAMED_244, *PTAG_UNNAMED_244;

typedef enum
{
  NStatic = 3,
  NCustomizable = 0,
  NDynamic = 2,
  NVld = 0,
  VldEddOffset = 1,
  BufSize = 8,
} TAG_UNNAMED_245, *PTAG_UNNAMED_245;

typedef enum
{
  countIdx = 0,
  incrementIdx = 1,
  database_idIdx = 2,
  LastField = 3,
} TAG_UNNAMED_246, *PTAG_UNNAMED_246;

class XE_AutoP<XE_LogWriter<XE_MetadataEncoder<XE_FileWriter<XE_FileWriterDefaultPolicy<1,&XEPackage0::DefaultFileExtenstion>,XE_MetadataTracker> > > >
{
}; /* size: 0x0008 */

typedef enum __MIDL_IInternetSecurityManager_0002
{
  PUAFOUT_DEFAULT = 0,
  PUAFOUT_ISLOCKZONEPOLICY = 1,
} _MIDL_IInternetSecurityManager_0002, *P_MIDL_IInternetSecurityManager_0002;

typedef struct _FILE_COMPLETION_INFORMATION
{
  /* 0x0000 */ void* Port;
  /* 0x0008 */ void* Key;
} FILE_COMPLETION_INFORMATION, *PFILE_COMPLETION_INFORMATION; /* size: 0x0010 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 8,
  NVld = 0,
  VldEddOffset = 7,
  BufSize = 33,
} TAG_UNNAMED_247, *PTAG_UNNAMED_247;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 9,
  NVld = 0,
  VldEddOffset = 8,
  BufSize = 68,
} TAG_UNNAMED_248, *PTAG_UNNAMED_248;

typedef enum __MIDL_IBindStatusCallback_0004
{
  URL_ENCODING_NONE = 0,
  URL_ENCODING_ENABLE_UTF8 = 0x10000000,
  URL_ENCODING_DISABLE_UTF8 = 0x20000000,
} _MIDL_IBindStatusCallback_0004, *P_MIDL_IBindStatusCallback_0004;

struct XEBufferHeader
{
  union
  {
    /* 0x0000 */ const unsigned int INVALID_SEQUENCE_NUMBER;
    /* 0x0000 */ unsigned short m_version;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned int m_id;
  /* 0x0008 */ unsigned int m_sequenceNumber;
  /* 0x000c */ unsigned char m_targetPrivateData[64];
}; /* size: 0x004c */

typedef enum
{
  NextPtrOffset = 8,
} TAG_UNNAMED_249, *PTAG_UNNAMED_249;

typedef enum
{
  cm_addressIdx = 0,
  LastField = 1,
} TAG_UNNAMED_250, *PTAG_UNNAMED_250;

typedef struct __vc_attributes::helper_attributes::v1_earlyAttribute
{
} _vc_attributes::helper_attributes::v1_earlyAttribute, *P_vc_attributes::helper_attributes::v1_earlyAttribute; /* size: 0x0001 */

enum STUB_PHASE
{
  STUB_UNMARSHAL = 0,
  STUB_CALL_SERVER = 1,
  STUB_MARSHAL = 2,
  STUB_CALL_SERVER_NO_HRESULT = 3,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 0,
  VldEddOffset = 2,
  BufSize = 20,
} TAG_UNNAMED_251, *PTAG_UNNAMED_251;

struct TClassName<unsigned short,1,0>
{
  /* 0x0000 */ const wchar_t* Value;
  /* 0x0008 */ char __PADDING__[4294967289];
}; /* size: 0x0001 */

typedef enum
{
  source_database_idIdx = 0,
  object_idIdx = 1,
  line_numberIdx = 2,
  offsetIdx = 3,
  offset_endIdx = 4,
  partial_textIdx = 5,
  LastField = 6,
} TAG_UNNAMED_252, *PTAG_UNNAMED_252;

struct XE_TArray<XEDataAttribute,1>
{
  /* 0x0000 */ struct XEDataAttribute m_array[1];
}; /* size: 0x0028 */

struct XE_TEvent<4,0,1>
{
  /* 0x0000 */ struct XE_TArray<XEStaticAttribute,4> m_staticAttr;
  /* 0x00a0 */ struct XE_TArray<XECustomizableAttribute,0> m_customizableAttr;
  /* 0x00a8 */ struct XE_TArray<XEDataAttribute,1> m_dynamicAttr;
  /* 0x00d0 */ struct XEEvent m_event;
}; /* size: 0x0118 */

class XeSqlPkg::checkpoint_end
{
  union
  {
    /* 0x0000 */ const unsigned int sm_internalBitmapOffset;
    /* 0x0000 */ struct XE_TEvent<4,0,1> sm_metadata;
    /* 0x0000 */ struct XE_SessionContextList sm_contexts;
    struct
    {
      /* 0x0000 */ const struct _GUID sm_guid;
      /* 0x0010 */ long Padding_99[140];
      /* 0x0240 */ unsigned char m_buf[4];
    }; /* size: 0x0014 */
    /* 0x0000 */ const int database_idOffset;
  }; /* size: 0x0118 */
}; /* size: 0x0248 */

enum IMPORT_OBJECT_TYPE
{
  IMPORT_OBJECT_CODE = 0,
  IMPORT_OBJECT_DATA = 1,
  IMPORT_OBJECT_CONST = 2,
};

typedef enum
{
  request_typeIdx = 0,
  db_idIdx = 1,
  table_idIdx = 2,
  index_idIdx = 3,
  hash_valueIdx = 4,
  cache_descriptorIdx = 5,
  cache_unique_idIdx = 6,
  LastField = 7,
} TAG_UNNAMED_253, *PTAG_UNNAMED_253;

enum XEObjectStorageFlags
{
  XEOSF_EVENT = 0,
  XEOSF_SESSION = 1,
  XEOSF_DEFAULT = 0,
};

typedef struct _TRANSACTION_ENLISTMENT_PAIR
{
  /* 0x0000 */ struct _GUID EnlistmentId;
  /* 0x0010 */ struct _GUID ResourceManagerId;
} TRANSACTION_ENLISTMENT_PAIR, *PTRANSACTION_ENLISTMENT_PAIR; /* size: 0x0020 */

typedef struct _TRANSACTION_SUPERIOR_ENLISTMENT_INFORMATION
{
  /* 0x0000 */ struct _TRANSACTION_ENLISTMENT_PAIR SuperiorEnlistmentPair;
} TRANSACTION_SUPERIOR_ENLISTMENT_INFORMATION, *PTRANSACTION_SUPERIOR_ENLISTMENT_INFORMATION; /* size: 0x0020 */

typedef struct _tagCODEBASEHOLD
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ long Padding_100;
  /* 0x0008 */ wchar_t* szDistUnit;
  /* 0x0010 */ wchar_t* szCodeBase;
  /* 0x0018 */ unsigned long dwVersionMS;
  /* 0x001c */ unsigned long dwVersionLS;
  /* 0x0020 */ unsigned long dwStyle;
  /* 0x0024 */ long __PADDING__[1];
} tagCODEBASEHOLD, *PtagCODEBASEHOLD; /* size: 0x0028 */

typedef enum
{
  countIdx = 0,
  cursor_typeIdx = 1,
  LastField = 2,
} TAG_UNNAMED_254, *PTAG_UNNAMED_254;

struct tagRECT
{
  /* 0x0000 */ long left;
  /* 0x0004 */ long top;
  /* 0x0008 */ long right;
  /* 0x000c */ long bottom;
}; /* size: 0x0010 */

struct tagTITLEBARINFO
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ struct tagRECT rcTitleBar;
  /* 0x0014 */ unsigned long rgstate[6];
}; /* size: 0x002c */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 1,
  NVld = 0,
  VldEddOffset = 0,
  BufSize = 4,
} TAG_UNNAMED_255, *PTAG_UNNAMED_255;

struct PROCESSOR_IDLESTATE_INFO
{
  /* 0x0000 */ unsigned long TimeCheck;
  /* 0x0004 */ unsigned char DemotePercent;
  /* 0x0005 */ unsigned char PromotePercent;
  /* 0x0006 */ unsigned char Spare[2];
}; /* size: 0x0008 */

typedef enum
{
  agent_idIdx = 0,
  agent_addressIdx = 1,
  LastField = 2,
} TAG_UNNAMED_256, *PTAG_UNNAMED_256;

enum tag_WBEM_CHANGE_FLAG_TYPE
{
  WBEM_FLAG_CREATE_OR_UPDATE = 0,
  WBEM_FLAG_UPDATE_ONLY = 1,
  WBEM_FLAG_CREATE_ONLY = 2,
  WBEM_FLAG_UPDATE_COMPATIBLE = 0,
  WBEM_FLAG_UPDATE_SAFE_MODE = 32,
  WBEM_FLAG_UPDATE_FORCE_MODE = 64,
  WBEM_MASK_UPDATE_MODE = 96,
  WBEM_FLAG_ADVISORY = 0x10000,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 1,
  NVld = 1,
  VldEddOffset = -1,
  BufSize = 8,
} TAG_UNNAMED_257, *PTAG_UNNAMED_257;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 15,
  NVld = 9,
  VldEddOffset = 5,
  BufSize = 110,
} TAG_UNNAMED_258, *PTAG_UNNAMED_258;

enum tag_WBEM_INFORMATION_FLAG_TYPE
{
  WBEM_FLAG_SHORT_NAME = 1,
  WBEM_FLAG_LONG_NAME = 2,
};

enum XeSqlPkg::execution_warning::CustomizableSlots
{
  collect_server_memory_grantsSlot = 0,
};

typedef struct __vc_attributes::v1_enumAttribute
{
} _vc_attributes::v1_enumAttribute, *P_vc_attributes::v1_enumAttribute; /* size: 0x0001 */

typedef enum _TRANSACTION_OUTCOME
{
  TransactionOutcomeUndetermined = 1,
  TransactionOutcomeCommitted = 2,
  TransactionOutcomeAborted = 3,
} TRANSACTION_OUTCOME, *PTRANSACTION_OUTCOME;

enum tagADVF
{
  ADVF_NODATA = 1,
  ADVF_PRIMEFIRST = 2,
  ADVF_ONLYONCE = 4,
  ADVF_DATAONSTOP = 64,
  ADVFCACHE_NOHANDLER = 8,
  ADVFCACHE_FORCEBUILTIN = 16,
  ADVFCACHE_ONSAVE = 32,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 1,
  NVld = 0,
  VldEddOffset = 0,
  BufSize = 4,
} TAG_UNNAMED_259, *PTAG_UNNAMED_259;

typedef enum
{
  database_idIdx = 0,
  LastField = 1,
} TAG_UNNAMED_260, *PTAG_UNNAMED_260;

enum XE_ConfiguredSession::XECreateSessionOptions
{
  XECS_DEFAULT = 0,
  XECS_NO_TARGETS = 1,
  XECS_ENABLE_EVENTS_IN_ALL_PACKAGES = 2,
  XECS_DEFER_EVENT_RESOLUTION = 4,
};

typedef struct _MOF_FIELD
{
  /* 0x0000 */ unsigned __int64 DataPtr;
  /* 0x0008 */ unsigned long Length;
  /* 0x000c */ unsigned long DataType;
} MOF_FIELD, *PMOF_FIELD; /* size: 0x0010 */

typedef enum
{
  countIdx = 0,
  LastField = 1,
} TAG_UNNAMED_261, *PTAG_UNNAMED_261;

class type_info
{
  /* 0x0000 */ long Padding_101[2];
  /* 0x0008 */ void* _M_data;
  /* 0x0010 */ char _M_d_name[1];
}; /* size: 0x0018 */

struct IPropertyStorage
{
}; /* size: 0x0008 */

struct IXMLDOMText
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 3,
  NVld = 0,
  VldEddOffset = 2,
  BufSize = 24,
} TAG_UNNAMED_262, *PTAG_UNNAMED_262;

struct RPC_CLIENT_INFORMATION1
{
  /* 0x0000 */ unsigned char* UserName;
  /* 0x0008 */ unsigned char* ComputerName;
  /* 0x0010 */ unsigned short Privilege;
  /* 0x0012 */ char Padding_102[2];
  /* 0x0014 */ unsigned long AuthFlags;
}; /* size: 0x0018 */

enum tagSTGTY
{
  STGTY_STORAGE = 1,
  STGTY_STREAM = 2,
  STGTY_LOCKBYTES = 3,
  STGTY_PROPERTY = 4,
};

enum tagShutdownType
{
  IdleShutdown = 0,
  ForcedShutdown = 1,
};

typedef struct _SYSTEM_CONSOLE_INFORMATION
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long DriverLoaded : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long Spare : 31; /* bit position: 1 */
  }; /* bitfield */
} SYSTEM_CONSOLE_INFORMATION, *PSYSTEM_CONSOLE_INFORMATION; /* size: 0x0004 */

typedef enum
{
  modeIdx = 0,
  file_handleIdx = 1,
  offsetIdx = 2,
  database_idIdx = 3,
  file_idIdx = 4,
  filegroup_idIdx = 5,
  sizeIdx = 6,
  pathIdx = 7,
  io_dataIdx = 8,
  LastField = 9,
} TAG_UNNAMED_263, *PTAG_UNNAMED_263;

typedef enum __vc_attributes::helper_attributes::usageAttribute::usage_e
{
  eAnyUsage = 0,
  eCoClassUsage = 1,
  eCOMInterfaceUsage = 2,
  eInterfaceUsage = 6,
  eMemberUsage = 8,
  eMethodUsage = 16,
  eInterfaceMethodUsage = 32,
  eInterfaceMemberUsage = 64,
  eCoClassMemberUsage = 128,
  eCoClassMethodUsage = 256,
  eGlobalMethodUsage = 768,
  eGlobalDataUsage = 1024,
  eClassUsage = 2048,
  eInterfaceParameterUsage = 4096,
  eMethodParameterUsage = 12288,
  eIDLModuleUsage = 16384,
  eAnonymousUsage = 0xffff8000,
  eTypedefUsage = 0x10000,
  eUnionUsage = 0x20000,
  eEnumUsage = 0x40000,
  eDefineTagUsage = 0x80000,
  eStructUsage = 0x100000,
  eLocalUsage = 0x200000,
  ePropertyUsage = 0x400000,
  eEventUsage = 0x800000,
  eTemplateUsage = 0x1000000,
  eModuleUsage = 0x1000000,
  eIllegalUsage = 0x2000000,
  eAsynchronousUsage = 0x4000000,
  eAnyIDLUsage = 0x3f7fff,
} _vc_attributes::helper_attributes::usageAttribute::usage_e, *P_vc_attributes::helper_attributes::usageAttribute::usage_e;

enum tagDATADIR
{
  DATADIR_GET = 1,
  DATADIR_SET = 2,
};

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 6,
  NVld = 0,
  VldEddOffset = 5,
  BufSize = 28,
} TAG_UNNAMED_264, *PTAG_UNNAMED_264;

typedef enum
{
  iterator_typeIdx = 0,
  input_requiredIdx = 1,
  input_additionalIdx = 2,
  output_requiredIdx = 3,
  output_additionalIdx = 4,
  bitmap_preferredIdx = 5,
  LastField = 6,
} TAG_UNNAMED_265, *PTAG_UNNAMED_265;

struct IPersistMoniker
{
}; /* size: 0x0008 */

typedef enum
{
  NStatic = 3,
  NCustomizable = 0,
  NDynamic = 1,
  NVld = 0,
  VldEddOffset = 0,
  BufSize = 4,
} TAG_UNNAMED_266, *PTAG_UNNAMED_266;

typedef enum _APTTYPEQUALIFIER
{
  APTTYPEQUALIFIER_NONE = 0,
  APTTYPEQUALIFIER_IMPLICIT_MTA = 1,
  APTTYPEQUALIFIER_NA_ON_MTA = 2,
  APTTYPEQUALIFIER_NA_ON_STA = 3,
  APTTYPEQUALIFIER_NA_ON_IMPLICIT_MTA = 4,
  APTTYPEQUALIFIER_NA_ON_MAINSTA = 5,
  APTTYPEQUALIFIER_APPLICATION_STA = 6,
} APTTYPEQUALIFIER, *PAPTTYPEQUALIFIER;

class AutoSpinlockHolder<93,11,1>;

typedef enum __vc_attributes::threadingAttribute::threading_e
{
  apartment = 1,
  single = 2,
  free = 3,
  neutral = 4,
  both = 5,
} _vc_attributes::threadingAttribute::threading_e, *P_vc_attributes::threadingAttribute::threading_e;

struct tagEMRROUNDRECT
{
  /* 0x0000 */ struct tagEMR emr;
  /* 0x0008 */ struct _RECTL rclBox;
  /* 0x0018 */ struct tagSIZE szlCorner;
}; /* size: 0x0020 */

class XEPackage0::XE_LiveEncoder
{
  /* 0x0000 */ long Padding_103[2];
  /* 0x0008 */ class XEPackage0::XE_LiveWriter* m_pLiveWriter;
}; /* size: 0x0010 */

class XE_CompressionEncoder<XEPackage0::XE_LiveEncoder>
{
  /* 0x0000 */ class XEPackage0::XE_LiveEncoder m_encoder;
  /* 0x0010 */ class XE_CompressionCache m_compressionCache;
  /* 0x0038 */ class XE_ILogWriteMessageHandler* m_msgHandler;
}; /* size: 0x0040 */

class XE_MetadataEncoder<XE_CompressionEncoder<XEPackage0::XE_LiveEncoder> >
{
  /* 0x0000 */ class XE_CompressionEncoder<XEPackage0::XE_LiveEncoder> m_encoder;
  /* 0x0040 */ class XE_MetadataTracker* m_pMetadataSource;
}; /* size: 0x0048 */

class XE_LogWriter<XE_MetadataEncoder<XE_CompressionEncoder<XEPackage0::XE_LiveEncoder> > >
{
  /* 0x0000 */ volatile long m_BufferLoggedCount;
  /* 0x0004 */ volatile long m_BufferDroppedCount;
  /* 0x0008 */ class XE_MetadataEncoder<XE_CompressionEncoder<XEPackage0::XE_LiveEncoder> > m_encoder;
  /* 0x0050 */ class XE_ILogWriteMessageHandler* const m_msgHandler;
}; /* size: 0x0058 */

typedef enum
{
  countIdx = 0,
  incrementIdx = 1,
  database_idIdx = 2,
  LastField = 3,
} TAG_UNNAMED_267, *PTAG_UNNAMED_267;

typedef enum _PLUGPLAY_EVENT_CATEGORY
{
  HardwareProfileChangeEvent = 0,
  TargetDeviceChangeEvent = 1,
  DeviceClassChangeEvent = 2,
  CustomDeviceEvent = 3,
  DeviceInstallEvent = 4,
  DeviceArrivalEvent = 5,
  VetoEvent = 6,
  BlockedDriverEvent = 7,
  InvalidIDEvent = 8,
  DevicePropertyChangeEvent = 9,
  DeviceInstanceRemovalEvent = 10,
  DeviceInstanceStartedEvent = 11,
  MaxPlugEventCategory = 12,
} PLUGPLAY_EVENT_CATEGORY, *PPLUGPLAY_EVENT_CATEGORY;

typedef enum _PNP_VETO_TYPE
{
  PNP_VetoTypeUnknown = 0,
  PNP_VetoLegacyDevice = 1,
  PNP_VetoPendingClose = 2,
  PNP_VetoWindowsApp = 3,
  PNP_VetoWindowsService = 4,
  PNP_VetoOutstandingOpen = 5,
  PNP_VetoDevice = 6,
  PNP_VetoDriver = 7,
  PNP_VetoIllegalDeviceRequest = 8,
  PNP_VetoInsufficientPower = 9,
  PNP_VetoNonDisableable = 10,
  PNP_VetoLegacyDriver = 11,
  PNP_VetoInsufficientRights = 12,
} PNP_VETO_TYPE, *PPNP_VETO_TYPE;

typedef struct _PLUGPLAY_EVENT_BLOCK
{
  /* 0x0000 */ struct _GUID EventGuid;
  /* 0x0010 */ enum _PLUGPLAY_EVENT_CATEGORY EventCategory;
  /* 0x0014 */ long Padding_104;
  /* 0x0018 */ unsigned long* Result;
  /* 0x0020 */ unsigned long Flags;
  /* 0x0024 */ unsigned long TotalSize;
  /* 0x0028 */ void* DeviceObject;
  union
  {
    union
    {
      struct
      {
        /* 0x0030 */ struct _GUID ClassGuid;
        /* 0x0040 */ wchar_t SymbolicLinkName[1];
        /* 0x0042 */ char __PADDING__[2];
      } /* size: 0x0014 */ DeviceClass;
      struct
      {
        /* 0x0030 */ wchar_t DeviceId[1];
      } /* size: 0x0002 */ TargetDevice;
      struct
      {
        /* 0x0030 */ wchar_t DeviceId[1];
      } /* size: 0x0002 */ InstallDevice;
      struct
      {
        /* 0x0030 */ void* NotificationStructure;
        /* 0x0038 */ wchar_t DeviceId[1];
        /* 0x003a */ char __PADDING__[6];
      } /* size: 0x0010 */ CustomNotification;
      struct
      {
        /* 0x0030 */ void* Notification;
      } /* size: 0x0008 */ ProfileNotification;
      struct
      {
        /* 0x0030 */ unsigned long NotificationCode;
        /* 0x0034 */ unsigned long NotificationData;
      } /* size: 0x0008 */ PowerNotification;
      struct
      {
        /* 0x0030 */ enum _PNP_VETO_TYPE VetoType;
        /* 0x0034 */ wchar_t DeviceIdVetoNameBuffer[1];
        /* 0x0036 */ char __PADDING__[2];
      } /* size: 0x0008 */ VetoNotification;
      struct
      {
        /* 0x0030 */ struct _GUID BlockedDriverGuid;
      } /* size: 0x0010 */ BlockedDriverNotification;
      struct
      {
        /* 0x0030 */ wchar_t ParentId[1];
      } /* size: 0x0002 */ InvalidIDNotification;
      struct
      {
        /* 0x0030 */ struct _GUID PowerSettingGuid;
        /* 0x0040 */ unsigned long Flags;
        /* 0x0044 */ unsigned long SessionId;
        /* 0x0048 */ unsigned long DataLength;
        /* 0x004c */ unsigned char Data[1];
        /* 0x004d */ char __PADDING__[3];
      } /* size: 0x0020 */ PowerSettingNotification;
      struct
      {
        /* 0x0030 */ wchar_t DeviceId[1];
      } /* size: 0x0002 */ PropertyChangeNotification;
      struct
      {
        /* 0x0030 */ wchar_t DeviceId[1];
      } /* size: 0x0002 */ DeviceInstanceNotification;
    }; /* size: 0x0020 */
  } /* size: 0x0020 */ u;
} PLUGPLAY_EVENT_BLOCK, *PPLUGPLAY_EVENT_BLOCK; /* size: 0x0050 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 4,
  NVld = 1,
  VldEddOffset = 2,
  BufSize = 20,
} TAG_UNNAMED_268, *PTAG_UNNAMED_268;

typedef enum _FINDEX_INFO_LEVELS
{
  FindExInfoStandard = 0,
  FindExInfoBasic = 1,
  FindExInfoMaxInfoLevel = 2,
} FINDEX_INFO_LEVELS, *PFINDEX_INFO_LEVELS;

struct StaticStorage<8>
{
  /* 0x0000 */ unsigned int m_buf[1];
}; /* size: 0x0004 */

struct XBitmap<StaticStorage<8> >
{
  /* 0x0000 */ struct StaticStorage<8> m_storage;
}; /* size: 0x0004 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 4,
  NVld = 0,
  VldEddOffset = 3,
  BufSize = 16,
} TAG_UNNAMED_269, *PTAG_UNNAMED_269;

typedef struct __vc_attributes::importidlAttribute
{
  /* 0x0000 */ const char* value;
} _vc_attributes::importidlAttribute, *P_vc_attributes::importidlAttribute; /* size: 0x0008 */

typedef enum
{
  source_database_idIdx = 0,
  object_typeIdx = 1,
  object_idIdx = 2,
  nest_levelIdx = 3,
  estimated_rowsIdx = 4,
  estimated_costIdx = 5,
  durationIdx = 6,
  cpu_timeIdx = 7,
  recompile_countIdx = 8,
  begin_offsetIdx = 9,
  end_offsetIdx = 10,
  plan_handleIdx = 11,
  sql_handleIdx = 12,
  object_nameIdx = 13,
  showplan_xmlIdx = 14,
  database_nameIdx = 15,
  LastField = 16,
} TAG_UNNAMED_270, *PTAG_UNNAMED_270;

struct XETicksConfig
{
  /* 0x0000 */ unsigned short m_version;
  /* 0x0002 */ unsigned short m_padding;
  /* 0x0004 */ unsigned int m_padding2;
  /* 0x0008 */ unsigned __int64 m_startTimeUtc;
  /* 0x0010 */ unsigned __int64 m_frequency;
}; /* size: 0x0018 */

class XE_TicksUtil
{
  /* 0x0000 */ struct XETicksConfig m_config;
}; /* size: 0x0018 */

class AutoSpinlockHolder<170,3,1>;

enum tagTYMED
{
  TYMED_HGLOBAL = 1,
  TYMED_FILE = 2,
  TYMED_ISTREAM = 4,
  TYMED_ISTORAGE = 8,
  TYMED_GDI = 16,
  TYMED_MFPICT = 32,
  TYMED_ENHMF = 64,
  TYMED_NULL = 0,
};

enum XE_PublishedDescriptor::Flavor
{
  EMBEDDED = 0,
  VLD = 1,
  ACTION = 2,
};

class RefCountImpl<XList<BaseSafeCallbackTraits<TBaseSafeCallback<void,TListSLock,SOSCallbackEvent,NullType,NullType,NullType,NullType>,TListSLock,SOSCallbackEvent>::Elem> >
{
  /* 0x0000 */ long m_crefs;
}; /* size: 0x0004 */

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 11,
  NVld = 7,
  VldEddOffset = 3,
  BufSize = 75,
} TAG_UNNAMED_271, *PTAG_UNNAMED_271;

typedef enum _SECURITY_IMPERSONATION_LEVEL
{
  SecurityAnonymous = 0,
  SecurityIdentification = 1,
  SecurityImpersonation = 2,
  SecurityDelegation = 3,
} SECURITY_IMPERSONATION_LEVEL, *PSECURITY_IMPERSONATION_LEVEL;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 2,
  NVld = 1,
  VldEddOffset = 0,
  BufSize = 9,
} TAG_UNNAMED_272, *PTAG_UNNAMED_272;

typedef enum
{
  database_idIdx = 0,
  filegroup_idIdx = 1,
  LastField = 2,
} TAG_UNNAMED_273, *PTAG_UNNAMED_273;

typedef enum
{
  Value = 0,
} TAG_UNNAMED_274, *PTAG_UNNAMED_274;

typedef struct _WNODE_HEADER
{
  /* 0x0000 */ unsigned long BufferSize;
  /* 0x0004 */ unsigned long ProviderId;
  union
  {
    /* 0x0008 */ unsigned __int64 HistoricalContext;
    struct
    {
      /* 0x0008 */ unsigned long Version;
      /* 0x000c */ unsigned long Linkage;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
  union
  {
    /* 0x0010 */ unsigned long CountLost;
    /* 0x0010 */ void* KernelHandle;
    /* 0x0010 */ union _LARGE_INTEGER TimeStamp;
  }; /* size: 0x0008 */
  /* 0x0018 */ struct _GUID Guid;
  /* 0x0028 */ unsigned long ClientContext;
  /* 0x002c */ unsigned long Flags;
} WNODE_HEADER, *PWNODE_HEADER; /* size: 0x0030 */

struct OFFSETINSTANCEDATAANDLENGTH
{
  /* 0x0000 */ unsigned long OffsetInstanceData;
  /* 0x0004 */ unsigned long LengthInstanceData;
}; /* size: 0x0008 */

struct tagWNODE_ALL_DATA
{
  /* 0x0000 */ struct _WNODE_HEADER WnodeHeader;
  /* 0x0030 */ unsigned long DataBlockOffset;
  /* 0x0034 */ unsigned long InstanceCount;
  /* 0x0038 */ unsigned long OffsetInstanceNameOffsets;
  union
  {
    /* 0x003c */ unsigned long FixedInstanceSize;
    /* 0x003c */ struct OFFSETINSTANCEDATAANDLENGTH* OffsetInstanceDataAndLength /* zero-length array */;
    /* 0x003c */ long __PADDING__[3];
  }; /* size: 0x000c */
}; /* size: 0x0048 */

class XE_StreamCompare<unsigned short,XEPackage0::StringCompare<unsigned short,2>,1>
{
  /* 0x0000 */ wchar_t m_buffer[1024];
  /* 0x0800 */ const wchar_t* m_comperand;
  /* 0x0808 */ unsigned int m_cbCompRemaining;
  /* 0x080c */ int m_result;
}; /* size: 0x0810 */

enum tag_WBEM_EXTRA_RETURN_CODES
{
  WBEM_S_INITIALIZED = 0,
  WBEM_S_LIMITED_SERVICE = 0x43001,
  WBEM_S_INDIRECTLY_UPDATED = 0x43002,
  WBEM_S_SUBJECT_TO_SDS = 0x43003,
  WBEM_E_RETRY_LATER = -2147209215,
  WBEM_E_RESOURCE_CONTENTION = -2147209214,
};

typedef struct _s__RTTIClassHierarchyDescriptor
{
  /* 0x0000 */ unsigned long signature;
  /* 0x0004 */ unsigned long attributes;
  /* 0x0008 */ unsigned long numBaseClasses;
  /* 0x000c */ const struct _s__RTTIBaseClassArray* pBaseClassArray;
} s__RTTIClassHierarchyDescriptor, *Ps__RTTIClassHierarchyDescriptor; /* size: 0x0014 */

typedef enum __vc_attributes::event_sourceAttribute::optimize_e
{
  speed = 0,
  size = 1,
} _vc_attributes::event_sourceAttribute::optimize_e, *P_vc_attributes::event_sourceAttribute::optimize_e;

typedef struct _IMAGE_FILE_HEADER
{
  /* 0x0000 */ unsigned short Machine;
  /* 0x0002 */ unsigned short NumberOfSections;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned long PointerToSymbolTable;
  /* 0x000c */ unsigned long NumberOfSymbols;
  /* 0x0010 */ unsigned short SizeOfOptionalHeader;
  /* 0x0012 */ unsigned short Characteristics;
} IMAGE_FILE_HEADER, *PIMAGE_FILE_HEADER; /* size: 0x0014 */

typedef enum
{
  schema_mgr_database_idIdx = 0,
  versionIdx = 1,
  operationIdx = 2,
  hobt_idIdx = 3,
  row_countIdx = 4,
  file_stream_file_group_idIdx = 5,
  compress_levelIdx = 6,
  lob_statusIdx = 7,
  uniqueIdx = 8,
  replicatedIdx = 9,
  log_off_rows_for_replicationIdx = 10,
  column_storeIdx = 11,
  se_replicatedIdx = 12,
  LastField = 13,
} TAG_UNNAMED_275, *PTAG_UNNAMED_275;

typedef enum
{
  countIdx = 0,
  database_idIdx = 1,
  LastField = 2,
} TAG_UNNAMED_276, *PTAG_UNNAMED_276;

typedef enum
{
  NStatic = 4,
  NCustomizable = 0,
  NDynamic = 1,
  NVld = 0,
  VldEddOffset = 0,
  BufSize = 4,
} TAG_UNNAMED_277, *PTAG_UNNAMED_277;

typedef enum
{
  key_accessorIdx = 0,
  key_accessor_bindingsIdx = 1,
  key_accessor_buffer_sizeIdx = 2,
  data_accessorIdx = 3,
  data_accessor_bindingsIdx = 4,
  data_accessor_buffer_sizeIdx = 5,
  use_local_rowsetIdx = 6,
  LastField = 7,
} TAG_UNNAMED_278, *PTAG_UNNAMED_278;

typedef struct __vc_attributes::licensedAttribute
{
} _vc_attributes::licensedAttribute, *P_vc_attributes::licensedAttribute; /* size: 0x0001 */

typedef enum _CM_ERROR_CONTROL_TYPE
{
  IgnoreError = 0,
  NormalError = 1,
  SevereError = 2,
  CriticalError = 3,
} CM_ERROR_CONTROL_TYPE, *PCM_ERROR_CONTROL_TYPE;

typedef struct _IMAGE_THUNK_DATA64
{
  union
  {
    union
    {
      /* 0x0000 */ unsigned __int64 ForwarderString;
      /* 0x0000 */ unsigned __int64 Function;
      /* 0x0000 */ unsigned __int64 Ordinal;
      /* 0x0000 */ unsigned __int64 AddressOfData;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ u1;
} IMAGE_THUNK_DATA64, *PIMAGE_THUNK_DATA64; /* size: 0x0008 */

typedef enum _TOKEN_ELEVATION_TYPE
{
  TokenElevationTypeDefault = 1,
  TokenElevationTypeFull = 2,
  TokenElevationTypeLimited = 3,
} TOKEN_ELEVATION_TYPE, *PTOKEN_ELEVATION_TYPE;

typedef enum
