/*
 * PDB file: .\sqlwoa.pdb\4CE8EF4ABD884554BB82F25CD0993C196\sqlwoa.pdb
 * Image architecture: i386 (0x014c)
 *
 * Dumped by pdbex tool v0.11, by wbenny
 */

enum tagDOMNodeType;
enum _TP_CALLBACK_PRIORITY;
enum _tagPARSEACTION;
enum tagCALLCONV;
enum __MIDL_ICodeInstall_0001;
enum DISPLAYCONFIG_SCANLINE_ORDERING;
enum tagCHANGEKIND;
enum tagShutdownType;
enum tagBINDSTATUS;
enum _tagPSUACTION;
enum tagGLOBALOPT_EH_VALUES;
enum _URLZONEREG;
enum tagFUNCKIND;
enum VARENUM;
enum ReplacesCorHdrNumericDefines;
enum tagURLZONE;
enum tagTYSPEC;
enum _tagQUERYOPTION;
enum tagBINDSTRING;
enum tagVARKIND;
enum tagXMLEMEM_TYPE;
enum tagSYSKIND;
enum tagDESCKIND;
enum tagTYPEKIND;
enum PIDMSI_STATUS_VALUE;
enum tagApplicationType;
enum _KSPIN_LOCK_QUEUE_NUMBER;
enum _EXCEPTION_DISPOSITION;
enum __enative_startup_state;
struct threadmbcinfostruct;
struct localeinfo_struct;
struct tagLC_ID;
struct threadlocaleinfostruct;
struct lconv;
struct __lc_time_data;
struct _TP_POOL;
struct _TP_CLEANUP_GROUP;
struct _ACTIVATION_CONTEXT;
struct _TP_CALLBACK_INSTANCE;
struct _TP_CALLBACK_ENVIRON_V3;
struct _TEB;
struct _iobuf;
struct HWND__;
struct tagRECT;
struct tagTOOLINFOW;
struct HINSTANCE__;
struct tagMDICREATESTRUCTW;
struct tagLVITEMW;
struct tagLVCOLUMNW;
struct tagPOINT;
struct tagLVFINDINFOW;
struct _TREEITEM;
struct tagTVITEMW;
struct tagTVITEMEXW;
struct tagTVINSERTSTRUCTW;
struct _HD_ITEMW;
struct HBITMAP__;

  QUERY_USES_CACHE = 12,
  QUERY_IS_SECURE = 13,
  QUERY_IS_SAFE = 14,
  QUERY_USES_HISTORYFOLDER = 15,
} tagQUERYOPTION, *PtagQUERYOPTION;

enum tagBINDSTRING
{
  BINDSTRING_HEADERS = 1,
  BINDSTRING_ACCEPT_MIMES = 2,
  BINDSTRING_EXTRA_URL = 3,
  BINDSTRING_LANGUAGE = 4,
  BINDSTRING_USERNAME = 5,
  BINDSTRING_PASSWORD = 6,
  BINDSTRING_UA_PIXELS = 7,
  BINDSTRING_UA_COLOR = 8,
  BINDSTRING_OS = 9,
  BINDSTRING_USER_AGENT = 10,
  BINDSTRING_ACCEPT_ENCODINGS = 11,
  BINDSTRING_POST_COOKIE = 12,
  BINDSTRING_POST_DATA_MIME = 13,
  BINDSTRING_URL = 14,
  BINDSTRING_IID = 15,
  BINDSTRING_FLAG_BIND_TO_OBJECT = 16,
  BINDSTRING_PTR_BIND_CONTEXT = 17,
  BINDSTRING_XDR_ORIGIN = 18,
};

enum tagVARKIND
{
  VAR_PERINSTANCE = 0,
  VAR_STATIC = 1,
  VAR_CONST = 2,
  VAR_DISPATCH = 3,
};

enum tagXMLEMEM_TYPE
{
  XMLELEMTYPE_ELEMENT = 0,
  XMLELEMTYPE_TEXT = 1,
  XMLELEMTYPE_COMMENT = 2,
  XMLELEMTYPE_DOCUMENT = 3,
  XMLELEMTYPE_DTD = 4,
  XMLELEMTYPE_PI = 5,
  XMLELEMTYPE_OTHER = 6,
};

enum tagSYSKIND
{
  SYS_WIN16 = 0,
  SYS_WIN32 = 1,
  SYS_MAC = 2,
  SYS_WIN64 = 3,
};

enum tagDESCKIND
{
  DESCKIND_NONE = 0,
  DESCKIND_FUNCDESC = 1,
  DESCKIND_VARDESC = 2,
  DESCKIND_TYPECOMP = 3,
  DESCKIND_IMPLICITAPPOBJ = 4,
  DESCKIND_MAX = 5,
};

enum tagTYPEKIND
{
  TKIND_ENUM = 0,
  TKIND_RECORD = 1,
  TKIND_MODULE = 2,
  TKIND_INTERFACE = 3,
  TKIND_DISPATCH = 4,
  TKIND_COCLASS = 5,
  TKIND_ALIAS = 6,
  TKIND_UNION = 7,
  TKIND_MAX = 8,
};

enum PIDMSI_STATUS_VALUE
{
  PIDMSI_STATUS_NORMAL = 0,
  PIDMSI_STATUS_NEW = 1,
  PIDMSI_STATUS_PRELIM = 2,
  PIDMSI_STATUS_DRAFT = 3,
  PIDMSI_STATUS_INPROGRESS = 4,
  PIDMSI_STATUS_EDIT = 5,
  PIDMSI_STATUS_REVIEW = 6,
  PIDMSI_STATUS_PROOF = 7,
  PIDMSI_STATUS_FINAL = 8,
  PIDMSI_STATUS_OTHER = 32767,
};

enum tagApplicationType
{
  ServerApplication = 0,
  LibraryApplication = 1,
};

typedef enum _KSPIN_LOCK_QUEUE_NUMBER
{
  LockQueueUnusedSpare0 = 0,
  LockQueueExpansionLock = 1,
  LockQueueUnusedSpare2 = 2,
  LockQueueSystemSpaceLock = 3,
  LockQueueVacbLock = 4,
  LockQueueMasterLock = 5,
  LockQueueNonPagedPoolLock = 6,
  LockQueueIoCancelLock = 7,
  LockQueueWorkQueueLock = 8,
  LockQueueIoVpbLock = 9,
  LockQueueIoDatabaseLock = 10,
  LockQueueIoCompletionLock = 11,
  LockQueueNtfsStructLock = 12,
  LockQueueAfdWorkQueueLock = 13,
  LockQueueBcbLock = 14,
  LockQueueMmNonPagedPoolLock = 15,
  LockQueueUnusedSpare16 = 16,
  LockQueueMaximumLock = 17,
} KSPIN_LOCK_QUEUE_NUMBER, *PKSPIN_LOCK_QUEUE_NUMBER;

typedef enum _EXCEPTION_DISPOSITION
{
  ExceptionContinueExecution = 0,
  ExceptionContinueSearch = 1,
  ExceptionNestedException = 2,
  ExceptionCollidedUnwind = 3,
} EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

typedef enum __enative_startup_state
{
  __uninitialized = 0,
  __initializing = 1,
  __initialized = 2,
} _enative_startup_state, *P_enative_startup_state;

struct threadmbcinfostruct;

struct localeinfo_struct
{
  /* 0x0000 */ struct threadlocaleinfostruct* locinfo;
  /* 0x0004 */ struct threadmbcinfostruct* mbcinfo;
}; /* size: 0x0008 */

struct tagLC_ID
{
  /* 0x0000 */ unsigned short wLanguage;
  /* 0x0002 */ unsigned short wCountry;
  /* 0x0004 */ unsigned short wCodePage;
}; /* size: 0x0006 */

struct threadlocaleinfostruct
{
  /* 0x0000 */ int refcount;
  /* 0x0004 */ unsigned int lc_codepage;
  /* 0x0008 */ unsigned int lc_collate_cp;
  /* 0x000c */ unsigned long lc_handle[6];
  /* 0x0024 */ struct tagLC_ID lc_id[6];
  /* 0x0048 */ struct
  {
    /* 0x0048 */ char* locale;
    /* 0x004c */ unsigned short* wlocale;
    /* 0x0050 */ int* refcount;
    /* 0x0054 */ int* wrefcount;
  } /* size: 0x0010 */ lc_category[6];
  /* 0x00a8 */ int lc_clike;
  /* 0x00ac */ int mb_cur_max;
  /* 0x00b0 */ int* lconv_intl_refcount;
  /* 0x00b4 */ int* lconv_num_refcount;
  /* 0x00b8 */ int* lconv_mon_refcount;
  /* 0x00bc */ struct lconv* lconv;
  /* 0x00c0 */ int* ctype1_refcount;
  /* 0x00c4 */ unsigned short* ctype1;
  /* 0x00c8 */ const unsigned short* pctype;
  /* 0x00cc */ const unsigned char* pclmap;
  /* 0x00d0 */ const unsigned char* pcumap;
  /* 0x00d4 */ struct __lc_time_data* lc_time_curr;
}; /* size: 0x00d8 */

struct lconv;

struct __lc_time_data;

struct _TP_POOL;

struct _TP_CLEANUP_GROUP;

struct _ACTIVATION_CONTEXT;

struct _TP_CALLBACK_INSTANCE;

typedef struct _TP_CALLBACK_ENVIRON_V3
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ struct _TP_POOL* Pool;
  /* 0x0008 */ struct _TP_CLEANUP_GROUP* CleanupGroup;
  /* 0x000c */ void* CleanupGroupCancelCallback /* function */;
  /* 0x0010 */ void* RaceDll;
  /* 0x0014 */ struct _ACTIVATION_CONTEXT* ActivationContext;
  /* 0x0018 */ void* FinalizationCallback /* function */;
  union
  {
    union
    {
      /* 0x001c */ unsigned long Flags;
      struct
      {
        struct /* bitfield */
        {
          /* 0x001c */ unsigned long LongFunction : 1; /* bit position: 0 */
          /* 0x001c */ unsigned long Persistent : 1; /* bit position: 1 */
          /* 0x001c */ unsigned long Private : 30; /* bit position: 2 */
        }; /* bitfield */
      } /* size: 0x0004 */ s;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u;
  /* 0x0020 */ enum _TP_CALLBACK_PRIORITY CallbackPriority;
  /* 0x0024 */ unsigned long Size;
} TP_CALLBACK_ENVIRON_V3, *PTP_CALLBACK_ENVIRON_V3; /* size: 0x0028 */

struct _TEB;

typedef struct _iobuf
{
  /* 0x0000 */ char* _ptr;
  /* 0x0004 */ int _cnt;
  /* 0x0008 */ char* _base;
  /* 0x000c */ int _flag;
  /* 0x0010 */ int _file;
  /* 0x0014 */ int _charbuf;
  /* 0x0018 */ int _bufsiz;
  /* 0x001c */ char* _tmpfname;
} iobuf, *Piobuf; /* size: 0x0020 */

struct HWND__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct tagRECT
{
  /* 0x0000 */ long left;
  /* 0x0004 */ long top;
  /* 0x0008 */ long right;
  /* 0x000c */ long bottom;
}; /* size: 0x0010 */

struct tagTOOLINFOW
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ unsigned int uFlags;
  /* 0x0008 */ struct HWND__* hwnd;
  /* 0x000c */ unsigned int uId;
  /* 0x0010 */ struct tagRECT rect;
  /* 0x0020 */ struct HINSTANCE__* hinst;
  /* 0x0024 */ unsigned short* lpszText;
  /* 0x0028 */ long lParam;
  /* 0x002c */ void* lpReserved;
}; /* size: 0x0030 */

struct HINSTANCE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct tagMDICREATESTRUCTW
{
  /* 0x0000 */ const wchar_t* szClass;
  /* 0x0004 */ const wchar_t* szTitle;
  /* 0x0008 */ void* hOwner;
  /* 0x000c */ int x;
  /* 0x0010 */ int y;
  /* 0x0014 */ int cx;
  /* 0x0018 */ int cy;
  /* 0x001c */ unsigned long style;
  /* 0x0020 */ long lParam;
}; /* size: 0x0024 */

struct tagLVITEMW
{
  /* 0x0000 */ unsigned int mask;
  /* 0x0004 */ int iItem;
  /* 0x0008 */ int iSubItem;
  /* 0x000c */ unsigned int state;
  /* 0x0010 */ unsigned int stateMask;
  /* 0x0014 */ unsigned short* pszText;
  /* 0x0018 */ int cchTextMax;
  /* 0x001c */ int iImage;
  /* 0x0020 */ long lParam;
  /* 0x0024 */ int iIndent;
  /* 0x0028 */ int iGroupId;
  /* 0x002c */ unsigned int cColumns;
  /* 0x0030 */ unsigned int* puColumns;
  /* 0x0034 */ int* piColFmt;
  /* 0x0038 */ int iGroup;
}; /* size: 0x003c */

struct tagLVCOLUMNW
{
  /* 0x0000 */ unsigned int mask;
  /* 0x0004 */ int fmt;
  /* 0x0008 */ int cx;
  /* 0x000c */ unsigned short* pszText;
  /* 0x0010 */ int cchTextMax;
  /* 0x0014 */ int iSubItem;
  /* 0x0018 */ int iImage;
  /* 0x001c */ int iOrder;
  /* 0x0020 */ int cxMin;
  /* 0x0024 */ int cxDefault;
  /* 0x0028 */ int cxIdeal;
}; /* size: 0x002c */

struct tagPOINT
{
  /* 0x0000 */ long x;
  /* 0x0004 */ long y;
}; /* size: 0x0008 */

struct tagLVFINDINFOW
{
  /* 0x0000 */ unsigned int flags;
  /* 0x0004 */ const wchar_t* psz;
  /* 0x0008 */ long lParam;
  /* 0x000c */ struct tagPOINT pt;
  /* 0x0014 */ unsigned int vkDirection;
}; /* size: 0x0018 */

struct _TREEITEM;

struct tagTVITEMW
{
  /* 0x0000 */ unsigned int mask;
  /* 0x0004 */ struct _TREEITEM* hItem;
  /* 0x0008 */ unsigned int state;
  /* 0x000c */ unsigned int stateMask;
  /* 0x0010 */ unsigned short* pszText;
  /* 0x0014 */ int cchTextMax;
  /* 0x0018 */ int iImage;
  /* 0x001c */ int iSelectedImage;
  /* 0x0020 */ int cChildren;
  /* 0x0024 */ long lParam;
}; /* size: 0x0028 */

struct tagTVITEMEXW
{
  /* 0x0000 */ unsigned int mask;
  /* 0x0004 */ struct _TREEITEM* hItem;
  /* 0x0008 */ unsigned int state;
  /* 0x000c */ unsigned int stateMask;
  /* 0x0010 */ unsigned short* pszText;
  /* 0x0014 */ int cchTextMax;
  /* 0x0018 */ int iImage;
  /* 0x001c */ int iSelectedImage;
  /* 0x0020 */ int cChildren;
  /* 0x0024 */ long lParam;
  /* 0x0028 */ int iIntegral;
  /* 0x002c */ int iReserved;
}; /* size: 0x0030 */

struct tagTVINSERTSTRUCTW
{
  /* 0x0000 */ struct _TREEITEM* hParent;
  /* 0x0004 */ struct _TREEITEM* hInsertAfter;
  union
  {
    /* 0x0008 */ struct tagTVITEMEXW itemex;
    struct
    {
      /* 0x0008 */ struct tagTVITEMW item;
      /* 0x0030 */ long __PADDING__[2];
    }; /* size: 0x0030 */
  }; /* size: 0x0030 */
}; /* size: 0x0038 */

typedef struct _HD_ITEMW
{
  /* 0x0000 */ unsigned int mask;
  /* 0x0004 */ int cxy;
  /* 0x0008 */ unsigned short* pszText;
  /* 0x000c */ struct HBITMAP__* hbm;
  /* 0x0010 */ int cchTextMax;
  /* 0x0014 */ int fmt;
  /* 0x0018 */ long lParam;
  /* 0x001c */ int iImage;
  /* 0x0020 */ int iOrder;
  /* 0x0024 */ unsigned int type;
  /* 0x0028 */ void* pvFilter;
  /* 0x002c */ unsigned int state;
} HD_ITEMW, *PHD_ITEMW; /* size: 0x0030 */

struct HBITMAP__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct tagTCITEMW
{
  /* 0x0000 */ unsigned int mask;
  /* 0x0004 */ unsigned long dwState;
  /* 0x0008 */ unsigned long dwStateMask;
  /* 0x000c */ unsigned short* pszText;
  /* 0x0010 */ int cchTextMax;
  /* 0x0014 */ int iImage;
  /* 0x0018 */ long lParam;
}; /* size: 0x001c */

struct tagTOOLINFOA
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ unsigned int uFlags;
  /* 0x0008 */ struct HWND__* hwnd;
  /* 0x000c */ unsigned int uId;
  /* 0x0010 */ struct tagRECT rect;
  /* 0x0020 */ struct HINSTANCE__* hinst;
  /* 0x0024 */ char* lpszText;
  /* 0x0028 */ long lParam;
  /* 0x002c */ void* lpReserved;
}; /* size: 0x0030 */

struct TOOLINFOA_PRE_IE30
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ unsigned int uFlags;
  /* 0x0008 */ struct HWND__* hwnd;
  /* 0x000c */ unsigned int uId;
  /* 0x0010 */ struct tagRECT rect;
  /* 0x0020 */ struct HINSTANCE__* hinst;
  /* 0x0024 */ char* lpszText;
}; /* size: 0x0028 */

struct tagMDICREATESTRUCTA
{
  /* 0x0000 */ const char* szClass;
  /* 0x0004 */ const char* szTitle;
  /* 0x0008 */ void* hOwner;
  /* 0x000c */ int x;
  /* 0x0010 */ int y;
  /* 0x0014 */ int cx;
  /* 0x0018 */ int cy;
  /* 0x001c */ unsigned long style;
  /* 0x0020 */ long lParam;
}; /* size: 0x0024 */

struct tagLVITEMA
{
  /* 0x0000 */ unsigned int mask;
  /* 0x0004 */ int iItem;
  /* 0x0008 */ int iSubItem;
  /* 0x000c */ unsigned int state;
  /* 0x0010 */ unsigned int stateMask;
  /* 0x0014 */ char* pszText;
  /* 0x0018 */ int cchTextMax;
  /* 0x001c */ int iImage;
  /* 0x0020 */ long lParam;
  /* 0x0024 */ int iIndent;
  /* 0x0028 */ int iGroupId;
  /* 0x002c */ unsigned int cColumns;
  /* 0x0030 */ unsigned int* puColumns;
  /* 0x0034 */ int* piColFmt;
  /* 0x0038 */ int iGroup;
}; /* size: 0x003c */

struct tagLVCOLUMNA
{
  /* 0x0000 */ unsigned int mask;
  /* 0x0004 */ int fmt;
  /* 0x0008 */ int cx;
  /* 0x000c */ char* pszText;
  /* 0x0010 */ int cchTextMax;
  /* 0x0014 */ int iSubItem;
  /* 0x0018 */ int iImage;
  /* 0x001c */ int iOrder;
  /* 0x0020 */ int cxMin;
  /* 0x0024 */ int cxDefault;
  /* 0x0028 */ int cxIdeal;
}; /* size: 0x002c */

struct tagLVFINDINFOA
{
  /* 0x0000 */ unsigned int flags;
  /* 0x0004 */ const char* psz;
  /* 0x0008 */ long lParam;
  /* 0x000c */ struct tagPOINT pt;
  /* 0x0014 */ unsigned int vkDirection;
}; /* size: 0x0018 */

struct tagTVITEMA
{
  /* 0x0000 */ unsigned int mask;
  /* 0x0004 */ struct _TREEITEM* hItem;
  /* 0x0008 */ unsigned int state;
  /* 0x000c */ unsigned int stateMask;
  /* 0x0010 */ char* pszText;
  /* 0x0014 */ int cchTextMax;
  /* 0x0018 */ int iImage;
  /* 0x001c */ int iSelectedImage;
  /* 0x0020 */ int cChildren;
  /* 0x0024 */ long lParam;
}; /* size: 0x0028 */

struct tagTVITEMEXA
{
  /* 0x0000 */ unsigned int mask;
  /* 0x0004 */ struct _TREEITEM* hItem;
  /* 0x0008 */ unsigned int state;
  /* 0x000c */ unsigned int stateMask;
  /* 0x0010 */ char* pszText;
  /* 0x0014 */ int cchTextMax;
  /* 0x0018 */ int iImage;
  /* 0x001c */ int iSelectedImage;
  /* 0x0020 */ int cChildren;
  /* 0x0024 */ long lParam;
  /* 0x0028 */ int iIntegral;
  /* 0x002c */ int iReserved;
}; /* size: 0x0030 */

struct tagTVINSERTSTRUCTA
{
  /* 0x0000 */ struct _TREEITEM* hParent;
  /* 0x0004 */ struct _TREEITEM* hInsertAfter;
  union
  {
    /* 0x0008 */ struct tagTVITEMEXA itemex;
    struct
    {
      /* 0x0008 */ struct tagTVITEMA item;
      /* 0x0030 */ long __PADDING__[2];
    }; /* size: 0x0030 */
  }; /* size: 0x0030 */
}; /* size: 0x0038 */

typedef struct _HD_ITEMA
{
  /* 0x0000 */ unsigned int mask;
  /* 0x0004 */ int cxy;
  /* 0x0008 */ char* pszText;
  /* 0x000c */ struct HBITMAP__* hbm;
  /* 0x0010 */ int cchTextMax;
  /* 0x0014 */ int fmt;
  /* 0x0018 */ long lParam;
  /* 0x001c */ int iImage;
  /* 0x0020 */ int iOrder;
  /* 0x0024 */ unsigned int type;
  /* 0x0028 */ void* pvFilter;
  /* 0x002c */ unsigned int state;
} HD_ITEMA, *PHD_ITEMA; /* size: 0x0030 */

struct tagTCITEMA
{
  /* 0x0000 */ unsigned int mask;
  /* 0x0004 */ unsigned long dwState;
  /* 0x0008 */ unsigned long dwStateMask;
  /* 0x000c */ char* pszText;
  /* 0x0010 */ int cchTextMax;
  /* 0x0014 */ int iImage;
  /* 0x0018 */ long lParam;
}; /* size: 0x001c */

struct HMENU__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct tagTEXTMETRICW
{
  /* 0x0000 */ long tmHeight;
  /* 0x0004 */ long tmAscent;
  /* 0x0008 */ long tmDescent;
  /* 0x000c */ long tmInternalLeading;
  /* 0x0010 */ long tmExternalLeading;
  /* 0x0014 */ long tmAveCharWidth;
  /* 0x0018 */ long tmMaxCharWidth;
  /* 0x001c */ long tmWeight;
  /* 0x0020 */ long tmOverhang;
  /* 0x0024 */ long tmDigitizedAspectX;
  /* 0x0028 */ long tmDigitizedAspectY;
  /* 0x002c */ wchar_t tmFirstChar;
  /* 0x002e */ wchar_t tmLastChar;
  /* 0x0030 */ wchar_t tmDefaultChar;
  /* 0x0032 */ wchar_t tmBreakChar;
  /* 0x0034 */ unsigned char tmItalic;
  /* 0x0035 */ unsigned char tmUnderlined;
  /* 0x0036 */ unsigned char tmStruckOut;
  /* 0x0037 */ unsigned char tmPitchAndFamily;
  /* 0x0038 */ unsigned char tmCharSet;
  /* 0x0039 */ char __PADDING__[3];
}; /* size: 0x003c */

struct HDC__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct tagTEXTMETRICA
{
  /* 0x0000 */ long tmHeight;
  /* 0x0004 */ long tmAscent;
  /* 0x0008 */ long tmDescent;
  /* 0x000c */ long tmInternalLeading;
  /* 0x0010 */ long tmExternalLeading;
  /* 0x0014 */ long tmAveCharWidth;
  /* 0x0018 */ long tmMaxCharWidth;
  /* 0x001c */ long tmWeight;
  /* 0x0020 */ long tmOverhang;
  /* 0x0024 */ long tmDigitizedAspectX;
  /* 0x0028 */ long tmDigitizedAspectY;
  /* 0x002c */ unsigned char tmFirstChar;
  /* 0x002d */ unsigned char tmLastChar;
  /* 0x002e */ unsigned char tmDefaultChar;
  /* 0x002f */ unsigned char tmBreakChar;
  /* 0x0030 */ unsigned char tmItalic;
  /* 0x0031 */ unsigned char tmUnderlined;
  /* 0x0032 */ unsigned char tmStruckOut;
  /* 0x0033 */ unsigned char tmPitchAndFamily;
  /* 0x0034 */ unsigned char tmCharSet;
  /* 0x0035 */ char __PADDING__[3];
}; /* size: 0x0038 */

struct tagLOGFONTW
{
  /* 0x0000 */ long lfHeight;
  /* 0x0004 */ long lfWidth;
  /* 0x0008 */ long lfEscapement;
  /* 0x000c */ long lfOrientation;
  /* 0x0010 */ long lfWeight;
  /* 0x0014 */ unsigned char lfItalic;
  /* 0x0015 */ unsigned char lfUnderline;
  /* 0x0016 */ unsigned char lfStrikeOut;
  /* 0x0017 */ unsigned char lfCharSet;
  /* 0x0018 */ unsigned char lfOutPrecision;
  /* 0x0019 */ unsigned char lfClipPrecision;
  /* 0x001a */ unsigned char lfQuality;
  /* 0x001b */ unsigned char lfPitchAndFamily;
  /* 0x001c */ wchar_t lfFaceName[32];
}; /* size: 0x005c */

struct tagLOGFONTA
{
  /* 0x0000 */ long lfHeight;
  /* 0x0004 */ long lfWidth;
  /* 0x0008 */ long lfEscapement;
  /* 0x000c */ long lfOrientation;
  /* 0x0010 */ long lfWeight;
  /* 0x0014 */ unsigned char lfItalic;
  /* 0x0015 */ unsigned char lfUnderline;
  /* 0x0016 */ unsigned char lfStrikeOut;
  /* 0x0017 */ unsigned char lfCharSet;
  /* 0x0018 */ unsigned char lfOutPrecision;
  /* 0x0019 */ unsigned char lfClipPrecision;
  /* 0x001a */ unsigned char lfQuality;
  /* 0x001b */ unsigned char lfPitchAndFamily;
  /* 0x001c */ char lfFaceName[32];
}; /* size: 0x003c */

struct HRSRC__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HFONT__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct tagWNDCLASSW
{
  /* 0x0000 */ unsigned int style;
  /* 0x0004 */ void* lpfnWndProc /* function */;
  /* 0x0008 */ int cbClsExtra;
  /* 0x000c */ int cbWndExtra;
  /* 0x0010 */ struct HINSTANCE__* hInstance;
  /* 0x0014 */ struct HICON__* hIcon;
  /* 0x0018 */ struct HICON__* hCursor;
  /* 0x001c */ struct HBRUSH__* hbrBackground;
  /* 0x0020 */ const wchar_t* lpszMenuName;
  /* 0x0024 */ const wchar_t* lpszClassName;
}; /* size: 0x0028 */

struct HICON__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HBRUSH__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct tagWNDCLASSA
{
  /* 0x0000 */ unsigned int style;
  /* 0x0004 */ void* lpfnWndProc /* function */;
  /* 0x0008 */ int cbClsExtra;
  /* 0x000c */ int cbWndExtra;
  /* 0x0010 */ struct HINSTANCE__* hInstance;
  /* 0x0014 */ struct HICON__* hIcon;
  /* 0x0018 */ struct HICON__* hCursor;
  /* 0x001c */ struct HBRUSH__* hbrBackground;
  /* 0x0020 */ const char* lpszMenuName;
  /* 0x0024 */ const char* lpszClassName;
}; /* size: 0x0028 */

struct tagMSG
{
  /* 0x0000 */ struct HWND__* hwnd;
  /* 0x0004 */ unsigned int message;
  /* 0x0008 */ unsigned int wParam;
  /* 0x000c */ long lParam;
  /* 0x0010 */ unsigned long time;
  /* 0x0014 */ struct tagPOINT pt;
}; /* size: 0x001c */

struct HACCEL__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct tagSIZE
{
  /* 0x0000 */ long cx;
  /* 0x0004 */ long cy;
}; /* size: 0x0008 */

typedef struct _DOCINFOW
{
  /* 0x0000 */ int cbSize;
  /* 0x0004 */ const wchar_t* lpszDocName;
  /* 0x0008 */ const wchar_t* lpszOutput;
  /* 0x000c */ const wchar_t* lpszDatatype;
  /* 0x0010 */ unsigned long fwType;
} DOCINFOW, *PDOCINFOW; /* size: 0x0014 */

typedef struct _DOCINFOA
{
  /* 0x0000 */ int cbSize;
  /* 0x0004 */ const char* lpszDocName;
  /* 0x0008 */ const char* lpszOutput;
  /* 0x000c */ const char* lpszDatatype;
  /* 0x0010 */ unsigned long fwType;
} DOCINFOA, *PDOCINFOA; /* size: 0x0014 */

typedef union _ULARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ unsigned long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ unsigned long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ unsigned __int64 QuadPart;
  }; /* size: 0x0008 */
} ULARGE_INTEGER, *PULARGE_INTEGER; /* size: 0x0008 */

typedef struct _OSVERSIONINFOW
{
  /* 0x0000 */ unsigned long dwOSVersionInfoSize;
  /* 0x0004 */ unsigned long dwMajorVersion;
  /* 0x0008 */ unsigned long dwMinorVersion;
  /* 0x000c */ unsigned long dwBuildNumber;
  /* 0x0010 */ unsigned long dwPlatformId;
  /* 0x0014 */ wchar_t szCSDVersion[128];
} OSVERSIONINFOW, *POSVERSIONINFOW; /* size: 0x0114 */

struct tagOFNW
{
  /* 0x0000 */ unsigned long lStructSize;
  /* 0x0004 */ struct HWND__* hwndOwner;
  /* 0x0008 */ struct HINSTANCE__* hInstance;
  /* 0x000c */ const wchar_t* lpstrFilter;
  /* 0x0010 */ unsigned short* lpstrCustomFilter;
  /* 0x0014 */ unsigned long nMaxCustFilter;
  /* 0x0018 */ unsigned long nFilterIndex;
  /* 0x001c */ unsigned short* lpstrFile;
  /* 0x0020 */ unsigned long nMaxFile;
  /* 0x0024 */ unsigned short* lpstrFileTitle;
  /* 0x0028 */ unsigned long nMaxFileTitle;
  /* 0x002c */ const wchar_t* lpstrInitialDir;
  /* 0x0030 */ const wchar_t* lpstrTitle;
  /* 0x0034 */ unsigned long Flags;
  /* 0x0038 */ unsigned short nFileOffset;
  /* 0x003a */ unsigned short nFileExtension;
  /* 0x003c */ const wchar_t* lpstrDefExt;
  /* 0x0040 */ long lCustData;
  /* 0x0044 */ void* lpfnHook /* function */;
  /* 0x0048 */ const wchar_t* lpTemplateName;
  /* 0x004c */ void* pvReserved;
  /* 0x0050 */ unsigned long dwReserved;
  /* 0x0054 */ unsigned long FlagsEx;
}; /* size: 0x0058 */

struct tagOFNA
{
  /* 0x0000 */ unsigned long lStructSize;
  /* 0x0004 */ struct HWND__* hwndOwner;
  /* 0x0008 */ struct HINSTANCE__* hInstance;
  /* 0x000c */ const char* lpstrFilter;
  /* 0x0010 */ char* lpstrCustomFilter;
  /* 0x0014 */ unsigned long nMaxCustFilter;
  /* 0x0018 */ unsigned long nFilterIndex;
  /* 0x001c */ char* lpstrFile;
  /* 0x0020 */ unsigned long nMaxFile;
  /* 0x0024 */ char* lpstrFileTitle;
  /* 0x0028 */ unsigned long nMaxFileTitle;
  /* 0x002c */ const char* lpstrInitialDir;
  /* 0x0030 */ const char* lpstrTitle;
  /* 0x0034 */ unsigned long Flags;
  /* 0x0038 */ unsigned short nFileOffset;
  /* 0x003a */ unsigned short nFileExtension;
  /* 0x003c */ const char* lpstrDefExt;
  /* 0x0040 */ long lCustData;
  /* 0x0044 */ void* lpfnHook /* function */;
  /* 0x0048 */ const char* lpTemplateName;
  /* 0x004c */ void* pvReserved;
  /* 0x0050 */ unsigned long dwReserved;
  /* 0x0054 */ unsigned long FlagsEx;
}; /* size: 0x0058 */

struct DLGTEMPLATE
{
  /* 0x0000 */ unsigned long style;
  /* 0x0004 */ unsigned long dwExtendedStyle;
  /* 0x0008 */ unsigned short cdit;
  /* 0x000a */ short x;
  /* 0x000c */ short y;
  /* 0x000e */ short cx;
  /* 0x0010 */ short cy;
}; /* size: 0x0012 */

typedef struct _SECURITY_ATTRIBUTES
{
  /* 0x0000 */ unsigned long nLength;
  /* 0x0004 */ void* lpSecurityDescriptor;
  /* 0x0008 */ int bInheritHandle;
} SECURITY_ATTRIBUTES, *PSECURITY_ATTRIBUTES; /* size: 0x000c */

typedef struct _OSVERSIONINFOA
{
  /* 0x0000 */ unsigned long dwOSVersionInfoSize;
  /* 0x0004 */ unsigned long dwMajorVersion;
  /* 0x0008 */ unsigned long dwMinorVersion;
  /* 0x000c */ unsigned long dwBuildNumber;
  /* 0x0010 */ unsigned long dwPlatformId;
  /* 0x0014 */ char szCSDVersion[128];
} OSVERSIONINFOA, *POSVERSIONINFOA; /* size: 0x0094 */

typedef struct _GUID
{
  /* 0x0000 */ unsigned long Data1;
  /* 0x0004 */ unsigned short Data2;
  /* 0x0006 */ unsigned short Data3;
  /* 0x0008 */ unsigned char Data4[8];
} GUID, *PGUID; /* size: 0x0010 */

struct HKEY__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

typedef struct _IMAGE_DOS_HEADER
{
  /* 0x0000 */ unsigned short e_magic;
  /* 0x0002 */ unsigned short e_cblp;
  /* 0x0004 */ unsigned short e_cp;
  /* 0x0006 */ unsigned short e_crlc;
  /* 0x0008 */ unsigned short e_cparhdr;
  /* 0x000a */ unsigned short e_minalloc;
  /* 0x000c */ unsigned short e_maxalloc;
  /* 0x000e */ unsigned short e_ss;
  /* 0x0010 */ unsigned short e_sp;
  /* 0x0012 */ unsigned short e_csum;
  /* 0x0014 */ unsigned short e_ip;
  /* 0x0016 */ unsigned short e_cs;
  /* 0x0018 */ unsigned short e_lfarlc;
  /* 0x001a */ unsigned short e_ovno;
  /* 0x001c */ unsigned short e_res[4];
  /* 0x0024 */ unsigned short e_oemid;
  /* 0x0026 */ unsigned short e_oeminfo;
  /* 0x0028 */ unsigned short e_res2[10];
  /* 0x003c */ long e_lfanew;
} IMAGE_DOS_HEADER, *PIMAGE_DOS_HEADER; /* size: 0x0040 */

typedef struct _IMAGE_DATA_DIRECTORY
{
  /* 0x0000 */ unsigned long VirtualAddress;
  /* 0x0004 */ unsigned long Size;
} IMAGE_DATA_DIRECTORY, *PIMAGE_DATA_DIRECTORY; /* size: 0x0008 */

typedef struct _IMAGE_OPTIONAL_HEADER
{
  /* 0x0000 */ unsigned short Magic;
  /* 0x0002 */ unsigned char MajorLinkerVersion;
  /* 0x0003 */ unsigned char MinorLinkerVersion;
  /* 0x0004 */ unsigned long SizeOfCode;
  /* 0x0008 */ unsigned long SizeOfInitializedData;
  /* 0x000c */ unsigned long SizeOfUninitializedData;
  /* 0x0010 */ unsigned long AddressOfEntryPoint;
  /* 0x0014 */ unsigned long BaseOfCode;
  /* 0x0018 */ unsigned long BaseOfData;
  /* 0x001c */ unsigned long ImageBase;
  /* 0x0020 */ unsigned long SectionAlignment;
  /* 0x0024 */ unsigned long FileAlignment;
  /* 0x0028 */ unsigned short MajorOperatingSystemVersion;
  /* 0x002a */ unsigned short MinorOperatingSystemVersion;
  /* 0x002c */ unsigned short MajorImageVersion;
  /* 0x002e */ unsigned short MinorImageVersion;
  /* 0x0030 */ unsigned short MajorSubsystemVersion;
  /* 0x0032 */ unsigned short MinorSubsystemVersion;
  /* 0x0034 */ unsigned long Win32VersionValue;
  /* 0x0038 */ unsigned long SizeOfImage;
  /* 0x003c */ unsigned long SizeOfHeaders;
  /* 0x0040 */ unsigned long CheckSum;
  /* 0x0044 */ unsigned short Subsystem;
  /* 0x0046 */ unsigned short DllCharacteristics;
  /* 0x0048 */ unsigned long SizeOfStackReserve;
  /* 0x004c */ unsigned long SizeOfStackCommit;
  /* 0x0050 */ unsigned long SizeOfHeapReserve;
  /* 0x0054 */ unsigned long SizeOfHeapCommit;
  /* 0x0058 */ unsigned long LoaderFlags;
  /* 0x005c */ unsigned long NumberOfRvaAndSizes;
  /* 0x0060 */ struct _IMAGE_DATA_DIRECTORY DataDirectory[16];
} IMAGE_OPTIONAL_HEADER, *PIMAGE_OPTIONAL_HEADER; /* size: 0x00e0 */

typedef struct _IMAGE_FILE_HEADER
{
  /* 0x0000 */ unsigned short Machine;
  /* 0x0002 */ unsigned short NumberOfSections;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned long PointerToSymbolTable;
  /* 0x000c */ unsigned long NumberOfSymbols;
  /* 0x0010 */ unsigned short SizeOfOptionalHeader;
  /* 0x0012 */ unsigned short Characteristics;
} IMAGE_FILE_HEADER, *PIMAGE_FILE_HEADER; /* size: 0x0014 */

typedef struct _IMAGE_SECTION_HEADER
{
  /* 0x0000 */ unsigned char Name[8];
  union
  {
    union
    {
      /* 0x0008 */ unsigned long PhysicalAddress;
      /* 0x0008 */ unsigned long VirtualSize;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ Misc;
  /* 0x000c */ unsigned long VirtualAddress;
  /* 0x0010 */ unsigned long SizeOfRawData;
  /* 0x0014 */ unsigned long PointerToRawData;
  /* 0x0018 */ unsigned long PointerToRelocations;
  /* 0x001c */ unsigned long PointerToLinenumbers;
  /* 0x0020 */ unsigned short NumberOfRelocations;
  /* 0x0022 */ unsigned short NumberOfLinenumbers;
  /* 0x0024 */ unsigned long Characteristics;
} IMAGE_SECTION_HEADER, *PIMAGE_SECTION_HEADER; /* size: 0x0028 */

typedef struct _IMAGE_NT_HEADERS
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ struct _IMAGE_FILE_HEADER FileHeader;
  /* 0x0018 */ struct _IMAGE_OPTIONAL_HEADER OptionalHeader;
} IMAGE_NT_HEADERS, *PIMAGE_NT_HEADERS; /* size: 0x00f8 */

typedef struct _EXCEPTION_RECORD
{
  /* 0x0000 */ unsigned long ExceptionCode;
  /* 0x0004 */ unsigned long ExceptionFlags;
  /* 0x0008 */ struct _EXCEPTION_RECORD* ExceptionRecord;
  /* 0x000c */ void* ExceptionAddress;
  /* 0x0010 */ unsigned long NumberParameters;
  /* 0x0014 */ unsigned long ExceptionInformation[15];
} EXCEPTION_RECORD, *PEXCEPTION_RECORD; /* size: 0x0050 */

typedef struct _FLOATING_SAVE_AREA
{
  /* 0x0000 */ unsigned long ControlWord;
  /* 0x0004 */ unsigned long StatusWord;
  /* 0x0008 */ unsigned long TagWord;
  /* 0x000c */ unsigned long ErrorOffset;
  /* 0x0010 */ unsigned long ErrorSelector;
  /* 0x0014 */ unsigned long DataOffset;
  /* 0x0018 */ unsigned long DataSelector;
  /* 0x001c */ unsigned char RegisterArea[80];
  /* 0x006c */ unsigned long Cr0NpxState;
} FLOATING_SAVE_AREA, *PFLOATING_SAVE_AREA; /* size: 0x0070 */

typedef struct _CONTEXT
{
  /* 0x0000 */ unsigned long ContextFlags;
  /* 0x0004 */ unsigned long Dr0;
  /* 0x0008 */ unsigned long Dr1;
  /* 0x000c */ unsigned long Dr2;
  /* 0x0010 */ unsigned long Dr3;
  /* 0x0014 */ unsigned long Dr6;
  /* 0x0018 */ unsigned long Dr7;
  /* 0x001c */ struct _FLOATING_SAVE_AREA FloatSave;
  /* 0x008c */ unsigned long SegGs;
  /* 0x0090 */ unsigned long SegFs;
  /* 0x0094 */ unsigned long SegEs;
  /* 0x0098 */ unsigned long SegDs;
  /* 0x009c */ unsigned long Edi;
  /* 0x00a0 */ unsigned long Esi;
  /* 0x00a4 */ unsigned long Ebx;
  /* 0x00a8 */ unsigned long Edx;
  /* 0x00ac */ unsigned long Ecx;
  /* 0x00b0 */ unsigned long Eax;
  /* 0x00b4 */ unsigned long Ebp;
  /* 0x00b8 */ unsigned long Eip;
  /* 0x00bc */ unsigned long SegCs;
  /* 0x00c0 */ unsigned long EFlags;
  /* 0x00c4 */ unsigned long Esp;
  /* 0x00c8 */ unsigned long SegSs;
  /* 0x00cc */ unsigned char ExtendedRegisters[512];
} CONTEXT, *PCONTEXT; /* size: 0x02cc */

typedef struct _EXCEPTION_POINTERS
{
  /* 0x0000 */ struct _EXCEPTION_RECORD* ExceptionRecord;
  /* 0x0004 */ struct _CONTEXT* ContextRecord;
} EXCEPTION_POINTERS, *PEXCEPTION_POINTERS; /* size: 0x0008 */

typedef struct _FILETIME
{
  /* 0x0000 */ unsigned long dwLowDateTime;
  /* 0x0004 */ unsigned long dwHighDateTime;
} FILETIME, *PFILETIME; /* size: 0x0008 */

union FT
{
  union
  {
    /* 0x0000 */ unsigned __int64 ft_scalar;
    /* 0x0000 */ struct _FILETIME ft_struct;
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

typedef union __m128
{
  union
  {
    /* 0x0000 */ float m128_f32[4];
    /* 0x0000 */ unsigned __int64 m128_u64[2];
    /* 0x0000 */ char m128_i8[16];
    /* 0x0000 */ short m128_i16[8];
    /* 0x0000 */ int m128_i32[4];
    /* 0x0000 */ __int64 m128_i64[2];
    /* 0x0000 */ unsigned char m128_u8[16];
    /* 0x0000 */ unsigned short m128_u16[8];
    /* 0x0000 */ unsigned int m128_u32[4];
  }; /* size: 0x0010 */
} _m128, *P_m128; /* size: 0x0010 */

typedef union _LARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ __int64 QuadPart;
  }; /* size: 0x0008 */
} LARGE_INTEGER, *PLARGE_INTEGER; /* size: 0x0008 */

typedef union __m64
{
  union
  {
    /* 0x0000 */ unsigned __int64 m64_u64;
    /* 0x0000 */ float m64_f32[2];
    /* 0x0000 */ char m64_i8[8];
    /* 0x0000 */ short m64_i16[4];
    /* 0x0000 */ int m64_i32[2];
    /* 0x0000 */ __int64 m64_i64;
    /* 0x0000 */ unsigned char m64_u8[8];
    /* 0x0000 */ unsigned short m64_u16[4];
    /* 0x0000 */ unsigned int m64_u32[2];
  }; /* size: 0x0008 */
} _m64, *P_m64; /* size: 0x0008 */

struct IMAGE_LOAD_CONFIG_DIRECTORY32
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned short MajorVersion;
  /* 0x000a */ unsigned short MinorVersion;
  /* 0x000c */ unsigned long GlobalFlagsClear;
  /* 0x0010 */ unsigned long GlobalFlagsSet;
  /* 0x0014 */ unsigned long CriticalSectionDefaultTimeout;
  /* 0x0018 */ unsigned long DeCommitFreeBlockThreshold;
  /* 0x001c */ unsigned long DeCommitTotalFreeThreshold;
  /* 0x0020 */ unsigned long LockPrefixTable;
  /* 0x0024 */ unsigned long MaximumAllocationSize;
  /* 0x0028 */ unsigned long VirtualMemoryThreshold;
  /* 0x002c */ unsigned long ProcessHeapFlags;
  /* 0x0030 */ unsigned long ProcessAffinityMask;
  /* 0x0034 */ unsigned short CSDVersion;
  /* 0x0036 */ unsigned short Reserved1;
  /* 0x0038 */ unsigned long EditList;
  /* 0x003c */ unsigned long SecurityCookie;
  /* 0x0040 */ unsigned long SEHandlerTable;
  /* 0x0044 */ unsigned long SEHandlerCount;
}; /* size: 0x0048 */

typedef struct _LIST_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY* Flink;
  /* 0x0004 */ struct _LIST_ENTRY* Blink;
} LIST_ENTRY, *PLIST_ENTRY; /* size: 0x0008 */

typedef struct _TP_NBQ_GUARD
{
  /* 0x0000 */ struct _LIST_ENTRY GuardLinks;
  /* 0x0008 */ void* Guards[2];
} TP_NBQ_GUARD, *PTP_NBQ_GUARD; /* size: 0x0010 */

typedef struct _TP_TASK_CALLBACKS
{
  /* 0x0000 */ void* ExecuteCallback /* function */;
  /* 0x0004 */ void* Unposted /* function */;
} TP_TASK_CALLBACKS, *PTP_TASK_CALLBACKS; /* size: 0x0008 */

typedef struct _TP_TASK
{
  /* 0x0000 */ const struct _TP_TASK_CALLBACKS* Callbacks;
  /* 0x0004 */ unsigned long NumaNode;
  /* 0x0008 */ unsigned char IdealProcessor;
  /* 0x0009 */ char Padding_0[3];
  /* 0x000c */ struct _TP_NBQ_GUARD PostGuard;
  /* 0x001c */ void* NBQNode;
} TP_TASK, *PTP_TASK; /* size: 0x0020 */

struct LIST_ENTRY32
{
  /* 0x0000 */ unsigned long Flink;
  /* 0x0004 */ unsigned long Blink;
}; /* size: 0x0008 */

typedef struct _EXCEPTION_REGISTRATION_RECORD
{
  /* 0x0000 */ struct _EXCEPTION_REGISTRATION_RECORD* Next;
  /* 0x0004 */ void* Handler /* function */;
} EXCEPTION_REGISTRATION_RECORD, *PEXCEPTION_REGISTRATION_RECORD; /* size: 0x0008 */

typedef struct _IO_STATUS_BLOCK
{
  union
  {
    /* 0x0000 */ long Status;
    /* 0x0000 */ void* Pointer;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned long Information;
} IO_STATUS_BLOCK, *PIO_STATUS_BLOCK; /* size: 0x0008 */

struct LIST_ENTRY64
{
  /* 0x0000 */ unsigned __int64 Flink;
  /* 0x0008 */ unsigned __int64 Blink;
}; /* size: 0x0010 */

typedef struct _TP_DIRECT
{
  /* 0x0000 */ void* Callback /* function */;
  /* 0x0004 */ unsigned long NumaNode;
  /* 0x0008 */ unsigned char IdealProcessor;
  /* 0x0009 */ char __PADDING__[3];
} TP_DIRECT, *PTP_DIRECT; /* size: 0x000c */

#include <poppack.h>
